{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713164"
                        ],
                        "name": "Alexandros Karatzoglou",
                        "slug": "Alexandros-Karatzoglou",
                        "structuredName": {
                            "firstName": "Alexandros",
                            "lastName": "Karatzoglou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexandros Karatzoglou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478897"
                        ],
                        "name": "X. Amatriain",
                        "slug": "X.-Amatriain",
                        "structuredName": {
                            "firstName": "X.",
                            "lastName": "Amatriain",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Amatriain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2666397"
                        ],
                        "name": "L. Baltrunas",
                        "slug": "L.-Baltrunas",
                        "structuredName": {
                            "firstName": "Linas",
                            "lastName": "Baltrunas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Baltrunas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145709776"
                        ],
                        "name": "Nuria Oliver",
                        "slug": "Nuria-Oliver",
                        "structuredName": {
                            "firstName": "Nuria",
                            "lastName": "Oliver",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nuria Oliver"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 90
                            }
                        ],
                        "text": "Multiverse Recommendation is learned with an SGD algorithm similar to the one proposed in [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 93
                            }
                        ],
                        "text": "In a third experiment, we investigate the artificially enriched Yahoo! Webscope dataset (see [5]) with an increasing influence of context variables on the rating."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[5] have proposed to apply the Tucker decomposition [20] to factorize the tensor over user, items and all categorical context variables directly."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 116,
                                "start": 113
                            }
                        ],
                        "text": "Currently, the most flexible and strongest approach in terms of prediction accuracy is Multiverse Recommendation [5] that relies on Tucker decomposition and allows to work with any categorical context."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 68,
                                "start": 65
                            }
                        ],
                        "text": "For the Yahoo! Webscope dataset (221367 rating events) we follow [5] and apply their method to generate datasets with an increasing number of dependency of the target on the context – we generate 9 datasets for α = β ∈ {0."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 97
                            }
                        ],
                        "text": "dataset [1] as well as the Yahoo! Webscope dataset(6) enriched with context-aware information by [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 65,
                                "start": 62
                            }
                        ],
                        "text": "Figure 6: The context-aware methods Multiverse Recommendation [5] and our proposed contextaware Factorization Machine benefit from incooperating the context-information into the rating prediction."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 126,
                                "start": 123
                            }
                        ],
                        "text": "The runtime of the Factorization Machine is linear in the number of latent factors k whereas for Multiverse Recommendation [5] it is polynomial (here O(k(4)))."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 97,
                                "start": 94
                            }
                        ],
                        "text": "dataset our implementation of Multiverse Recommendation performed much worse than reported in [5]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5908065,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b1c56e4049dcafe6f6752cbbeb889e975ea8e94e",
            "isKey": true,
            "numCitedBy": 766,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Context has been recognized as an important factor to consider in personalized Recommender Systems. However, most model-based Collaborative Filtering approaches such as Matrix Factorization do not provide a straightforward way of integrating context information into the model. In this work, we introduce a Collaborative Filtering method based on Tensor Factorization, a generalization of Matrix Factorization that allows for a flexible and generic integration of contextual information by modeling the data as a User-Item-Context N-dimensional tensor instead of the traditional 2D User-Item matrix. In the proposed model, called Multiverse Recommendation, different types of context are considered as additional dimensions in the representation of the data as a tensor. The factorization of this tensor leads to a compact model of the data which can be used to provide context-aware recommendations.\n We provide an algorithm to address the N-dimensional factorization, and show that the Multiverse Recommendation improves upon non-contextual Matrix Factorization up to 30% in terms of the Mean Absolute Error (MAE). We also compare to two state-of-the-art context-aware methods and show that Tensor Factorization consistently outperforms them both in semi-synthetic and real-world data - improvements range from 2.5% to more than 12% depending on the data. Noticeably, our approach outperforms other methods by a wider margin whenever more contextual information is available."
            },
            "slug": "Multiverse-recommendation:-n-dimensional-tensor-for-Karatzoglou-Amatriain",
            "title": {
                "fragments": [],
                "text": "Multiverse recommendation: n-dimensional tensor factorization for context-aware collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "This work introduces a Collaborative Filtering method based on Tensor Factorization, a generalization of Matrix Factorization that allows for a flexible and generic integration of contextual information by modeling the data as a User-Item-Context N-dimensional tensor instead of the traditional 2D User- Item matrix."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388781075"
                        ],
                        "name": "L. Schmidt-Thieme",
                        "slug": "L.-Schmidt-Thieme",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Schmidt-Thieme",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Schmidt-Thieme"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 183,
                                "start": 179
                            }
                        ],
                        "text": "This matches to results from the related area of tag recommendation, where a pairwise interaction model (PITF) outperforms the Tucker decomposition empirically in sparse problems [15]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 14
                            }
                        ],
                        "text": "pairwise ones [15]) instead of one m-ary relation (like the Tucker Decomposition)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 211,
                                "start": 207
                            }
                        ],
                        "text": "CONTEXT-AWARE RATING PREDICTION WITH FMS FMs are a generic model class that subsumes and can mimic several of the most successful recommender systems, among them matrix factorization [18], SVD++ [6] or PITF [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 161
                            }
                        ],
                        "text": "FMs are a generic model class that subsumes and can mimic several of the most successful recommender systems, among them matrix factorization [18], SVD++ [6] or PITF [15]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 139,
                                "start": 135
                            }
                        ],
                        "text": "Note that the\nMultiverse Recommendation model is the Tucker decomposition and the FM includes all possible pairwise interactions (like PITF)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 133
                            }
                        ],
                        "text": "FMs include and can mimic the most successful approaches in recommender systems including matrix factorizion [18], SVD++ [6] or PITF [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 207177737,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bf2b10e9a3bb73499666facf376918e8c275734e",
            "isKey": false,
            "numCitedBy": 663,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Tagging plays an important role in many recent websites. Recommender systems can help to suggest a user the tags he might want to use for tagging a specific item. Factorization models based on the Tucker Decomposition (TD) model have been shown to provide high quality tag recommendations outperforming other approaches like PageRank, FolkRank, collaborative filtering, etc. The problem with TD models is the cubic core tensor resulting in a cubic runtime in the factorization dimension for prediction and learning.\n In this paper, we present the factorization model PITF (Pairwise Interaction Tensor Factorization) which is a special case of the TD model with linear runtime both for learning and prediction. PITF explicitly models the pairwise interactions between users, items and tags. The model is learned with an adaption of the Bayesian personalized ranking (BPR) criterion which originally has been introduced for item recommendation. Empirically, we show on real world datasets that this model outperforms TD largely in runtime and even can achieve better prediction quality. Besides our lab experiments, PITF has also won the ECML/PKDD Discovery Challenge 2009 for graph-based tag recommendation."
            },
            "slug": "Pairwise-interaction-tensor-factorization-for-tag-Rendle-Schmidt-Thieme",
            "title": {
                "fragments": [],
                "text": "Pairwise interaction tensor factorization for personalized tag recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The factorization model PITF (Pairwise Interaction Tensor Factorization) is presented which is a special case of the TD model with linear runtime both for learning and prediction and shows that this model outperforms TD largely in runtime and even can achieve better prediction quality."
            },
            "venue": {
                "fragments": [],
                "text": "WSDM '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110457056"
                        ],
                        "name": "Yize Li",
                        "slug": "Yize-Li",
                        "structuredName": {
                            "firstName": "Yize",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yize Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38113961"
                        ],
                        "name": "Jiazhong Nie",
                        "slug": "Jiazhong-Nie",
                        "structuredName": {
                            "firstName": "Jiazhong",
                            "lastName": "Nie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jiazhong Nie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2153910463"
                        ],
                        "name": "Yi Zhang",
                        "slug": "Yi-Zhang",
                        "structuredName": {
                            "firstName": "Yi",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yi Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2510385"
                        ],
                        "name": "Bingqing Wang",
                        "slug": "Bingqing-Wang",
                        "structuredName": {
                            "firstName": "Bingqing",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bingqing Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1743388"
                        ],
                        "name": "B. Yan",
                        "slug": "B.-Yan",
                        "structuredName": {
                            "firstName": "Baoshi",
                            "lastName": "Yan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Yan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1807350"
                        ],
                        "name": "F. Weng",
                        "slug": "F.-Weng",
                        "structuredName": {
                            "firstName": "Fuliang",
                            "lastName": "Weng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Weng"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[8] suggest to see context as a user feature which is dynamic, i."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 11697971,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b5039561652b6f6a6d4d78e430bca177d3740b75",
            "isKey": false,
            "numCitedBy": 72,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "The potential benefit of integrating contextual information for recommendation has received much research attention recently, especially with the ever-increasing interest in mobile-based recommendation services. However, context based recommendation research is limited due to the lack of standard evaluation data with contextual information and reliable technology for extracting such information. As a result, there are no widely accepted conclusions on how, when and whether context helps. Additionally, a system often suffers from the so called cold start problem due to the lack of data for training the initial context based recommendation model. This paper proposes a novel solution to address these problems with automated information extraction techniques. We also compare several approaches for utilizing context based on a new data set collected using the proposed solution. The experimental results demonstrate that 1) IE-based techniques can help create a large scale context data with decent quality from online reviews, at least for restaurant recommendations; 2) context helps recommender systems rank items, however, does not help predict user ratings; 3) simply using context to filter items hurts recommendation performance, while a new probabilistic latent relational model we proposed helps."
            },
            "slug": "Contextual-Recommendation-based-on-Text-Mining-Li-Nie",
            "title": {
                "fragments": [],
                "text": "Contextual Recommendation based on Text Mining"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The experimental results demonstrate that 1) IE-based techniques can help create a large scale context data with decent quality from online reviews, at least for restaurant recommendations; 2) context helps recommender systems rank items, however, does not help predict user ratings; 3) simply using context to filter items hurts recommendation performance, while a new probabilistic latent relational model the authors proposed helps."
            },
            "venue": {
                "fragments": [],
                "text": "COLING"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2666397"
                        ],
                        "name": "L. Baltrunas",
                        "slug": "L.-Baltrunas",
                        "structuredName": {
                            "firstName": "Linas",
                            "lastName": "Baltrunas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Baltrunas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40169260"
                        ],
                        "name": "F. Ricci",
                        "slug": "F.-Ricci",
                        "structuredName": {
                            "firstName": "Francesco",
                            "lastName": "Ricci",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Ricci"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 46
                            }
                        ],
                        "text": "Examples for pre-processing are itemsplitting [3] or the multidimensional model of Adomavicius et al."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 161,
                                "start": 158
                            }
                        ],
                        "text": "They called their approach Multiverse Recommendation and have shown empirically that their approach results in better prediction accuracy than item-splitting [3] and the OLAP approach [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9240995,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bfe08ad63d46159e79547029e2ef3f20069677de",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Collaborative Filtering (CF) recommendations are computed by leveraging a historical data set of users' ratings for items. It assumes that the users' previously recorded ratings can help in predicting future ratings. This has been validated extensively, but in some domains item ratings can be influenced by contextual conditions, such as the time or the goal of the item consumption. This type of information is not exploited by standard CF models. This paper introduces and analyzes a novel pre-filtering technique for context-aware CF called item splitting. In this approach, the ratings of certain items are split, according to the value of an item-dependent contextual condition. Each split item generates two fictitious items that are used in the prediction algorithm instead of the original one. We evaluated this approach on real world and semi-synthetic data sets using matrix-factorization and nearest neighbor CF algorithms. We show that item splitting can be beneficial and its performance depends on the item selection method and on the influence of the contextual variables on the item ratings."
            },
            "slug": "Context-based-splitting-of-item-ratings-in-Baltrunas-Ricci",
            "title": {
                "fragments": [],
                "text": "Context-based splitting of item ratings in collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper introduces and analyzes a novel pre-filtering technique for context-aware CF called item splitting, in which the ratings of certain items are split, according to the value of an item-dependent contextual condition."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '09"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1793424"
                        ],
                        "name": "Kenta Oku",
                        "slug": "Kenta-Oku",
                        "structuredName": {
                            "firstName": "Kenta",
                            "lastName": "Oku",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kenta Oku"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1782520"
                        ],
                        "name": "Shinsuke Nakajima",
                        "slug": "Shinsuke-Nakajima",
                        "structuredName": {
                            "firstName": "Shinsuke",
                            "lastName": "Nakajima",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shinsuke Nakajima"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51177535"
                        ],
                        "name": "Jun Miyazaki",
                        "slug": "Jun-Miyazaki",
                        "structuredName": {
                            "firstName": "Jun",
                            "lastName": "Miyazaki",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jun Miyazaki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1687545"
                        ],
                        "name": "S. Uemura",
                        "slug": "S.-Uemura",
                        "structuredName": {
                            "firstName": "Shunsuke",
                            "lastName": "Uemura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Uemura"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[9] use SVMs for context-aware predictions – which have limitations in sparse applications like recommender systems as no 2-way interaction between items and users can be estimated directly [14]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1885910,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8a71825ec0cb74d3356165741afe30883afa5837",
            "isKey": false,
            "numCitedBy": 140,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The purpose of this study is to propose Context-Aware Support Vector Machine (C-SVM) for application in a context-dependent recommendation system. It is important to consider users’ contexts in information recommendation as users’ preference change with context. However, currently there are few methods which take into account users’ contexts (e.g. time, place, the situation and so on). Thus, we extend the functionality of a Support Vector Machines (SVM), a popular classifier method used between two classes, by adding axes of context to the feature space in order to consider the users’ context. We then applied the Context-Aware SVM (C-SVM) and the Collaborative Filtering System with Context-Aware SVM (C-SVM-CF) to a recommendation system for restaurants and then examined the effectiveness of each approach."
            },
            "slug": "Context-Aware-SVM-for-Context-Dependent-Information-Oku-Nakajima",
            "title": {
                "fragments": [],
                "text": "Context-Aware SVM for Context-Dependent Information Recommendation"
            },
            "venue": {
                "fragments": [],
                "text": "7th International Conference on Mobile Data Management (MDM'06)"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "…to investigate specialized methods that are supposed\nto be the best models for a certain problem, but on the other hand also research on general methods like contextaware recommenders is important as they offer the largest flexibility and may serve as (strong) baselines for specialized models."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 128
                            }
                        ],
                        "text": "The end-user (domain expert) has only to specify the input features (i.e. the x vector) and run a generic FM tool with this data.\nwe suggest a new alternating least square (ALS) learning algorithm that finds the optimal value for a model parameter given the remaining ones."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 29
                            }
                        ],
                        "text": "As the model equation of FMs can be calculated in linear time (see eq."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 41
                            }
                        ],
                        "text": "SIGIR’11, July 24–28, 2011, Beijing, China."
                    },
                    "intents": []
                }
            ],
            "corpusId": 17265929,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "df93596d4ed71d2863532c063c4c693711216abf",
            "isKey": false,
            "numCitedBy": 1819,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we introduce Factorization Machines (FM) which are a new model class that combines the advantages of Support Vector Machines (SVM) with factorization models. Like SVMs, FMs are a general predictor working with any real valued feature vector. In contrast to SVMs, FMs model all interactions between variables using factorized parameters. Thus they are able to estimate interactions even in problems with huge sparsity (like recommender systems) where SVMs fail. We show that the model equation of FMs can be calculated in linear time and thus FMs can be optimized directly. So unlike nonlinear SVMs, a transformation in the dual form is not necessary and the model parameters can be estimated directly without the need of any support vector in the solution. We show the relationship to SVMs and the advantages of FMs for parameter estimation in sparse settings. On the other hand there are many different factorization models like matrix factorization, parallel factor analysis or specialized models like SVD++, PITF or FPMC. The drawback of these models is that they are not applicable for general prediction tasks but work only with special input data. Furthermore their model equations and optimization algorithms are derived individually for each task. We show that FMs can mimic these models just by specifying the input data (i.e. the feature vectors). This makes FMs easily applicable even for users without expert knowledge in factorization models."
            },
            "slug": "Factorization-Machines-Rendle",
            "title": {
                "fragments": [],
                "text": "Factorization Machines"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "Factorization Machines (FM) are introduced which are a new model class that combines the advantages of Support Vector Machines (SVM) with factorization models and can mimic these models just by specifying the input data (i.e. the feature vectors)."
            },
            "venue": {
                "fragments": [],
                "text": "2010 IEEE International Conference on Data Mining"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646084"
                        ],
                        "name": "B. Sarwar",
                        "slug": "B.-Sarwar",
                        "structuredName": {
                            "firstName": "Badrul",
                            "lastName": "Sarwar",
                            "middleNames": [
                                "Munir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Sarwar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50877490"
                        ],
                        "name": "G. Karypis",
                        "slug": "G.-Karypis",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Karypis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Karypis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 117
                            }
                        ],
                        "text": "For example [19] or [2] present extensions of the matrix factorization model that can handle user and item attributes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8047550,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f82c52452c7de8cd6472202c1be2cce9fbcb8dda",
            "isKey": false,
            "numCitedBy": 8423,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems apply knowledge discovery techniques to the problem of making personalized recommendations for information, products or services during a live interaction. These systems, especially the k-nearest neighbor collaborative ltering based ones, are achieving widespread success on the Web. The tremendous growth in the amount of available information and the number of visitors to Web sites in recent years poses some key challenges for recommender systems. These are: producing high quality recommendations, performing many recommendations per second for millions of users and items and achieving high coverage in the face of data sparsity. In traditional collaborative ltering systems the amount of work increases with the number of participants in the system. New recommender system technologies are needed that can quickly produce high quality recommendations, even for very large-scale problems. To address these issues we have explored item-based collaborative ltering techniques. Item-based techniques rst analyze the user-item matrix to identify relationships between di erent items, and then use these relationships to indirectly compute recommendations for users. In this paper we analyze di erent item-based recommendation generation algorithms. We look into di erent techniques for computing item-item similarities (e.g., item-item correlation vs. cosine similarities between item vectors) and di erent techniques for obtaining recommendations from them (e.g., weighted sum vs. regression model). Finally, we experimentally evaluate our results and compare them to the basic k-nearest neighbor approach. Our experiments suggest that item-based algorithms provide dramatically better performance than user-based algorithms, while at the same time providing better quality than the best available userbased algorithms."
            },
            "slug": "Item-based-collaborative-filtering-recommendation-Sarwar-Karypis",
            "title": {
                "fragments": [],
                "text": "Item-based collaborative filtering recommendation algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper analyzes item-based collaborative ltering techniques and suggests that item- based algorithms provide dramatically better performance than user-based algorithms, while at the same time providing better quality than the best available userbased algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "WWW '01"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2425143"
                        ],
                        "name": "I. Pilászy",
                        "slug": "I.-Pilászy",
                        "structuredName": {
                            "firstName": "István",
                            "lastName": "Pilászy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Pilászy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2871013"
                        ],
                        "name": "Dávid Zibriczky",
                        "slug": "Dávid-Zibriczky",
                        "structuredName": {
                            "firstName": "Dávid",
                            "lastName": "Zibriczky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dávid Zibriczky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1754164"
                        ],
                        "name": "D. Tikk",
                        "slug": "D.-Tikk",
                        "structuredName": {
                            "firstName": "Domonkos",
                            "lastName": "Tikk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tikk"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 16
                            }
                        ],
                        "text": "Both approaches [4, 13] work only for matrix factorizations and thus cannot handle any context like our proposed FMs which model all interactions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[13] have proposed to optimize the factors within each user (resp."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1816937,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5ccd14d553d547384d7a848a6a532e65f1fd6746",
            "isKey": false,
            "numCitedBy": 169,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Alternating least squares (ALS) is a powerful matrix factorization (MF) algorithm for both explicit and implicit feedback based recommender systems. As shown in many articles, increasing the number of latent factors (denoted by K) boosts the prediction accuracy of MF based recommender systems, including ALS as well. The price of the better accuracy is paid by the increased running time: the running time of the original version of ALS is proportional to K3. Yet, the running time of model building can be important in recommendation systems; if the model cannot keep up with the changing item portfolio and/or user profile, the prediction accuracy can be degraded.\n In this paper we present novel and fast ALS variants both for the implicit and explicit feedback datasets, which offers better trade-off between running time and accuracy. Due to the significantly lower computational complexity of the algorithm - linear in terms of K - the model being generated under the same amount of time is more accurate, since the faster training enables to build model with more latent factors. We demonstrate the efficiency of our ALS variants on two datasets using two performance measures, RMSE and average relative position (ARP), and show that either a significantly more accurate model can be generated under the same amount of time or a model with similar prediction accuracy can be created faster; for explicit feedback the speed-up factor can be even 5-10."
            },
            "slug": "Fast-als-based-matrix-factorization-for-explicit-Pilászy-Zibriczky",
            "title": {
                "fragments": [],
                "text": "Fast als-based matrix factorization for explicit and implicit feedback datasets"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "Novel and fast ALS variants both for the implicit and explicit feedback datasets, which offers better trade-off between running time and accuracy and either a significantly more accurate model can be generated under the same amount of time or a model with similar prediction accuracy can be created faster."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744007"
                        ],
                        "name": "Gediminas Adomavicius",
                        "slug": "Gediminas-Adomavicius",
                        "structuredName": {
                            "firstName": "Gediminas",
                            "lastName": "Adomavicius",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gediminas Adomavicius"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32377897"
                        ],
                        "name": "R. Sankaranarayanan",
                        "slug": "R.-Sankaranarayanan",
                        "structuredName": {
                            "firstName": "Ramesh",
                            "lastName": "Sankaranarayanan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sankaranarayanan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47274391"
                        ],
                        "name": "S. Sen",
                        "slug": "S.-Sen",
                        "structuredName": {
                            "firstName": "Shahana",
                            "lastName": "Sen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680593"
                        ],
                        "name": "A. Tuzhilin",
                        "slug": "A.-Tuzhilin",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Tuzhilin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tuzhilin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 8
                            }
                        ],
                        "text": "dataset [1] as well as the Yahoo! Webscope dataset(6) enriched with context-aware information by [5]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 187,
                                "start": 184
                            }
                        ],
                        "text": "They called their approach Multiverse Recommendation and have shown empirically that their approach results in better prediction accuracy than item-splitting [3] and the OLAP approach [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1914653,
            "fieldsOfStudy": [
                "Computer Science",
                "Business"
            ],
            "id": "95f05137fdd0928d73e715b1728f2476178619a4",
            "isKey": false,
            "numCitedBy": 1252,
            "numCiting": 98,
            "paperAbstract": {
                "fragments": [],
                "text": "The article presents a multidimensional (MD) approach to recommender systems that can provide recommendations based on additional contextual information besides the typical information on users and items used in most of the current recommender systems. This approach supports multiple dimensions, profiling information, and hierarchical aggregation of recommendations. The article also presents a multidimensional rating estimation method capable of selecting two-dimensional segments of ratings pertinent to the recommendation context and applying standard collaborative filtering or other traditional two-dimensional rating estimation techniques to these segments. A comparison of the multidimensional and two-dimensional rating estimation approaches is made, and the tradeoffs between the two are studied. Moreover, the article introduces a combined rating estimation method, which identifies the situations where the MD approach outperforms the standard two-dimensional approach and uses the MD approach in those situations and the standard two-dimensional approach elsewhere. Finally, the article presents a pilot empirical study of the combined approach, using a multidimensional movie recommender system that was developed for implementing this approach and testing its performance."
            },
            "slug": "Incorporating-contextual-information-in-recommender-Adomavicius-Sankaranarayanan",
            "title": {
                "fragments": [],
                "text": "Incorporating contextual information in recommender systems using a multidimensional approach"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "A multidimensional (MD) approach to recommender systems that can provide recommendations based on additional contextual information besides the typical information on users and items used in most of the currentRecommender systems is presented."
            },
            "venue": {
                "fragments": [],
                "text": "TOIS"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 121
                            }
                        ],
                        "text": "FMs include and can mimic the most successful approaches in recommender systems including matrix factorizion [18], SVD++ [6] or PITF [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 198,
                                "start": 195
                            }
                        ],
                        "text": "CONTEXT-AWARE RATING PREDICTION WITH FMS FMs are a generic model class that subsumes and can mimic several of the most successful recommender systems, among them matrix factorization [18], SVD++ [6] or PITF [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 0
                            }
                        ],
                        "text": "[18, 6]) have become very popular as they usually outperform traditional k-nearest neighbor methods (e."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 153,
                                "start": 148
                            }
                        ],
                        "text": "FMs are a generic model class that subsumes and can mimic several of the most successful recommender systems, among them matrix factorization [18], SVD++ [6] or PITF [15]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 207168823,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cf6f83fcce274606bf0264c59d1c78a30c9c9d18",
            "isKey": true,
            "numCitedBy": 3612,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems provide users with personalized suggestions for products or services. These systems often rely on Collaborating Filtering (CF), where past transactions are analyzed in order to establish connections between users and products. The two more successful approaches to CF are latent factor models, which directly profile both users and products, and neighborhood models, which analyze similarities between products or users. In this work we introduce some innovations to both approaches. The factor and neighborhood models can now be smoothly merged, thereby building a more accurate combined model. Further accuracy improvements are achieved by extending the models to exploit both explicit and implicit feedback by the users. The methods are tested on the Netflix data. Results are better than those previously published on that dataset. In addition, we suggest a new evaluation metric, which highlights the differences among methods, based on their performance at a top-K recommendation task."
            },
            "slug": "Factorization-meets-the-neighborhood:-a-filtering-Koren",
            "title": {
                "fragments": [],
                "text": "Factorization meets the neighborhood: a multifaceted collaborative filtering model"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "The factor and neighborhood models can now be smoothly merged, thereby building a more accurate combined model and a new evaluation metric is suggested, which highlights the differences among methods, based on their performance at a top-K recommendation task."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113591957"
                        ],
                        "name": "Robert M. Bell",
                        "slug": "Robert-M.-Bell",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bell",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Robert M. Bell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 100
                            }
                        ],
                        "text": "3 Alternating Least Square Optimization For the model class of matrix factorization, Bell and Koren [4] proposed an ALS method that alternates between optimizing all user factors and all item factors."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 7
                            }
                        ],
                        "text": "[6] Y. Koren."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 16
                            }
                        ],
                        "text": "Both approaches [4, 13] work only for matrix factorizations and thus cannot handle any context like our proposed FMs which model all interactions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 12,
                                "start": 7
                            }
                        ],
                        "text": "[7] Y. Koren."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 22
                            }
                        ],
                        "text": "[4] R. M. Bell and Y. Koren."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 45
                            }
                        ],
                        "text": "For the model class of matrix factorization, Bell and Koren [4] proposed an ALS method that alternates between optimizing all user factors and all item factors."
                    },
                    "intents": []
                }
            ],
            "corpusId": 206784101,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0c953e630cccd64d2ad5fbb09f08425e7f82b7a3",
            "isKey": true,
            "numCitedBy": 559,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems based on collaborative filtering predict user preferences for products or services by learning past user-item relationships. A predominant approach to collaborative filtering is neighborhood based (\"k-nearest neighbors\"), where a user-item preference rating is interpolated from ratings of similar items and/or users. We enhance the neighborhood-based approach leading to substantial improvement of prediction accuracy, without a meaningful increase in running time. First, we remove certain so-called \"global effects\" from the data to make the ratings more comparable, thereby improving interpolation accuracy. Second, we show how to simultaneously derive interpolation weights for all nearest neighbors, unlike previous approaches where each weight is computed separately. By globally solving a suitable optimization problem, this simultaneous interpolation accounts for the many interactions between neighbors leading to improved accuracy. Our method is very fast in practice, generating a prediction in about 0.2 milliseconds. Importantly, it does not require training many parameters or a lengthy preprocessing, making it very practical for large scale applications. Finally, we show how to apply these methods to the perceivably much slower user-oriented approach. To this end, we suggest a novel scheme for low dimensional embedding of the users. We evaluate these methods on the netflix dataset, where they deliver significantly better results than the commercial netflix cinematch recommender system."
            },
            "slug": "Scalable-Collaborative-Filtering-with-Jointly-Bell-Koren",
            "title": {
                "fragments": [],
                "text": "Scalable Collaborative Filtering with Jointly Derived Neighborhood Interpolation Weights"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work enhances the neighborhood-based approach leading to substantial improvement of prediction accuracy, without a meaningful increase in running time, and suggests a novel scheme for low dimensional embedding of the users."
            },
            "venue": {
                "fragments": [],
                "text": "Seventh IEEE International Conference on Data Mining (ICDM 2007)"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2345440"
                        ],
                        "name": "Umberto Panniello",
                        "slug": "Umberto-Panniello",
                        "structuredName": {
                            "firstName": "Umberto",
                            "lastName": "Panniello",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Umberto Panniello"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680593"
                        ],
                        "name": "A. Tuzhilin",
                        "slug": "A.-Tuzhilin",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Tuzhilin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tuzhilin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1846289"
                        ],
                        "name": "M. Gorgoglione",
                        "slug": "M.-Gorgoglione",
                        "structuredName": {
                            "firstName": "Michele",
                            "lastName": "Gorgoglione",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gorgoglione"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34699218"
                        ],
                        "name": "C. Palmisano",
                        "slug": "C.-Palmisano",
                        "structuredName": {
                            "firstName": "Cosimo",
                            "lastName": "Palmisano",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Palmisano"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1674931744"
                        ],
                        "name": "A. Pedone",
                        "slug": "A.-Pedone",
                        "structuredName": {
                            "firstName": "Antonio",
                            "lastName": "Pedone",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Pedone"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 275,
                                "start": 271
                            }
                        ],
                        "text": "The most basic approaches are contextual pre-filtering and post-filtering where a standard context-unaware recommender system is applied and the data is either preprocessed based on the context of interest before applying the recommender or the results are postprocessed [11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12117764,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "f562be080fd82c82c592441ea009dbfca1487cf1",
            "isKey": false,
            "numCitedBy": 201,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Recently, methods for generating context-aware recommendations were classified into the pre-filtering, post-filtering and contextual modeling approaches. Although some of these methods have been studied independently, no prior research compared the performance of these methods to determine which of them is better than the others. This paper focuses on comparing the pre-filtering and the post-filtering approaches and identifying which method dominates the other and under which circumstances. Since there are no clear winners in this comparison, we propose an alternative more effective method of selecting the winners in the pre- vs. the post-filtering comparison. This strategy provides analysts and companies with a practical suggestion on how to pick a good pre- or post-filtering approach in an effective manner to improve performance of a context-aware recommender system."
            },
            "slug": "Experimental-comparison-of-pre-vs.-post-filtering-Panniello-Tuzhilin",
            "title": {
                "fragments": [],
                "text": "Experimental comparison of pre- vs. post-filtering approaches in context-aware recommender systems"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This strategy provides analysts and companies with a practical suggestion on how to pick a good pre- or post-filtering approach in an effective manner to improve performance of a context-aware recommender system."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '09"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40404161"
                        ],
                        "name": "A. Said",
                        "slug": "A.-Said",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Said",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Said"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696183"
                        ],
                        "name": "S. Berkovsky",
                        "slug": "S.-Berkovsky",
                        "structuredName": {
                            "firstName": "Shlomo",
                            "lastName": "Berkovsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Berkovsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "11125040"
                        ],
                        "name": "E. D. De Luca",
                        "slug": "E.-D.-De-Luca",
                        "structuredName": {
                            "firstName": "Ernesto",
                            "lastName": "De Luca",
                            "middleNames": [
                                "William"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. D. De Luca"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 92,
                                "start": 88
                            }
                        ],
                        "text": "There is also some research on context-aware recommendation systems for item prediction [16], which is a ranking task instead of a regression task like the problem we are dealing with in this paper."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 11511098,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "11e4c472573f49c3b20b2f5f6ec8b6d471942236",
            "isKey": false,
            "numCitedBy": 74,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "The Challenge on Context-Aware Movie Recommendation (CAMRa) was conducted as part of a join event on Context-Awareness in Recommender Systems at the 2010 ACM Recommender Systems conference. The challenge focused on three context-aware recommendation tasks: time-based, mood-based, and social recommendation. The participants were provided with anonymized datasets from two real world online movie recommendation communities and competed against each other for obtaining the highest recommendation accuracy for each task. The datasets contained contextual features, such as mood, plot annotation, social network, and comments, normally not available in movie recommendation datasets. Over 40 teams from 20 countries participated in the challenge. Their participation was summarized by 10 papers accepted to the CAMRa workshop."
            },
            "slug": "Putting-things-in-context:-Challenge-on-Movie-Said-Berkovsky",
            "title": {
                "fragments": [],
                "text": "Putting things in context: Challenge on Context-Aware Movie Recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "The Challenge on Context-Aware Movie Recommendation (CAMRa) was conducted as part of a join event at the 2010 ACM Recommender Systems conference and provided anonymized datasets from two real world online movie recommendation communities."
            },
            "venue": {
                "fragments": [],
                "text": "CAMRa '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2596058"
                        ],
                        "name": "D. Agarwal",
                        "slug": "D.-Agarwal",
                        "structuredName": {
                            "firstName": "Deepak",
                            "lastName": "Agarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Agarwal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34252531"
                        ],
                        "name": "Bee-Chung Chen",
                        "slug": "Bee-Chung-Chen",
                        "structuredName": {
                            "firstName": "Bee-Chung",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bee-Chung Chen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 20
                            }
                        ],
                        "text": "For example [19] or [2] present extensions of the matrix factorization model that can handle user and item attributes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17484284,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "82a3074be5297bad6b279c006c7a5507f8c54555",
            "isKey": false,
            "numCitedBy": 534,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a novel latent factor model to accurately predict response for large scale dyadic data in the presence of features. Our approach is based on a model that predicts response as a multiplicative function of row and column latent factors that are estimated through separate regressions on known row and column features. In fact, our model provides a single unified framework to address both cold and warm start scenarios that are commonplace in practical applications like recommender systems, online advertising, web search, etc. We provide scalable and accurate model fitting methods based on Iterated Conditional Mode and Monte Carlo EM algorithms. We show our model induces a stochastic process on the dyadic space with kernel (covariance) given by a polynomial function of features. Methods that generalize our procedure to estimate factors in an online fashion for dynamic applications are also considered. Our method is illustrated on benchmark datasets and a novel content recommendation application that arises in the context of Yahoo! Front Page. We report significant improvements over several commonly used methods on all datasets."
            },
            "slug": "Regression-based-latent-factor-models-Agarwal-Chen",
            "title": {
                "fragments": [],
                "text": "Regression-based latent factor models"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "A novel latent factor model to accurately predict response for large scale dyadic data in the presence of features is proposed and induces a stochastic process on the dyadic space with kernel given by a polynomial function of features."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1774027"
                        ],
                        "name": "C. Ono",
                        "slug": "C.-Ono",
                        "structuredName": {
                            "firstName": "Chihiro",
                            "lastName": "Ono",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Ono"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2466117"
                        ],
                        "name": "Y. Takishima",
                        "slug": "Y.-Takishima",
                        "structuredName": {
                            "firstName": "Yasuhiro",
                            "lastName": "Takishima",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Takishima"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3056420"
                        ],
                        "name": "Y. Motomura",
                        "slug": "Y.-Motomura",
                        "structuredName": {
                            "firstName": "Yoichi",
                            "lastName": "Motomura",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Motomura"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7142317"
                        ],
                        "name": "H. Asoh",
                        "slug": "H.-Asoh",
                        "structuredName": {
                            "firstName": "Hideki",
                            "lastName": "Asoh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Asoh"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 162,
                                "start": 158
                            }
                        ],
                        "text": "Even though the problem of context-aware rating prediction is highly relevant in practice, there are only a few publicly available datasets: the Food dataset [10], the Adom."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 43378600,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "67143c762a810fa200b7bfb6d3c4a1a1f64a4b5d",
            "isKey": false,
            "numCitedBy": 87,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a novel approach for constructing statistical preference models for context-aware recommender systems. To do so, one of the most important but difficult problems is acquiring sufficient training data in various contexts/situations. Particularly, some situations require a heavy workload to set them up or to collect subjects under those situations. To avoid this, often a large amount of data in a supposed situation is collected, i.e., a situation where the subject pretends/imagines that he/she is in a specific situation. Although there may be difference between the preference in the real situation and the supposed situation, this has not been considered in existing researches. Here, to study the difference, we collected a certain amount of corresponding data. We asked subjects the same question about preference both in the real and the supposed situation. Then we proposed a new model construction method using a difference model constructed from the correspondence data and showed the effectiveness through the experiments."
            },
            "slug": "Context-Aware-Preference-Model-Based-on-a-Study-of-Ono-Takishima",
            "title": {
                "fragments": [],
                "text": "Context-Aware Preference Model Based on a Study of Difference between Real and Supposed Situation Data"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "A novel approach for constructing statistical preference models for context-aware recommender systems using a difference model constructed from the correspondence data and the effectiveness through the experiments is shown."
            },
            "venue": {
                "fragments": [],
                "text": "UMAP"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2425143"
                        ],
                        "name": "I. Pilászy",
                        "slug": "I.-Pilászy",
                        "structuredName": {
                            "firstName": "István",
                            "lastName": "Pilászy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Pilászy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1754164"
                        ],
                        "name": "D. Tikk",
                        "slug": "D.-Tikk",
                        "structuredName": {
                            "firstName": "Domonkos",
                            "lastName": "Tikk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tikk"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 151
                            }
                        ],
                        "text": "However, meta-data often yields in only little or no improvement over strong baseline methods for rating prediction if enough feedback data is present [12]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17687390,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "93328df89c83d13428b562f13c258a45fc0e44c9",
            "isKey": false,
            "numCitedBy": 169,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "The Netflix Prize (NP) competition gave much attention to collaborative filtering (CF) approaches. Matrix factorization (MF) based CF approaches assign low dimensional feature vectors to users and items. We link CF and content-based filtering (CBF) by finding a linear transformation that transforms user or item descriptions so that they are as close as possible to the feature vectors generated by MF for CF. We propose methods for explicit feedback that are able to handle 140,000 features when feature vectors are very sparse. With movie metadata collected for the NP movies we show that the prediction performance of the methods is comparable to that of CF, and can be used to predict user preferences on new movies. We also investigate the value of movie metadata compared to movie ratings in regards of predictive power. We compare our solely CBF approach with a simple baseline rating-based predictor. We show that even 10 ratings of a new movie are more valuable than its metadata for predicting user ratings."
            },
            "slug": "Recommending-new-movies:-even-a-few-ratings-are-Pilászy-Tikk",
            "title": {
                "fragments": [],
                "text": "Recommending new movies: even a few ratings are more valuable than metadata"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This work links CF and content-based filtering (CBF) by finding a linear transformation that transforms user or item descriptions so that they are as close as possible to the feature vectors generated by MF for CF."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '09"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47547090"
                        ],
                        "name": "David H. Stern",
                        "slug": "David-H.-Stern",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Stern",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David H. Stern"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3234984"
                        ],
                        "name": "R. Herbrich",
                        "slug": "R.-Herbrich",
                        "structuredName": {
                            "firstName": "Ralf",
                            "lastName": "Herbrich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Herbrich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1686971"
                        ],
                        "name": "T. Graepel",
                        "slug": "T.-Graepel",
                        "structuredName": {
                            "firstName": "Thore",
                            "lastName": "Graepel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Graepel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[19] who extend a matrix factorization model."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 12
                            }
                        ],
                        "text": "For example [19] or [2] present extensions of the matrix factorization model that can handle user and item attributes."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15614767,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "abfb3352a188c7f3e7ad518dcf0dbcff480bcec4",
            "isKey": false,
            "numCitedBy": 274,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a probabilistic model for generating personalised recommendations of items to users of a web service. The Matchbox system makes use of content information in the form of user and item meta data in combination with collaborative filtering information from previous user behavior in order to predict the value of an item for a user. Users and items are represented by feature vectors which are mapped into a low-dimensional `trait space' in which similarity is measured in terms of inner products. The model can be trained from different types of feedback in order to learn user-item preferences. Here we present three alternatives: direct observation of an absolute rating each user gives to some items, observation of a binary preference (like/ don't like) and observation of a set of ordinal ratings on a user-specific scale. Efficient inference is achieved by approximate message passing involving a combination of Expectation Propagation (EP) and Variational Message Passing. We also include a dynamics model which allows an item's popularity, a user's taste or a user's personal rating scale to drift over time. By using Assumed-Density Filtering (ADF) for training, the model requires only a single pass through the training data. This is an on-line learning algorithm capable of incrementally taking account of new data so the system can immediately reflect the latest user preferences. We evaluate the performance of the algorithm on the MovieLens and Netflix data sets consisting of approximately 1,000,000 and 100,000,000 ratings respectively. This demonstrates that training the model using the on-line ADF approach yields state-of-the-art performance with the option of improving performance further if computational resources are available by performing multiple EP passes over the training data."
            },
            "slug": "Matchbox:-large-scale-online-bayesian-Stern-Herbrich",
            "title": {
                "fragments": [],
                "text": "Matchbox: large scale online bayesian recommendations"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "This work presents a probabilistic model for generating personalised recommendations of items to users of a web service capable of incrementally taking account of new data so the system can immediately reflect the latest user preferences and demonstrates that training the model using the on-line ADF approach yields state-of-the-art performance."
            },
            "venue": {
                "fragments": [],
                "text": "WWW '09"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068236719"
                        ],
                        "name": "L. Xiong",
                        "slug": "L.-Xiong",
                        "structuredName": {
                            "firstName": "Liang",
                            "lastName": "Xiong",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Xiong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1683647"
                        ],
                        "name": "X. Chen",
                        "slug": "X.-Chen",
                        "structuredName": {
                            "firstName": "X.",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1734755"
                        ],
                        "name": "Tzu-Kuo Huang",
                        "slug": "Tzu-Kuo-Huang",
                        "structuredName": {
                            "firstName": "Tzu-Kuo",
                            "lastName": "Huang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tzu-Kuo Huang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753432"
                        ],
                        "name": "J. Schneider",
                        "slug": "J.-Schneider",
                        "structuredName": {
                            "firstName": "Jeff",
                            "lastName": "Schneider",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schneider"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143712374"
                        ],
                        "name": "J. Carbonell",
                        "slug": "J.-Carbonell",
                        "structuredName": {
                            "firstName": "Jaime",
                            "lastName": "Carbonell",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Carbonell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 4
                            }
                        ],
                        "text": "In the second main part, we propose a new fast alternating least square (ALS) optimization algorithm that makes FM much easier applicable compared to SGD algorithms because it works without any learning rate."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1173916,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ee4129e6187302b1d1fd1aa7604d9bee40a865cf",
            "isKey": false,
            "numCitedBy": 638,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Real-world relational data are seldom stationary, yet traditional collaborative filtering algorithms generally rely on this assumption. Motivated by our sales prediction problem, we propose a factor-based algorithm that is able to take time into account. By introducing additional factors for time, we formalize this problem as a tensor factorization with a special constraint on the time dimension. Further, we provide a fully Bayesian treatment to avoid tuning parameters and achieve automatic model complexity control. To learn the model we develop an efficient sampling procedure that is capable of analyzing large-scale data sets. This new algorithm, called Bayesian Probabilistic Tensor Factorization (BPTF), is evaluated on several real-world problems including sales prediction and movie recommendation. Empirical results demonstrate the superiority of our temporal model."
            },
            "slug": "Temporal-Collaborative-Filtering-with-Bayesian-Xiong-Chen",
            "title": {
                "fragments": [],
                "text": "Temporal Collaborative Filtering with Bayesian Probabilistic Tensor Factorization"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work proposes a factor-based algorithm that is able to take time into account, and provides a fully Bayesian treatment to avoid tuning parameters and achieve automatic model complexity control."
            },
            "venue": {
                "fragments": [],
                "text": "SDM"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "In the second main part, we propose a new fast alternating least square (ALS) optimization algorithm that makes FM much easier applicable compared to SGD algorithms because it works without any learning rate."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3022077,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c1aa28159e768b75d0f4637a71d20da02efe1ef2",
            "isKey": false,
            "numCitedBy": 1668,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Customer preferences for products are drifting over time. Product perception and popularity are constantly changing as new selection emerges. Similarly, customer inclinations are evolving, leading them to ever redefine their taste. Thus, modeling temporal dynamics should be a key when designing recommender systems or general customer preference models. However, this raises unique challenges. Within the eco-system intersecting multiple products and customers, many different characteristics are shifting simultaneously, while many of them influence each other and often those shifts are delicate and associated with a few data instances. This distinguishes the problem from concept drift explorations, where mostly a single concept is tracked. Classical time-window or instance-decay approaches cannot work, as they lose too much signal when discarding data instances. A more sensitive approach is required, which can make better distinctions between transient effects and long term patterns. The paradigm we offer is creating a model tracking the time changing behavior throughout the life span of the data. This allows us to exploit the relevant components of all data instances, while discarding only what is modeled as being irrelevant. Accordingly, we revamp two leading collaborative filtering recommendation approaches. Evaluation is made on a large movie rating dataset by Netflix. Results are encouraging and better than those previously reported on this dataset."
            },
            "slug": "Collaborative-filtering-with-temporal-dynamics-Koren",
            "title": {
                "fragments": [],
                "text": "Collaborative filtering with temporal dynamics"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Two leading collaborative filtering recommendation approaches are revamp and a more sensitive approach is required, which can make better distinctions between transient effects and long term patterns."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1706280"
                        ],
                        "name": "Nathan Srebro",
                        "slug": "Nathan-Srebro",
                        "structuredName": {
                            "firstName": "Nathan",
                            "lastName": "Srebro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nathan Srebro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35211659"
                        ],
                        "name": "Jason D. M. Rennie",
                        "slug": "Jason-D.-M.-Rennie",
                        "structuredName": {
                            "firstName": "Jason",
                            "lastName": "Rennie",
                            "middleNames": [
                                "D.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jason D. M. Rennie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35132120"
                        ],
                        "name": "T. Jaakkola",
                        "slug": "T.-Jaakkola",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Jaakkola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Jaakkola"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[18]) for the user u and the item i, one can see that the FM contains also exactly this factorization: 〈vi,vu〉."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 113,
                                "start": 109
                            }
                        ],
                        "text": "FMs include and can mimic the most successful approaches in recommender systems including matrix factorizion [18], SVD++ [6] or PITF [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 187,
                                "start": 183
                            }
                        ],
                        "text": "CONTEXT-AWARE RATING PREDICTION WITH FMS FMs are a generic model class that subsumes and can mimic several of the most successful recommender systems, among them matrix factorization [18], SVD++ [6] or PITF [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 0
                            }
                        ],
                        "text": "[18, 6]) have become very popular as they usually outperform traditional k-nearest neighbor methods (e."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5048382,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cedf154c28178370d95510112413dc8cb48120a8",
            "isKey": true,
            "numCitedBy": 1128,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a novel approach to collaborative prediction, using low-norm instead of low-rank factorizations. The approach is inspired by, and has strong connections to, large-margin linear discrimination. We show how to learn low-norm factorizations by solving a semi-definite program, and discuss generalization error bounds for them."
            },
            "slug": "Maximum-Margin-Matrix-Factorization-Srebro-Rennie",
            "title": {
                "fragments": [],
                "text": "Maximum-Margin Matrix Factorization"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "A novel approach to collaborative prediction is presented, using low-norm instead of low-rank factorizations, inspired by, and has strong connections to, large-margin linear discrimination."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50477565"
                        ],
                        "name": "L. Tucker",
                        "slug": "L.-Tucker",
                        "structuredName": {
                            "firstName": "Ledyard",
                            "lastName": "Tucker",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Tucker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 56,
                                "start": 52
                            }
                        ],
                        "text": "[5] have proposed to apply the Tucker decomposition [20] to factorize the tensor over user, items and all categorical context variables directly."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 44301099,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "6661789de63b3cebe2eafdd7e9e7a316ad1f0b8f",
            "isKey": false,
            "numCitedBy": 3327,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The model for three-mode factor analysis is discussed in terms of newer applications of mathematical processes including a type of matrix process termed the Kronecker product and the definition of combination variables. Three methods of analysis to a type of extension of principal components analysis are discussed. Methods II and III are applicable to analysis of data collected for a large sample of individuals. An extension of the model is described in which allowance is made for unique variance for each combination variable when the data are collected for a large sample of individuals."
            },
            "slug": "Some-mathematical-notes-on-three-mode-factor-Tucker",
            "title": {
                "fragments": [],
                "text": "Some mathematical notes on three-mode factor analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The model for three-mode factor analysis is discussed in terms of newer applications of mathematical processes including a type of matrix process termed the Kronecker product and the definition of combination variables."
            },
            "venue": {
                "fragments": [],
                "text": "Psychometrika"
            },
            "year": 1966
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 16,
            "methodology": 9,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 21,
        "totalPages": 3
    },
    "page_url": "https://www.semanticscholar.org/paper/Fast-context-aware-recommendations-with-machines-Rendle-Gantner/1683ffc189d16b616131c300f45af87602d211f7?sort=total-citations"
}