{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40022141"
                        ],
                        "name": "R. Valerio",
                        "slug": "R.-Valerio",
                        "structuredName": {
                            "firstName": "Roberto",
                            "lastName": "Valerio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Valerio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2536342"
                        ],
                        "name": "R. Navarro",
                        "slug": "R.-Navarro",
                        "structuredName": {
                            "firstName": "Rafael",
                            "lastName": "Navarro",
                            "middleNames": [
                                "Fonolla"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Navarro"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 37
                            }
                        ],
                        "text": "Several recent image representations [25, 16, 15, 10] include spatially varying divisive normalization (DN ) as simple nonlinear map, where each component in a cluster of coefficients is divided by the square root of a linear combination of the squared amplitudes of its neighbors."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6141443,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9ae6c66774b898c6a836f9fd301e30d0875a5d1b",
            "isKey": false,
            "numCitedBy": 5,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a multiscale nonlinear image representation that permits an efficient coding of natural images. The input image is first decomposed into a set of subbands at multiple scales and orientations using near-orthogonal symmetric quadrature mirror filters. This is followed by a nonlinear “divisive normalization” stage, in which each linear coefficient is divided by a value computed from a small set of neighboring coefficients in space, orientation and scale. This neighborhood is chosen to allow this nonlinear operation to be efficiently inverted. The parameters of the normalization operation are optimized in order to maximize the independence of the normalized responses for natural images. We demonstrate the near-independence of these nonlinear responses, and suggest a number of applications for which this representation should be well suited."
            },
            "slug": "Directly-Invertible-Nonlinear-Divisive-Pyramid-for-Valerio-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Directly Invertible Nonlinear Divisive Normalization Pyramid for Image Representation"
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "A multiscale nonlinear image representation that permits an efficient coding of natural images and demonstrates the near-independence of these nonlinear responses, and suggests a number of applications for which this representation should be well suited."
            },
            "venue": {
                "fragments": [],
                "text": "VLBV"
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144432320"
                        ],
                        "name": "J. Malo",
                        "slug": "J.-Malo",
                        "structuredName": {
                            "firstName": "Jesús",
                            "lastName": "Malo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Malo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2137991"
                        ],
                        "name": "I. Epifanio",
                        "slug": "I.-Epifanio",
                        "structuredName": {
                            "firstName": "Irene",
                            "lastName": "Epifanio",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Epifanio"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2536342"
                        ],
                        "name": "R. Navarro",
                        "slug": "R.-Navarro",
                        "structuredName": {
                            "firstName": "Rafael",
                            "lastName": "Navarro",
                            "middleNames": [
                                "Fonolla"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Navarro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 197,
                                "start": 193
                            }
                        ],
                        "text": "An obvious candidate is compression: a previous normalization representation based on a block-DCT decomposition exhibited substantial improvements in perceptual appearance of compressed images [15]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 32
                            }
                        ],
                        "text": "Nevertheless it can be inverted [15], and here we develop a more efficient iterative procedure for doing so."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 37
                            }
                        ],
                        "text": "Several recent image representations [25, 16, 15, 10] include spatially varying divisive normalization (DN ) as simple nonlinear map, where each component in a cluster of coefficients is divided by the square root of a linear combination of the squared amplitudes of its neighbors."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "ified DNT representation will be invertible (see [15]), we have not encountered any failures in practice."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2094249,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "983d565e866875d0bbcb7fbc656c3f17c6353a55",
            "isKey": false,
            "numCitedBy": 114,
            "numCiting": 67,
            "paperAbstract": {
                "fragments": [],
                "text": "Image compression systems commonly operate by transforming the input signal into a new representation whose elements are independently quantized. The success of such a system depends on two properties of the representation. First, the coding rate is minimized only if the elements of the representation are statistically independent. Second, the perceived coding distortion is minimized only if the errors in a reconstructed image arising from quantization of the different elements of the representation are perceptually independent. We argue that linear transforms cannot achieve either of these goals and propose, instead, an adaptive nonlinear image representation in which each coefficient of a linear transform is divided by a weighted sum of coefficient amplitudes in a generalized neighborhood. We then show that the divisive operation greatly reduces both the statistical and the perceptual redundancy amongst representation elements. We develop an efficient method of inverting this transformation, and we demonstrate through simulations that the dual reduction in dependency can greatly improve the visual quality of compressed images."
            },
            "slug": "Nonlinear-image-representation-for-efficient-coding-Malo-Epifanio",
            "title": {
                "fragments": [],
                "text": "Nonlinear image representation for efficient perceptual coding"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This work proposes an adaptive nonlinear image representation in which each coefficient of a linear transform is divided by a weighted sum of coefficient amplitudes in a generalized neighborhood and shows that the divisive operation greatly reduces both the statistical and the perceptual redundancy amongst representation elements."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Image Processing"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2610134"
                        ],
                        "name": "J. Gluckman",
                        "slug": "J.-Gluckman",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Gluckman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Gluckman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17737027,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1e744e175656240a78f5ff5c84fbbb251a93bb3c",
            "isKey": false,
            "numCitedBy": 11,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "The scale invariant property of an ensemble of natural images is examined which motivates a new early visual representation termed the higher order pyramid. The representation is a non-linear generalization of the Laplacian pyramid and is tuned to the type of scale invariance exhibited by natural imagery as opposed to other scale invariant images such as 1/f correlated noise and the step edge. The transformation of an image to a higher order pyramid is simple to compute and straightforward to invert. Because the representation is invertible it is shown that the higher order pyramid can be truncated and quantized with little loss of visual quality. Images coded in this representation have much less redundancy than the raw image pixels and decorrelating transformations such as the Laplacian pyramid. This is demonstrated by showing statistical independence between pairs of coefficients. Because the representation is tuned to the ensemble redundancies the coefficients of the higher order pyramid are more efficient at capturing the variation within the ensemble which leads too improved matching results. This is demonstrated on two recognition tasks, face recognition with illumination changes and object recognition which viewpoint changes."
            },
            "slug": "Higher-Order-Image-Pyramids-Gluckman",
            "title": {
                "fragments": [],
                "text": "Higher Order Image Pyramids"
            },
            "tldr": {
                "abstractSimilarityScore": 93,
                "text": "The scale invariant property of an ensemble of natural images is examined which motivates a new early visual representation termed the higher order pyramid which is a non-linear generalization of the Laplacian pyramid and tuned to the type of scale invariance exhibited by natural imagery."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1708059"
                        ],
                        "name": "B. Wegmann",
                        "slug": "B.-Wegmann",
                        "structuredName": {
                            "firstName": "Bernhard",
                            "lastName": "Wegmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Wegmann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1683937"
                        ],
                        "name": "C. Zetzsche",
                        "slug": "C.-Zetzsche",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Zetzsche",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Zetzsche"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 136,
                                "start": 129
                            }
                        ],
                        "text": "More importantly, there are higher-order statical dependencies between coefficients at nearby locations, orientations and scales [28, 4] that cannot be modeled by Gaussian models."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 122421066,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9d0e2ec9567e570ab51483af4c6f30a4a5d7f835",
            "isKey": false,
            "numCitedBy": 68,
            "numCiting": 32,
            "paperAbstract": {
                "fragments": [],
                "text": "We present an image coding scheme based on the properties of the early stages of the human visual system. The image signal is decomposed via even and odd symmetric frequency and orientation selective bandpass filters in analogy to the quadrature phase simple cell pairs in the visual cortex. The resulting analytic signal is transformed into a local amplitude and local phase representation in order to achieve a better match to its signal statistics. Both intra filter dependencies of the analytic signal and inter filter dependencies between different orientation filters are exploited by a suitable vector quantization scheme. Inter orientation filter dependencies are demonstrated by means of a statistical evaluation of the multidimensional probability density function. The results can be seen as an empirical confirmation of the suitability of vector quantization in subband coding. Instead of generating a code book by use of an conventional designalgorithm we suggest a feature specific partitioning of the multidimensional signal space matched to the properties of human vision. Using this coding scheme satisfactory image quality can be obtained with about 0. 78 bit/pixel."
            },
            "slug": "Statistical-dependence-between-orientation-filter-a-Wegmann-Zetzsche",
            "title": {
                "fragments": [],
                "text": "Statistical dependence between orientation filter outputs used in a human-vision-based image code"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "An image coding scheme based on the properties of the early stages of the human visual system with satisfactory image quality is presented, which can be seen as an empirical confirmation of the suitability of vector quantization in subband coding."
            },
            "venue": {
                "fragments": [],
                "text": "Other Conferences"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145394553"
                        ],
                        "name": "Jean-Luc Starck",
                        "slug": "Jean-Luc-Starck",
                        "structuredName": {
                            "firstName": "Jean-Luc",
                            "lastName": "Starck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jean-Luc Starck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30162846"
                        ],
                        "name": "F. Murtagh",
                        "slug": "F.-Murtagh",
                        "structuredName": {
                            "firstName": "Fionn",
                            "lastName": "Murtagh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Murtagh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2006869"
                        ],
                        "name": "E. Candès",
                        "slug": "E.-Candès",
                        "structuredName": {
                            "firstName": "Emmanuel",
                            "lastName": "Candès",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Candès"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1709392"
                        ],
                        "name": "D. Donoho",
                        "slug": "D.-Donoho",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Donoho",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Donoho"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8868405,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "23c5f46f7e780edd31158a894496c34c9bd94eba",
            "isKey": false,
            "numCitedBy": 569,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "We present in this paper a new method for contrast enhancement based on the curvelet transform. The curvelet transform represents edges better than wavelets, and is therefore well-suited for multiscale edge enhancement. We compare this approach with enhancement based on the wavelet transform, and the Multiscale Retinex. In a range of examples, we use edge detection and segmentation, among other processing applications, to provide for quantitative comparative evaluation. Our findings are that curvelet based enhancement out-performs other enhancement methods on noisy images, but on noiseless or near noiseless images curvelet based enhancement is not remarkably better than wavelet based enhancement."
            },
            "slug": "Gray-and-color-image-contrast-enhancement-by-the-Starck-Murtagh",
            "title": {
                "fragments": [],
                "text": "Gray and color image contrast enhancement by the curvelet transform"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "A new method for contrast enhancement based on the curvelet transform is presented, which out-performs other enhancement methods on noisy images, but on noiseless or nearNoiseless images curvelet based enhancement is not remarkably better than wave let based enhancement."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1777421"
                        ],
                        "name": "Nicolas Bonnier",
                        "slug": "Nicolas-Bonnier",
                        "structuredName": {
                            "firstName": "Nicolas",
                            "lastName": "Bonnier",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nicolas Bonnier"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 218,
                                "start": 208
                            }
                        ],
                        "text": "However, the independent adjustment of the transform coefficients often introduces artifacts such as ripples and halos around high-contrast features, and these need to be eliminated in a post-processing step [6, 14, 3]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 124
                            }
                        ],
                        "text": "5(c) shows the result of using a more elaborate contrast enhancement method, using a gamma correction in the wavelet domain [6, 14, 3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 233001,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "c96e2457a89e75c19b8dcb4e7cad3f4ae2606406",
            "isKey": false,
            "numCitedBy": 24,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a method for automatically and adaptively boosting the visibility of local features in an image. A log intensity image is first decomposed into a set of subbands at multiple scales and orientations. Operating successively from coarse frequency bands to fine, the coefficients of each subband are adjusted so as to move their locally averaged amplitudes toward a target value using a gamma operation. Target values are chosen to fall linearly over scale, consistent with a scale-invariant spectral model. To avoid enlarging the range of image intensity values, in those locations where the local mean is near the minimal or maximal values of the image and the local contrast is being boosted significantly, the local mean is moved toward the global mean. Finally, a spatial mask is applied in the pixel domain to ensure that the enhancements are applied only in the vicinity of image features. The resulting image appears to be both sharper and of higher contrast."
            },
            "slug": "Locally-adaptive-multiscale-contrast-optimization-Bonnier-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Locally adaptive multiscale contrast optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 61,
                "text": "A method for automatically and adaptively boosting the visibility of local features in an image using a scale-invariant spectral model and a spatial mask is applied in the pixel domain to ensure that the enhancements are applied only in the vicinity of image features."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE International Conference on Image Processing 2005"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14163010,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4646e76fe9b59e5a3ba46e388c63a268740acf89",
            "isKey": false,
            "numCitedBy": 342,
            "numCiting": 51,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a parametric statistical model for visual images in the wavelet transform domain. We characterize the joint densities of coefficient magnitudes at adjacent spatial locations, adjacent orientations, and adjacent spatial scales. The model accounts for the statistics of a wide variety of visual images. As a demonstration of this, we used the model to design a progressive image encoder with state-of-the-art rate-distortion performance. We also show promising examples of image restoration and texture synthesis."
            },
            "slug": "Statistical-models-for-images:-compression,-and-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Statistical models for images: compression, restoration and synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A parametric statistical model for visual images in the wavelet transform domain is presented and the joint densities of coefficient magnitudes at adjacent spatial locations, adjacent orientations, and adjacent spatial scales are characterized."
            },
            "venue": {
                "fragments": [],
                "text": "Conference Record of the Thirty-First Asilomar Conference on Signals, Systems and Computers (Cat. No.97CB36136)"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49649079"
                        ],
                        "name": "D. Field",
                        "slug": "D.-Field",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Field",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Field"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 126
                            }
                        ],
                        "text": "When decomposed in a multi-scale oriented decomposition, the coefficients tend to have highly kurtotic marginal distributions [5, 7]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1600874,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aeb37769d72999bcbfb0582b73607fd8d23f4545",
            "isKey": false,
            "numCitedBy": 3278,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "The relative efficiency of any particular image-coding scheme should be defined only in relation to the class of images that the code is likely to encounter. To understand the representation of images by the mammalian visual system, it might therefore be useful to consider the statistics of images from the natural environment (i.e., images with trees, rocks, bushes, etc). In this study, various coding schemes are compared in relation to how they represent the information in such natural images. The coefficients of such codes are represented by arrays of mechanisms that respond to local regions of space, spatial frequency, and orientation (Gabor-like transforms). For many classes of image, such codes will not be an efficient means of representing information. However, the results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy (e.g., correlation between the intensities of neighboring pixels) into first-order redundancy (i.e., the response distribution of the coefficients). Such coding produces a relatively high signal-to-noise ratio and permits information to be transmitted with only a subset of the total number of cells. These results support Barlow's theory that the goal of natural vision is to represent the information in the natural environment with minimal redundancy."
            },
            "slug": "Relations-between-the-statistics-of-natural-images-Field",
            "title": {
                "fragments": [],
                "text": "Relations between the statistics of natural images and the response properties of cortical cells."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results obtained with six natural images suggest that the orientation and the spatial-frequency tuning of mammalian simple cells are well suited for coding the information in such images if the goal of the code is to convert higher-order redundancy into first- order redundancy."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics and image science"
            },
            "year": 1987
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1731199"
                        ],
                        "name": "M. Bethge",
                        "slug": "M.-Bethge",
                        "structuredName": {
                            "firstName": "Matthias",
                            "lastName": "Bethge",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Bethge"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 128,
                                "start": 121
                            }
                        ],
                        "text": "Nevertheless, linear transforms do not completely eliminate higher-order statistical dependencies in photographic images [20, 2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15320080,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6dfc2fa2b58ec7705f5f2646f8771f9a412e67cb",
            "isKey": false,
            "numCitedBy": 83,
            "numCiting": 87,
            "paperAbstract": {
                "fragments": [],
                "text": "The performance of unsupervised learning models for natural images is evaluated quantitatively by means of information theory. We estimate the gain in statistical independence (the multi-information reduction) achieved with independent component analysis (ICA), principal component analysis (PCA), zero-phase whitening, and predictive coding. Predictive coding is translated into the transform coding framework, where it can be characterized by the constraint of a triangular filter matrix. A randomly sampled whitening basis and the Haar wavelet are included in the comparison as well. The comparison of all these methods is carried out for different patch sizes, ranging from 2x2 to 16x16 pixels. In spite of large differences in the shape of the basis functions, we find only small differences in the multi-information between all decorrelation transforms (5% or less) for all patch sizes. Among the second-order methods, PCA is optimal for small patch sizes and predictive coding performs best for large patch sizes. The extra gain achieved with ICA is always less than 2%. In conclusion, the edge filters found with ICA lead to only a surprisingly small improvement in terms of its actual objective."
            },
            "slug": "Factorial-coding-of-natural-images:-how-effective-Bethge",
            "title": {
                "fragments": [],
                "text": "Factorial coding of natural images: how effective are linear models in removing higher-order dependencies?"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Among the second-order methods, PCA is optimal for small patch sizes and predictive coding performs best for large patch sizes, and the edge filters found with ICA lead to only a surprisingly small improvement in terms of its actual objective."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics, image science, and vision"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32052472"
                        ],
                        "name": "R. Buccigrossi",
                        "slug": "R.-Buccigrossi",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Buccigrossi",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Buccigrossi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 136,
                                "start": 129
                            }
                        ],
                        "text": "More importantly, there are higher-order statical dependencies between coefficients at nearby locations, orientations and scales [28, 4] that cannot be modeled by Gaussian models."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1887438,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "156ed6cd90506cd1111dffcd8e80e33ff62ca5ae",
            "isKey": false,
            "numCitedBy": 623,
            "numCiting": 68,
            "paperAbstract": {
                "fragments": [],
                "text": "We develop a probability model for natural images, based on empirical observation of their statistics in the wavelet transform domain. Pairs of wavelet coefficients, corresponding to basis functions at adjacent spatial locations, orientations, and scales, are found to be non-Gaussian in both their marginal and joint statistical properties. Specifically, their marginals are heavy-tailed, and although they are typically decorrelated, their magnitudes are highly correlated. We propose a Markov model that explains these dependencies using a linear predictor for magnitude coupled with both multiplicative and additive uncertainties, and show that it accounts for the statistics of a wide variety of images including photographic images, graphical images, and medical images. In order to directly demonstrate the power of the model, we construct an image coder called EPWIC (embedded predictive wavelet image coder), in which subband coefficients are encoded one bitplane at a time using a nonadaptive arithmetic encoder that utilizes conditional probabilities calculated from the model. Bitplanes are ordered using a greedy algorithm that considers the MSE reduction per encoded bit. The decoder uses the statistical model to predict coefficient values based on the bits it has received. Despite the simplicity of the model, the rate-distortion performance of the coder is roughly comparable to the best image coders in the literature."
            },
            "slug": "Image-compression-via-joint-statistical-in-the-Buccigrossi-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Image compression via joint statistical characterization in the wavelet domain"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A Markov model is proposed that explains dependencies using a linear predictor for magnitude coupled with both multiplicative and additive uncertainties, and it is shown that it accounts for the statistics of a wide variety of images including photographic images, graphical images, and medical images."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Image Process."
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47590737"
                        ],
                        "name": "O. Schwartz",
                        "slug": "O.-Schwartz",
                        "structuredName": {
                            "firstName": "Odelia",
                            "lastName": "Schwartz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Schwartz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 76,
                                "start": 72
                            }
                        ],
                        "text": "(7) coincides with the divisive normalization transform as described in [19], which has been shown to empirically reduce statistical dependencies of multi-scale decomposition coefficients of photographic images."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6346299,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "561b6f0ea628a70e5170b4fef920ebc3f6f63907",
            "isKey": false,
            "numCitedBy": 825,
            "numCiting": 79,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a form of nonlinear decomposition that is well-suited for efficient encoding of natural signals. Signals are initially decomposed using a bank of linear filters. Each filter response is then rectified and divided by a weighted sum of rectified responses of neighboring filters. We show that this decomposition, with parameters optimized for the statistics of a generic ensemble of natural images or sounds, provides a good characterization of the nonlinear response properties of typical neurons in primary visual cortex or auditory nerve, respectively. These results suggest that nonlinear response properties of sensory neurons are not an accident of biological implementation, but have an important functional role."
            },
            "slug": "Natural-signal-statistics-and-sensory-gain-control-Schwartz-Simoncelli",
            "title": {
                "fragments": [],
                "text": "Natural signal statistics and sensory gain control"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "It is shown that this decomposition, with parameters optimized for the statistics of a generic ensemble of natural images or sounds, provides a good characterization of the nonlinear response properties of typical neurons in primary visual cortex or auditory nerve, respectively."
            },
            "venue": {
                "fragments": [],
                "text": "Nature Neuroscience"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "41210105"
                        ],
                        "name": "Zhou Wang",
                        "slug": "Zhou-Wang",
                        "structuredName": {
                            "firstName": "Zhou",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhou Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747569"
                        ],
                        "name": "A. Bovik",
                        "slug": "A.-Bovik",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Bovik",
                            "middleNames": [
                                "Conrad"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bovik"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2387140"
                        ],
                        "name": "H. Sheikh",
                        "slug": "H.-Sheikh",
                        "structuredName": {
                            "firstName": "Hamid",
                            "lastName": "Sheikh",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Sheikh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 188,
                                "start": 184
                            }
                        ],
                        "text": "To quantify the perceptual difference between these images as a function of image PSNR, we used a recent perceptual image quality metric, the structural similarity image metric (SSIM) [26]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 96,
                                "start": 92
                            }
                        ],
                        "text": "The plot indicates that the images for which noise was added in DNT domain are predicted by SSIM to appear less distorted than all other images, and across all noise levels."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 17,
                                "start": 13
                            }
                        ],
                        "text": "Numerically, SSIM index ranges between 0 and 1, with larger values indicating better image perceptual quality."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 36,
                                "start": 32
                            }
                        ],
                        "text": "Shown in Fig.4 are the plots of SSIM for each image representation as a function of the output PSNR."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 101,
                                "start": 97
                            }
                        ],
                        "text": "For each representation and noise level, we generated 10 example images and computed the average SSIM over these."
                    },
                    "intents": []
                }
            ],
            "corpusId": 207761262,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "eae2e0fa72e898c289365c0af16daf57a7a6cf40",
            "isKey": true,
            "numCitedBy": 31180,
            "numCiting": 70,
            "paperAbstract": {
                "fragments": [],
                "text": "Objective methods for assessing perceptual image quality traditionally attempted to quantify the visibility of errors (differences) between a distorted image and a reference image using a variety of known properties of the human visual system. Under the assumption that human visual perception is highly adapted for extracting structural information from a scene, we introduce an alternative complementary framework for quality assessment based on the degradation of structural information. As a specific example of this concept, we develop a structural similarity index and demonstrate its promise through a set of intuitive examples, as well as comparison to both subjective ratings and state-of-the-art objective methods on a database of images compressed with JPEG and JPEG2000. A MATLAB implementation of the proposed algorithm is available online at http://www.cns.nyu.edu//spl sim/lcv/ssim/."
            },
            "slug": "Image-quality-assessment:-from-error-visibility-to-Wang-Bovik",
            "title": {
                "fragments": [],
                "text": "Image quality assessment: from error visibility to structural similarity"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A structural similarity index is developed and its promise is demonstrated through a set of intuitive examples, as well as comparison to both subjective ratings and state-of-the-art objective methods on a database of images compressed with JPEG and JPEG2000."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Image Processing"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "When decomposedin a multi-scale oriented decomposition, the coefficients tend to have highly kurtotic marginal distributions [ 5 , 7]. More importantly, there are higher-order statical dependencies between coefficients at nearby locations, orientations and scales [28, 4] that cannot be modeled by Gaussian models."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 122844278,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5cff185f86ee1506a243db0718f1b82a5ee2246d",
            "isKey": false,
            "numCitedBy": 434,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Fast-filter-transform-for-image-processing-Burt",
            "title": {
                "fragments": [],
                "text": "Fast filter transform for image processing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2761918"
                        ],
                        "name": "P. Teo",
                        "slug": "P.-Teo",
                        "structuredName": {
                            "firstName": "Patrick",
                            "lastName": "Teo",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Teo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2360881"
                        ],
                        "name": "D. Heeger",
                        "slug": "D.-Heeger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heeger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heeger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1370281,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "63c13deef4ecb94d69b6763f43311720e40a2f61",
            "isKey": false,
            "numCitedBy": 411,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we present a perceptual distortion measure that predicts image integrity far better than mean-squared error. This perceptual distortion measure is based an a model of human visual processing that fits empirical measurements of the psychophysics of spatial pattern detection. The model of human visual processing proposed involves two major components: a steerable pyramid transform and contrast normalization. We also illustrate the usefulness of the model in predicting perceptual distortion in real images.<<ETX>>"
            },
            "slug": "Perceptual-image-distortion-Teo-Heeger",
            "title": {
                "fragments": [],
                "text": "Perceptual image distortion"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "A perceptual distortion measure that predicts image integrity far better than mean-squared error and the usefulness of the model in predicting perceptual distortion in real images is illustrated."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of 1st International Conference on Image Processing"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145920814"
                        ],
                        "name": "S. Roth",
                        "slug": "S.-Roth",
                        "structuredName": {
                            "firstName": "Stefan",
                            "lastName": "Roth",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Roth"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2105795"
                        ],
                        "name": "Michael J. Black",
                        "slug": "Michael-J.-Black",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Black",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael J. Black"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 102
                            }
                        ],
                        "text": "Previously, Student’s t has been proposed as an image model mainly for its convenience in computation [23, 18, 29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2843211,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2077d0f30507d51a0d3bbec4957d55e817d66a59",
            "isKey": false,
            "numCitedBy": 1055,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "We develop a framework for learning generic, expressive image priors that capture the statistics of natural scenes and can be used for a variety of machine vision tasks. The approach extends traditional Markov random field (MRF) models by learning potential functions over extended pixel neighborhoods. Field potentials are modeled using a Products-of-Experts framework that exploits nonlinear functions of many linear filter responses. In contrast to previous MRF approaches all parameters, including the linear filters themselves, are learned from training data. We demonstrate the capabilities of this Field of Experts model with two example applications, image denoising and image inpainting, which are implemented using a simple, approximate inference scheme. While the model is trained on a generic image database and is not tuned toward a specific application, we obtain results that compete with and even outperform specialized techniques."
            },
            "slug": "Fields-of-Experts:-a-framework-for-learning-image-Roth-Black",
            "title": {
                "fragments": [],
                "text": "Fields of Experts: a framework for learning image priors"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "A framework for learning generic, expressive image priors that capture the statistics of natural scenes and can be used for a variety of machine vision tasks, developed using a Products-of-Experts framework."
            },
            "venue": {
                "fragments": [],
                "text": "2005 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR'05)"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30400079"
                        ],
                        "name": "Yair Weiss",
                        "slug": "Yair-Weiss",
                        "structuredName": {
                            "firstName": "Yair",
                            "lastName": "Weiss",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yair Weiss"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 102
                            }
                        ],
                        "text": "Previously, Student’s t has been proposed as an image model mainly for its convenience in computation [23, 18, 29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6817786,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bee150f94d61d09e08d858605af36d1b96d2bc52",
            "isKey": false,
            "numCitedBy": 340,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Many low-level vision algorithms assume a prior probability over images, and there has been great interest in trying to learn this prior from examples. Since images are very non Gaussian, high dimensional, continuous signals, learning their distribution presents a tremendous computational challenge. Perhaps the most successful recent algorithm is the Fields of Experts (FOE) [20] model which has shown impressive performance by modeling image statistics with a product of potentials defined on filter outputs. However, as in previous models of images based on filter outputs [30], calculating the probability of an image given the model requires evaluating an intractable partition function. This makes learning very slow (requires Monte-Carlo sampling at every step) and makes it virtually impossible to compare the likelihood of two different models. Given this computational difficulty, it is hard to say whether nonintu-itive features learned by such models represent a true property of natural images or an artifact of the approximations used during learning. In this paper we present (1) tractable lower and upper bounds on the partition function of models based on filter outputs and (2) efficient learning algorithms that do not require any sampling. Our results are based on recent results in machine learning that deal with Gaussian potentials. We extend these results to non-Gaussian potentials and derive a novel, basis rotation algorithm for approximating the maximum likelihood filters. Our results allow us to (1) rigorously compare the likelihood of different models and (2) calculate high likelihood models of natural image statistics in a matter of minutes. Applying our results to previous models shows that the nonintuitive features are not an artifact of the learning process but rather are capturing robust properties of natural images."
            },
            "slug": "What-makes-a-good-model-of-natural-images-Weiss-Freeman",
            "title": {
                "fragments": [],
                "text": "What makes a good model of natural images?"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A tractable lower and upper bounds on the partition function of models based on filter outputs and efficient learning algorithms that do not require any sampling are presented and applied to previous models shows that the nonintuitive features learned are not an artifact of the learning process but rather are capturing robust properties of natural images."
            },
            "venue": {
                "fragments": [],
                "text": "2007 IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1828659"
                        ],
                        "name": "A. Watson",
                        "slug": "A.-Watson",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Watson",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Watson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2221312"
                        ],
                        "name": "J. Solomon",
                        "slug": "J.-Solomon",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Solomon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Solomon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6142390,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d364b0790e05ee106941218d84881870759fc152",
            "isKey": false,
            "numCitedBy": 502,
            "numCiting": 72,
            "paperAbstract": {
                "fragments": [],
                "text": "We have implemented a model of contrast gain and control in human vision that incorporates a number of key features, including a contrast sensitivity function, multiple oriented bandpass channels, accelerating nonlinearities, and a devisive inhibitory gain control pool. The parameters of this model have been optimized through a fit to the recent data that describe masking of a Gabor function by cosine and Gabor masks [J. M. Foley, \"Human luminance pattern mechanisms: masking experiments require a new model,\" J. Opt. Soc. Am. A 11, 1710 (1994)]. The model achieves a good fit to the data. We also demonstrate how the concept of recruitment may accommodate a variant of this model in which excitatory and inhibitory paths have a common accelerating nonlinearity, but which include multiple channels tuned to different levels of contrast."
            },
            "slug": "Model-of-visual-contrast-gain-control-and-pattern-Watson-Solomon",
            "title": {
                "fragments": [],
                "text": "Model of visual contrast gain control and pattern masking."
            },
            "tldr": {
                "abstractSimilarityScore": 92,
                "text": "A model of contrast gain and control in human vision that incorporates a number of key features, including a contrast sensitivity function, multiple oriented bandpass channels, accelerating nonlinearities, and a devisive inhibitory gain control pool is implemented."
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America. A, Optics, image science, and vision"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1725303"
                        ],
                        "name": "Y. Teh",
                        "slug": "Y.-Teh",
                        "structuredName": {
                            "firstName": "Yee",
                            "lastName": "Teh",
                            "middleNames": [
                                "Whye"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Teh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678311"
                        ],
                        "name": "M. Welling",
                        "slug": "M.-Welling",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Welling",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Welling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2217144"
                        ],
                        "name": "Simon Osindero",
                        "slug": "Simon-Osindero",
                        "structuredName": {
                            "firstName": "Simon",
                            "lastName": "Osindero",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Simon Osindero"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695689"
                        ],
                        "name": "Geoffrey E. Hinton",
                        "slug": "Geoffrey-E.-Hinton",
                        "structuredName": {
                            "firstName": "Geoffrey",
                            "lastName": "Hinton",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Geoffrey E. Hinton"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 185,
                                "start": 181
                            }
                        ],
                        "text": "The parameters in the divisive normalization transform, {b, ck, ak} can be obtained by maximizing the likelihood of blocks of multi-scale decomposition coefficients under the model [23]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 114,
                                "start": 102
                            }
                        ],
                        "text": "Previously, Student’s t has been proposed as an image model mainly for its convenience in computation [23, 18, 29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 52865368,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b95799a25def71b100bd12e7ebb32cbcee6590bf",
            "isKey": false,
            "numCitedBy": 176,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new way of extending independent components analysis (ICA) to overcomplete representations. In contrast to the causal generative extensions of ICA which maintain marginal independence of sources, we define features as deterministic (linear) functions of the inputs. This assumption results in marginal dependencies among the features, but conditional independence of the features given the inputs. By assigning energies to the features a probability distribution over the input states is defined through the Boltzmann distribution. Free parameters of this model are trained using the contrastive divergence objective (Hinton, 2002). When the number of features is equal to the number of input dimensions this energy-based model reduces to noiseless ICA and we show experimentally that the proposed learning algorithm is able to perform blind source separation on speech data. In additional experiments we train overcomplete energy-based models to extract features from various standard data-sets containing speech, natural images, hand-written digits and faces."
            },
            "slug": "Energy-Based-Models-for-Sparse-Overcomplete-Teh-Welling",
            "title": {
                "fragments": [],
                "text": "Energy-Based Models for Sparse Overcomplete Representations"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "A new way of extending independent components analysis (ICA) to overcomplete representations that defines features as deterministic (linear) functions of the inputs and assigns energies to the features through the Boltzmann distribution."
            },
            "venue": {
                "fragments": [],
                "text": "J. Mach. Learn. Res."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2360881"
                        ],
                        "name": "D. Heeger",
                        "slug": "D.-Heeger",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heeger",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heeger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 22804285,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "bda27a4b31cc019f679028301152443cce30a5db",
            "isKey": false,
            "numCitedBy": 1796,
            "numCiting": 81,
            "paperAbstract": {
                "fragments": [],
                "text": "Simple cells in the striate cortex have been depicted as half-wave-rectified linear operators. Complex cells have been depicted as energy mechanisms, constructed from the squared sum of the outputs of quadrature pairs of linear operators. However, the linear/energy model falls short of a complete explanation of striate cell responses. In this paper, a modified version of the linear/energy model is presented in which striate cells mutually inhibit one another, effectively normalizing their responses with respect to stimulus contrast. This paper reviews experimental measurements of striate cell responses, and shows that the new model explains a significantly larger body of physiological data."
            },
            "slug": "Normalization-of-cell-responses-in-cat-striate-Heeger",
            "title": {
                "fragments": [],
                "text": "Normalization of cell responses in cat striate cortex."
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A modified version of the linear/energy model is presented in which striate cells mutually inhibit one another, effectively normalizing their responses with respect to stimulus contrast, and shows that the new model explains a significantly larger body of physiological data."
            },
            "venue": {
                "fragments": [],
                "text": "Visual neuroscience"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3230440"
                        ],
                        "name": "Raanan Fattal",
                        "slug": "Raanan-Fattal",
                        "structuredName": {
                            "firstName": "Raanan",
                            "lastName": "Fattal",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Raanan Fattal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1684384"
                        ],
                        "name": "Dani Lischinski",
                        "slug": "Dani-Lischinski",
                        "structuredName": {
                            "firstName": "Dani",
                            "lastName": "Lischinski",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dani Lischinski"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "27379268"
                        ],
                        "name": "M. Werman",
                        "slug": "M.-Werman",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Werman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Werman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 218,
                                "start": 208
                            }
                        ],
                        "text": "However, the independent adjustment of the transform coefficients often introduces artifacts such as ripples and halos around high-contrast features, and these need to be eliminated in a post-processing step [6, 14, 3]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 124
                            }
                        ],
                        "text": "5(c) shows the result of using a more elaborate contrast enhancement method, using a gamma correction in the wavelet domain [6, 14, 3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1650337,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e6c5d60cbe081daf8b9aea39078d4691cf8b4141",
            "isKey": false,
            "numCitedBy": 1350,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new method for rendering high dynamic range images on conventional displays. Our method is conceptually simple, computationally efficient, robust, and easy to use. We manipulate the gradient field of the luminance image by attenuating the magnitudes of large gradients. A new, low dynamic range image is then obtained by solving a Poisson equation on the modified gradient field. Our results demonstrate that the method is capable of drastic dynamic range compression, while preserving fine details and avoiding common artifacts, such as halos, gradient reversals, or loss of local contrast. The method is also able to significantly enhance ordinary images by bringing out detail in dark regions."
            },
            "slug": "Gradient-domain-high-dynamic-range-compression-Fattal-Lischinski",
            "title": {
                "fragments": [],
                "text": "Gradient domain high dynamic range compression"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The results demonstrate that the method is capable of drastic dynamic range compression, while preserving fine details and avoiding common artifacts, such as halos, gradient reversals, or loss of local contrast."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2549090"
                        ],
                        "name": "Yuanzhen Li",
                        "slug": "Yuanzhen-Li",
                        "structuredName": {
                            "firstName": "Yuanzhen",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuanzhen Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2240195"
                        ],
                        "name": "Lavanya Sharan",
                        "slug": "Lavanya-Sharan",
                        "structuredName": {
                            "firstName": "Lavanya",
                            "lastName": "Sharan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lavanya Sharan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145358192"
                        ],
                        "name": "E. Adelson",
                        "slug": "E.-Adelson",
                        "structuredName": {
                            "firstName": "Edward",
                            "lastName": "Adelson",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Adelson"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 218,
                                "start": 208
                            }
                        ],
                        "text": "However, the independent adjustment of the transform coefficients often introduces artifacts such as ripples and halos around high-contrast features, and these need to be eliminated in a post-processing step [6, 14, 3]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 124
                            }
                        ],
                        "text": "5(c) shows the result of using a more elaborate contrast enhancement method, using a gamma correction in the wavelet domain [6, 14, 3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3388099,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "3e4a1792ea903aaee72d6466d2d663e3b1a2edee",
            "isKey": false,
            "numCitedBy": 170,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "High dynamic range (HDR) imaging is an area of increasing importance, but most display devices still have limited dynamic range (LDR). Various techniques have been proposed for compressing the dynamic range while retaining important visual information. Multi-scale image processing techniques, which are widely used for many image processing tasks, have a reputation of causing halo artifacts when used for range compression. However, we demonstrate that they can work when properly implemented. We use a symmetrical analysis-synthesis filter bank, and apply local gain control to the subbands. We also show that the technique can be adapted for the related problem of \"companding\", in which an HDR image is converted to an LDR image, and later expanded back to high dynamic range."
            },
            "slug": "Compressing-and-companding-high-dynamic-range-with-Li-Sharan",
            "title": {
                "fragments": [],
                "text": "Compressing and companding high dynamic range images with subband architectures"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This work uses a symmetrical analysis-synthesis filter bank, and applies local gain control to the subbands to demonstrate that multi-scale image processing techniques, which are widely used for many image processing tasks, can work when properly implemented."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '05"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2966196"
                        ],
                        "name": "W. Geisler",
                        "slug": "W.-Geisler",
                        "structuredName": {
                            "firstName": "Wilson",
                            "lastName": "Geisler",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Geisler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2129244"
                        ],
                        "name": "D. G. Albrecht",
                        "slug": "D.-G.-Albrecht",
                        "structuredName": {
                            "firstName": "Duane",
                            "lastName": "Albrecht",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. G. Albrecht"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18857682,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "83e50d7a7b395d471173e4b2b13a3bbdb2373256",
            "isKey": false,
            "numCitedBy": 230,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Cortical-neurons:-Isolation-of-contrast-gain-Geisler-Albrecht",
            "title": {
                "fragments": [],
                "text": "Cortical neurons: Isolation of contrast gain control"
            },
            "venue": {
                "fragments": [],
                "text": "Vision Research"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1689350"
                        ],
                        "name": "Eero P. Simoncelli",
                        "slug": "Eero-P.-Simoncelli",
                        "structuredName": {
                            "firstName": "Eero",
                            "lastName": "Simoncelli",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eero P. Simoncelli"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768236"
                        ],
                        "name": "W. Freeman",
                        "slug": "W.-Freeman",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Freeman",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Freeman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 40
                            }
                        ],
                        "text": "1In this work, we use steerable pyramid [21], which a particular type of overcomplete wavelet transform."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1099364,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "89b6a5a136bc0a938b792df6bdde134def28335e",
            "isKey": false,
            "numCitedBy": 1157,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe an architecture for efficient and accurate linear decomposition of an image into scale and orientation subbands. The basis functions of this decomposition are directional derivative operators of any desired order. We describe the construction and implementation of the transform."
            },
            "slug": "The-steerable-pyramid:-a-flexible-architecture-for-Simoncelli-Freeman",
            "title": {
                "fragments": [],
                "text": "The steerable pyramid: a flexible architecture for multi-scale derivative computation"
            },
            "tldr": {
                "abstractSimilarityScore": 76,
                "text": "An architecture for efficient and accurate linear decomposition of an image into scale and orientation subbands and the construction and implementation of the transform is described."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings., International Conference on Image Processing"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144790332"
                        ],
                        "name": "R. Gray",
                        "slug": "R.-Gray",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gray",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gray"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 165
                            }
                        ],
                        "text": "In computing the gradients, we take advantage of the fact that the matrix-vector product between a block-Toeplitz matrix and a vector is equivalent to a convolution [11], which may be efficiently implemented with fast Fourier transform."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 133
                            }
                        ],
                        "text": "Note that these matrices, though may be huge in size due to their dimensionality of D ×D, have sparse block-Toeplitz (convolutional) [11] structures determined by the neighborhood configuration and the spatial homogeneity assumptions."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 51861878,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "79d1b330f0ef51f63ecb9b291dd5a05de5a858c0",
            "isKey": false,
            "numCitedBy": 2113,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "The fundamental theorems on the asymptotic behavior of eigenvalues, inverses, and products of banded Toeplitz matrices and Toeplitz matrices with absolutely summable elements are derived in a tutorial manner. Mathematical elegance and generality are sacrificed for conceptual simplicity and insight in the hope of making these results available to engineers lacking either the background or endurance to attack the mathematical literature on the subject. By limiting the generality of the matrices considered, the essential ideas and results can be conveyed in a more intuitive manner without the mathematical machinery required for the most general cases. As an application the results are applied to the study of the covariance matrices and their factors of linear models of discrete time random processes."
            },
            "slug": "Toeplitz-and-Circulant-Matrices:-A-Review-Gray",
            "title": {
                "fragments": [],
                "text": "Toeplitz and Circulant Matrices: A Review"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "The fundamental theorems on the asymptotic behavior of eigenvalues, inverses, and products of banded Toeplitz matrices and Toepler matrices with absolutely summable elements are derived in a tutorial manner in the hope of making these results available to engineers lacking either the background or endurance to attack the mathematical literature on the subject."
            },
            "venue": {
                "fragments": [],
                "text": "Found. Trends Commun. Inf. Theory"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2656437"
                        ],
                        "name": "M. West",
                        "slug": "M.-West",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "West",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. West"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 95,
                                "start": 92
                            }
                        ],
                        "text": "Student’s t is a special case of the more general density family of Gaussian scale mixtures [1]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 44372930,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a88c4014da492520eceff8b359d981d6ef4b8e5e",
            "isKey": false,
            "numCitedBy": 746,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "SUMMARY The exponential power family of distributions of Box & Tiao (1973) is shown to be a subset of the class of scale mixtures of normals. The corresponding mixing distributions are explicitly obtained, identifying a close relationship between the exponential power family and a further class of normal scale mixtures, namely the stable distributions."
            },
            "slug": "On-scale-mixtures-of-normal-distributions-West",
            "title": {
                "fragments": [],
                "text": "On scale mixtures of normal distributions"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1987
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 13
                            }
                        ],
                        "text": "According to Eq."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 170,
                                "start": 167
                            }
                        ],
                        "text": "With a two-band steerable pyramid decomposition of the image, the coefficient magnitudes were transformed with a gamma correction-like non-linear function (similar to Eq."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 103
                            }
                        ],
                        "text": "Most of the computational cost in inverting the DN transform is spent on the two matrix inversions, of Eq."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 11,
                                "start": 8
                            }
                        ],
                        "text": "So from Eq."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 35,
                                "start": 32
                            }
                        ],
                        "text": "Inverting the matrix then gives Eq."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 16
                            }
                        ],
                        "text": "According to Eq.(4), such an operation results in the independent Gaussian variableu."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 27
                            }
                        ],
                        "text": "The transform described in Eq."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 82
                            }
                        ],
                        "text": "The inversion of the DN transformation is thus composed of reversing the steps in Eq."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 41,
                                "start": 38
                            }
                        ],
                        "text": "The divisive normalization transform, Eq."
                    },
                    "intents": []
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Image compressio n via joint statistical characterization in the wavelet doma in"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2302358"
                        ],
                        "name": "P. Burt",
                        "slug": "P.-Burt",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Burt",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Burt"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 126
                            }
                        ],
                        "text": "When decomposed in a multi-scale oriented decomposition, the coefficients tend to have highly kurtotic marginal distributions [5, 7]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 208089664,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "204a548b7ead77260f29fba0db81e834956ce64d",
            "isKey": false,
            "numCitedBy": 467,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Fast-Filter-Transforms-for-Image-Processing-Burt",
            "title": {
                "fragments": [],
                "text": "Fast Filter Transforms for Image Processing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1981
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2256718"
                        ],
                        "name": "W. Press",
                        "slug": "W.-Press",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Press",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Press"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48590121"
                        ],
                        "name": "S. Teukolsky",
                        "slug": "S.-Teukolsky",
                        "structuredName": {
                            "firstName": "Saul",
                            "lastName": "Teukolsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Teukolsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [],
            "corpusId": 124525506,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "493cd5e15d6b8726ce27ed0595f1993c27525670",
            "isKey": false,
            "numCitedBy": 17387,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Numerical-recipes-Press-Teukolsky",
            "title": {
                "fragments": [],
                "text": "Numerical recipes"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "68985683"
                        ],
                        "name": "L. Landweber",
                        "slug": "L.-Landweber",
                        "structuredName": {
                            "firstName": "Louis",
                            "lastName": "Landweber",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Landweber"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119860325,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "2a0207d2b576d7a43879e1c23fadadcc5fab6145",
            "isKey": false,
            "numCitedBy": 953,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-iteration-formula-for-Fredholm-integral-of-the-Landweber",
            "title": {
                "fragments": [],
                "text": "An iteration formula for Fredholm integral equations of the first kind"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1951
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144790332"
                        ],
                        "name": "R. Gray",
                        "slug": "R.-Gray",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Gray",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Gray"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62062125,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "09b028e77aa5f3d3175c4059e4ba57326c317e48",
            "isKey": false,
            "numCitedBy": 399,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Toeplitz-And-Circulant-Matrices:-A-Review-and-in-Gray",
            "title": {
                "fragments": [],
                "text": "Toeplitz And Circulant Matrices: A Review (Foundations and Trends(R) in Communications and Information Theory)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2006
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "N onlinear image representation for efficient perceptual codin g"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. on Image"
            },
            "year": 2006
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A model of visual contrast gain control and patern masking.J"
            },
            "venue": {
                "fragments": [],
                "text": "Opt. Soc. Amer. A  ,"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Normalization of cell responses in cat str  iate cortex.Visual neural science"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Directly i  nvertible nonlinear divisive normalization pyramid for ima ge representation"
            },
            "venue": {
                "fragments": [],
                "text": "InLecture Notes in Computer Science,"
            },
            "year": 2003
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 37
                            }
                        ],
                        "text": "Several recent image representations [25, 16, 15, 10] include spatially varying divisive normalization (DN ) as simple nonlinear map, where each component in a cluster of coefficients is divided by the square root of a linear combination of the squared amplitudes of its neighbors."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Higher order pyramids: an early vision representation"
            },
            "venue": {
                "fragments": [],
                "text": "In European Conference on Computer Vision (ECCV),"
            },
            "year": 2006
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Human luminence pattern mechanisims: Masking experimants require a new model"
            },
            "venue": {
                "fragments": [],
                "text": "J. of Opt. Soc. of Amer. A,"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 37
                            }
                        ],
                        "text": "Several recent image representations [25, 16, 15, 10] include spatially varying divisive normalization (DN ) as simple nonlinear map, where each component in a cluster of coefficients is divided by the square root of a linear combination of the squared amplitudes of its neighbors."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Non-linear invertible representation for joint statistical and perceptual fea ture representation"
            },
            "venue": {
                "fragments": [],
                "text": "Lect. Not. Comp. Sci.,"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Locally adaptive multis cale contrast optimization"
            },
            "venue": {
                "fragments": [],
                "text": "InProc 12th IEEE Int’l Conf on Image Proc,"
            },
            "year": 2005
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Numerical Recipes. Cambridge"
            },
            "venue": {
                "fragments": [],
                "text": "Numerical Recipes. Cambridge"
            },
            "year": 2002
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 38
                            }
                        ],
                        "text": "All steps are straightforward, except (13), which requires some explanation."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An iterative formula for Freholm integra  l equations of the first kind"
            },
            "venue": {
                "fragments": [],
                "text": "Amer. J. Math,"
            },
            "year": 1951
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Scale mixtures of normal distributions.Journal of the Royal Statistical Society"
            },
            "venue": {
                "fragments": [],
                "text": "Series B,"
            },
            "year": 1974
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Perceptual image quality assessment: From error visibilit y to structural similarity.tip"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2004
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 102,
                                "start": 98
                            }
                        ],
                        "text": "Analogous to the Landweber algorithm for solving the Fredholm integral equation of the first type [13], our problem is equivalent to solving these two linear equations:"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "An iterative formula for Freholm integral equations of the first kind"
            },
            "venue": {
                "fragments": [],
                "text": "Amer. J. Math,"
            },
            "year": 1951
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Locally adaptive multiscale contrast optimization . In Proc 12 th IEEE Int ’ l Conf on Image Proc , volume I , pages 949 – 952 , Genoa , Italy , September 11 - 14 2005"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Non-linear invertible representation for joint statistic  al and perceptual fea ture representation"
            },
            "venue": {
                "fragments": [],
                "text": "Lect. Not. Comp"
            },
            "year": 2000
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 21,
            "methodology": 9
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 45,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Nonlinear-image-representation-using-divisive-Lyu-Simoncelli/25d92fe0ab92ae57bd8fed87c95fa9a207ec61aa?sort=total-citations"
}