{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710772"
                        ],
                        "name": "Kristin J. Dana",
                        "slug": "Kristin-J.-Dana",
                        "structuredName": {
                            "firstName": "Kristin",
                            "lastName": "Dana",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kristin J. Dana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750470"
                        ],
                        "name": "S. Nayar",
                        "slug": "S.-Nayar",
                        "structuredName": {
                            "firstName": "Shree",
                            "lastName": "Nayar",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Nayar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8038506"
                        ],
                        "name": "B. Ginneken",
                        "slug": "B.-Ginneken",
                        "structuredName": {
                            "firstName": "Bram",
                            "lastName": "Ginneken",
                            "middleNames": [
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Ginneken"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 32509646,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "a0cc93ea8d1a0f656f2afae007144d7f70e6036d",
            "isKey": false,
            "numCitedBy": 579,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "In this work, we investigate the visual appearance of real-world surfaces and the dependence of appearance on imaging conditions. We present a BRDF (bidirectional reflectance distribution function) database with reflectance measurements for over 60 different samples, each observed with over 200 different combinations of viewing and source directions. We fit the BRDF measurements to two recent models to obtain a BRDF parameter database. These BRDF parameters can be directly used for both image analysis and image synthesis. Finally, we present a BTF (bidirectional texture function) database with image textures from over 60 different samples, each observed with over 200 different combinations of viewing and source directions. Each of these unique databases has important implications for a variety of vision algorithms and each is made publicly available."
            },
            "slug": "Reflectance-and-Texture-of-Real-World-Surfaces-Dana-Nayar",
            "title": {
                "fragments": [],
                "text": "Reflectance and Texture of Real-World Surfaces Authors"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The visual appearance of real-world surfaces and the dependence of appearance on imaging conditions is investigated and a BRDF (bidirectional reflectance distribution function) database with reflectance measurements for over 60 different samples, each observed with over 200 different combinations of viewing and source directions is presented."
            },
            "venue": {
                "fragments": [],
                "text": "CVPR"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809770"
                        ],
                        "name": "Pei-hsiu Suen",
                        "slug": "Pei-hsiu-Suen",
                        "structuredName": {
                            "firstName": "Pei-hsiu",
                            "lastName": "Suen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pei-hsiu Suen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144644545"
                        ],
                        "name": "G. Healey",
                        "slug": "G.-Healey",
                        "structuredName": {
                            "firstName": "Glenn",
                            "lastName": "Healey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Healey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This interest is evident in the numerous works using the database: BRDF model-tting in [8],[9],[24]; histogram simulations in [17]; a histogram model and histogram model-tting in [10]; SVD (singular value decomposition) analysis in [ 46 ]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 31325137,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "c522a45a02571ea30a52f5d936df78f47d319366",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "The observed image texture for a rough surface has a complex dependence on the illumination and viewing angles due to effects such as local shading, interreflections, and the shadowing and occlusion of surface elements. We introduce the dimensionality surface as a representation for the visual complexity of a material sample. The dimensionality surface defines the number of basis features that are required to represent the space of observed textures for a surface as a function of ranges of illumination and viewing angles. Basis textures are represented using multiband correlation functions. We study properties of the dimensionality surface for real materials using the Columbia Utrecht Reflectance and Texture (CUReT) database. The analysis shows that the dependence of the dimensionality surface on ranges of illumination and viewing angles is approximately linear with a slope dependent on the complexity of the sample."
            },
            "slug": "Analyzing-the-bidirectional-texture-function-Suen-Healey",
            "title": {
                "fragments": [],
                "text": "Analyzing the bidirectional texture function"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "The analysis shows that the dependence of the dimensionality surface on ranges of illumination and viewing angles is approximately linear with a slope dependent on the complexity of the sample."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1998 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (Cat. No.98CB36231)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2156356502"
                        ],
                        "name": "SK Nayar",
                        "slug": "SK-Nayar",
                        "structuredName": {
                            "firstName": "SK",
                            "lastName": "Nayar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "SK Nayar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145328018"
                        ],
                        "name": "M. Oren",
                        "slug": "M.-Oren",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Oren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Oren"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5611174,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "4adc3e505f4877ac8fea80dc96eca20d981e3179",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "All visual sensors, biological and artificial, are finite in resolution by necessity. As a result, the effective reflectance of surfaces in a scene varies with magnification. A reflectance model for matte surfaces is described that incorporates the effect of macroscopic surface undulations on image brightness. The model takes into account complex physical phenomena such as masking, shadowing, and interreflections between points on the surface, and it predicts the appearance of a wide range of natural surfaces. The implications of these results for human vision, machine vision, and computer graphics are demonstrated with both real and rendered images of three-dimensional objects. In particular, objects with extremely rough surfaces produce silhouette images devoid of shading, precluding visual perception of the object's shape."
            },
            "slug": "Visual-appearance-of-matte-surfaces-Nayar-Oren",
            "title": {
                "fragments": [],
                "text": "Visual appearance of matte surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A reflectance model for matte surfaces is described that incorporates the effect of macroscopic surface undulations on image brightness and takes into account complex physical phenomena such as masking, shadowing, and interreflections between points on the surface."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710772"
                        ],
                        "name": "Kristin J. Dana",
                        "slug": "Kristin-J.-Dana",
                        "structuredName": {
                            "firstName": "Kristin",
                            "lastName": "Dana",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kristin J. Dana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750470"
                        ],
                        "name": "S. Nayar",
                        "slug": "S.-Nayar",
                        "structuredName": {
                            "firstName": "Shree",
                            "lastName": "Nayar",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Nayar"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1744493,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bd2ef7dbd1dbe42e2dfeefa6b03f3b689a8f3f08",
            "isKey": false,
            "numCitedBy": 77,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Image texture can arise not only from surface albedo variations (2D texture) but also from surface height variations (3D texture). Since the appearance of 3D texture depends on the illumination and viewing direction in a complicated manner, such image texture can be called a bidirectional texture function. A fundamental representation of image texture is the histogram of pixel intensities. Since the histogram of 3D texture also depends on the illumination and viewing directions in a complex fashion, we refer to it as a bidirectional histogram. In this work, we present a concise analytical model for the bidirectional histogram of Lambertian, isotropic, randomly rough surfaces, which are common in real-world scenes. We demonstrate the accuracy of the histogram model by fitting to several samples from the Columbia-Utrecht texture database. The parameters obtained from the model fits are roughness measures which can be used in texture recognition schemes. In addition, the model has potential application in estimating illumination direction in scenes where surfaces of known tilt and roughness are visible. We demonstrate the usefulness of our model by employing it in a novel 3D texture synthesis procedure."
            },
            "slug": "Histogram-model-for-3D-textures-Dana-Nayar",
            "title": {
                "fragments": [],
                "text": "Histogram model for 3D textures"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This work presents a concise analytical model for the bidirectional histogram of Lambertian, isotropic, randomly rough surfaces, which are common in real-world scenes and demonstrates the usefulness of the model by employing it in a novel 3D texture synthesis procedure."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings. 1998 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (Cat. No.98CB36231)"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2143362639"
                        ],
                        "name": "Lizhi Wang",
                        "slug": "Lizhi-Wang",
                        "structuredName": {
                            "firstName": "Lizhi",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lizhi Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144644545"
                        ],
                        "name": "G. Healey",
                        "slug": "G.-Healey",
                        "structuredName": {
                            "firstName": "Glenn",
                            "lastName": "Healey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Healey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19520469,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "75a64111a7b5a62f0b2ff68bbd2187b051ef8c5f",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "We develop a method for recognizing color texture independent of rotation, scale, and illumination. Color texture is modeled using spatial correlation functions defined within and between sensor bands. Using a linear model for surface spectral reflectance with the same number of parameters as the number of sensor classes, we show that illumination and geometry changes in the scene correspond to a linear transformation of the correlation functions and a linear transformation of their coordinates. A several step algorithm which includes scale estimation and correlation moment computation is used to achieve the invariance. The key to the method is the new result that illumination and geometry changes in the scene correspond to a specific transformation of correlation function Zernike moment matrices. These matrices can be estimated from a color image. This relationship is used to derive an efficient algorithm for recognition. The algorithm is substantiated using classification results on over 200 images of color textures obtained under various illumination conditions and geometric configurations."
            },
            "slug": "Illumination-and-geometry-invariant-recognition-of-Wang-Healey",
            "title": {
                "fragments": [],
                "text": "Illumination and geometry invariant recognition of texture in color images"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A several step algorithm which includes scale estimation and correlation moment computation is used to achieve the invariance that illumination and geometry changes in the scene correspond to a specific transformation of correlation function Zernike moment matrices."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2121368"
                        ],
                        "name": "M. Stavridi",
                        "slug": "M.-Stavridi",
                        "structuredName": {
                            "firstName": "Marigo",
                            "lastName": "Stavridi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Stavridi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064076416"
                        ],
                        "name": "B. van Ginneken",
                        "slug": "B.-van-Ginneken",
                        "structuredName": {
                            "firstName": "Bram",
                            "lastName": "van Ginneken",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. van Ginneken"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 113,
                                "start": 93
                            }
                        ],
                        "text": "The type of light sources varies from \nsystem to system and is often either a halogen source [Stavridi et al. 1997; Ward 1992] or a laser source \n[Marx and Vorburger 1989]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "The type of light sources varies from system to system and is often either a halogen source [44],[51] or a laser source [28]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Some examples include [23], [44], [11], [27]: [23] discusses the issues involved in texture due to surface geometry, [44] measures the variation of brick texture with imaging conditions, [11] incorporates a type of view-dependent texture for rendering architecture and [27] considers perpendicular texture comprised of elements normal to the surface."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 18065356,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fc3c045b41634df69b0dae23ce20d3984d6aa188",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "We study and analyze properties underlying the visual appearance of materials such as the surface bidirectional reflection distribution function and texture. The spatial distribution of scattered light in relation to the incident light determines the surface appearance and can be partly specified by the bidirectional reflection distribution function, which is defined as the directionally dependent ratio of radiance to irradiance. We perform gonioradiometric measurements on samples of bricks and tiles. To describe the reflection mechanisms in the surfaces under study, we combine models of specular and diffuse reflectance from rough surfaces and fit them to the experimental data. We also collect images and determine the textural differences in the surface appearance, resulting from the variation in the illumination direction and the viewing directions."
            },
            "slug": "Surface-bidirectional-reflection-distribution-and-Stavridi-Ginneken",
            "title": {
                "fragments": [],
                "text": "Surface bidirectional reflection distribution function and the texture of bricks and tiles."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "To describe the reflection mechanisms in the surfaces under study, this work combines models of specular and diffuse reflectance from rough surfaces and fit them to the experimental data."
            },
            "venue": {
                "fragments": [],
                "text": "Applied optics"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745416"
                        ],
                        "name": "H. Tagare",
                        "slug": "H.-Tagare",
                        "structuredName": {
                            "firstName": "Hemant",
                            "lastName": "Tagare",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Tagare"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4271743"
                        ],
                        "name": "R. Defigueiredo",
                        "slug": "R.-Defigueiredo",
                        "structuredName": {
                            "firstName": "Rui",
                            "lastName": "Defigueiredo",
                            "middleNames": [
                                "J.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Defigueiredo"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 63796669,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e38d0c7d471c8150c26e1fc48ee9c7f8fc86cbf1",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract A reflectance map is the transfer function from surface orientation and illumination geometry to the surface normal, and in machine vision it plays a fundamental role in the reconstruction of surface by shape-from-shading and photometric stereo algorithms. While reflectance maps for Lambertain and specular surfaces are well understood, maps for real-world diffusely reflecting surfaces are scant. In this paper, the fundamental mechanisms of reflection from such surfaces are reviewed. Based on this, it is proposed that for point light source illumination, the diffuse component of the reflectance map has three terms: a forescatter term, a normal term, and a backscatter term. The physical origin of the three terms is discussed in detail and useful mathematical expressions are obtained for them. The range of applicability of the proposed reflectance maps is established, and an example of their use in photometric stereo is provided. The mathematical form of the reflectance map obtained from physical theories is amenable to generalization and such a generalization is called the m-lobed reflectance map is proposed."
            },
            "slug": "A-framework-for-the-construction-of-reflectance-for-Tagare-Defigueiredo",
            "title": {
                "fragments": [],
                "text": "A framework for the construction of reflectance maps for machine vision"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The fundamental mechanisms of reflection from such surfaces are reviewed and it is proposed that for point light source illumination, the diffuse component of the reflectance map has three terms: a forescatter term, a normal term, and a backscatterterm."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2476425"
                        ],
                        "name": "P. Heckbert",
                        "slug": "P.-Heckbert",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Heckbert",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Heckbert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6398235,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "ecea8cc9327866662856652c7ee623db5619a685",
            "isKey": false,
            "numCitedBy": 666,
            "numCiting": 90,
            "paperAbstract": {
                "fragments": [],
                "text": "Texture mapping is one of the most successful new techniques in high-quality image synthesis. It can enchance the visual richness of raster-scan images immensely while entailing only a relatively smann increase in computation. The technique has been applied to a number of surface attributes: surface color, surface normal, specularity, transparency, illumination, and surface displacement¿to name a few. Although the list is potentially endless, the techniques of texture mapping are essentially the same in all cases. This article surveys the fundamentals of texture mapping, which can be spilt into two topics: the geometric mapping that warps a texture onto a surface, and the filtering necessary to avoid aliasing. An extensive bibliography is included."
            },
            "slug": "Survey-of-Texture-Mapping-Heckbert",
            "title": {
                "fragments": [],
                "text": "Survey of Texture Mapping"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The fundamentals of texture mapping are surveyed, which can be spilt into two topics: the geometric mapping that warps a texture onto a surface, and the filtering necessary to avoid aliasing."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Computer Graphics and Applications"
            },
            "year": 1986
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061525227"
                        ],
                        "name": "J. Krumm",
                        "slug": "J.-Krumm",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Krumm",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Krumm"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12290634"
                        ],
                        "name": "S. Shafer",
                        "slug": "S.-Shafer",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Shafer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shafer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2441315,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b0987bce2f5fdf1c1e1909a8a17b7e830324c08c",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Uniformly textured surfaces in 3D scenes provide important cues for image understanding. Texture can be used for both segmentation and for 3D shape inference. Unfortunately, virtually all current algorithms are based on assumptions that make it impossible to do texture segmentation and shape-from-texture in the same image. Texture segmentation algorithms rely on an absence of 3D effects that tend to distort the texture. Shape-from-texture algorithms depend on these effects, relying instead on the texture being already segmented. To really understand texture in images, texture segmentation and shape-from-texture must be viewed as a combined problem to be solved simultaneously. We present a solution to this problem with a region-growing algorithm that explicitly accounts for perspective distortions of otherwise uniform texture. We use the image spectrogram to compute local surface normals, which are in turn used to \"frontalize\" the texture. These frontalized texture patches are then subjected to a region-growing algorithm based on similarity in the local frequency domain and a minimum description length criteria. We show results of our algorithm on real texture images taken in the lab and outdoors.<<ETX>>"
            },
            "slug": "Texture-segmentation-and-shape-in-the-same-image-Krumm-Shafer",
            "title": {
                "fragments": [],
                "text": "Texture segmentation and shape in the same image"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work uses the image spectrogram to compute local surface normals, which are in turn used to \"frontalize\" the texture, which is subjected to a region-growing algorithm based on similarity in the local frequency domain and a minimum description length criteria."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064076416"
                        ],
                        "name": "B. van Ginneken",
                        "slug": "B.-van-Ginneken",
                        "structuredName": {
                            "firstName": "Bram",
                            "lastName": "van Ginneken",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. van Ginneken"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2121368"
                        ],
                        "name": "M. Stavridi",
                        "slug": "M.-Stavridi",
                        "structuredName": {
                            "firstName": "Marigo",
                            "lastName": "Stavridi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Stavridi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44505138,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d0050917db488b35c5ad3644469ec054e0cac55f",
            "isKey": false,
            "numCitedBy": 168,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a reflection model for isotropic rough surfaces that have both specular and diffuse components. The surface is assumed to have a normal distribution of heights. Parameters of the model are the surface roughness given by the rms slope, the albedo, and the balance between diffuse and specular reflection. The effect of roughness on diffuse reflection is taken into account, instead of our modeling this component as a constant Lambertian term. The model includes geometrical effects such as masking and shadowing. The model is compared with experimental data obtained from goniophotometric measurements on samples of tiles and bricks. The model fits well to samples with very different reflection properties. Measurements of the sample profiles performed with a laser profilometer to determine the rms slope show that the assumed surface model is realistic. The model could therefore be used in machine vision and computer graphics to approximate reflection characteristics of surfaces. It could also be used to predict the texture of surfaces as a function of illumination and viewing angles."
            },
            "slug": "Diffuse-and-specular-reflectance-from-rough-Ginneken-Stavridi",
            "title": {
                "fragments": [],
                "text": "Diffuse and specular reflectance from rough surfaces."
            },
            "tldr": {
                "abstractSimilarityScore": 60,
                "text": "A reflection model for isotropic rough surfaces that have both specular and diffuse components that fits well to samples with very different reflection properties and could be used in machine vision and computer graphics to approximate reflection characteristics of surfaces."
            },
            "venue": {
                "fragments": [],
                "text": "Applied optics"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3221174"
                        ],
                        "name": "B. Super",
                        "slug": "B.-Super",
                        "structuredName": {
                            "firstName": "Boaz",
                            "lastName": "Super",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Super"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747569"
                        ],
                        "name": "A. Bovik",
                        "slug": "A.-Bovik",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Bovik",
                            "middleNames": [
                                "Conrad"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bovik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6928355,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e7650ef03c6fe9938ae57af9960a29887a527352",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Presents a non-feature-based solution to the problem of computing the shape of curved surfaces from texture information. First, the use of local spatial-frequency spectra and their moments to describe texture is discussed and motivated. A new, more accurate method for measuring the local spatial-frequency moments of an image texture using Gabor elementary functions and their derivatives is presented. Also described is a technique for separating shading from texture information, which makes the shape-from-texture algorithm robust to the shading effects found in real imagery. Second, a detailed model for the projection of local spectra and spectral moments of any surface reflectance patterns (not just textures) is developed. Third, the conditions under which the projection model can be solved for the orientation of the surface at each point are explored. Unlike earlier non-feature-based, curved surface shape-from-texture approaches, the assumption that the surface texture is isotropic is not required; surface texture homogeneity can be assumed instead. The algorithm's ability to operate on anisotropic and nondeterministic textures, and on both smooth- and rough-textured surfaces, is demonstrated. >"
            },
            "slug": "Shape-from-Texture-Using-Local-Spectral-Moments-Super-Bovik",
            "title": {
                "fragments": [],
                "text": "Shape from Texture Using Local Spectral Moments"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "Unlike earlier non-feature-based, curved surface shape-from-texture approaches, the assumption that the surface texture is isotropic is not required; surface texture homogeneity can be assumed instead."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1814788"
                        ],
                        "name": "K. Karner",
                        "slug": "K.-Karner",
                        "structuredName": {
                            "firstName": "Konrad",
                            "lastName": "Karner",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Karner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064625845"
                        ],
                        "name": "H. Mayer",
                        "slug": "H.-Mayer",
                        "structuredName": {
                            "firstName": "Heinz",
                            "lastName": "Mayer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Mayer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3339217"
                        ],
                        "name": "M. Gervautz",
                        "slug": "M.-Gervautz",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Gervautz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Gervautz"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 5166521,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "6aac02391c7a35564c16cf42cd347078ec9d78bf",
            "isKey": false,
            "numCitedBy": 58,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces an image based method for measuring bidirectional reflectance distribution functions (BRDF). The measurement system uses a CCD camera connected to a workstation to capture images from the material under investigation. The evaluation of the BRDF is performed in an image processing step, gathering BRDF values with a broad range of incident and reflected angles, followed by a fitting process, where these values are approximated by a chosen reflectance model. Absolute BRDF values are obtained by the usage of a diffuse reflectance standard. It is shown that the proposed measurement system produces very reasonable results compared to accurate measurements. Thus, it is an easy and cost efficient way to measure material properties needed for physically based rendering algorithms."
            },
            "slug": "An-Image-based-Measurement-System-for-Anisotropic-Karner-Mayer",
            "title": {
                "fragments": [],
                "text": "An Image based Measurement System for Anisotropic Reflection"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "An image based method for measuring bidirectional reflectance distribution functions (BRDF) using a CCD camera connected to a workstation to capture images from the material under investigation produces very reasonable results compared to accurate measurements."
            },
            "venue": {
                "fragments": [],
                "text": "Comput. Graph. Forum"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145878923"
                        ],
                        "name": "Maqbool Patel",
                        "slug": "Maqbool-Patel",
                        "structuredName": {
                            "firstName": "Maqbool",
                            "lastName": "Patel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Maqbool Patel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35175118"
                        ],
                        "name": "F. Cohen",
                        "slug": "F.-Cohen",
                        "structuredName": {
                            "firstName": "Fernand",
                            "lastName": "Cohen",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Cohen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 26757832,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8935f89a685bc950d2a40a6832e4bdbd8c6d7023",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of extracting the local shape information of a 3D textured surface from a single 2D image is addressed. The textured objects of interest are planar and developable surfaces that are viewed as originating by laying down a rubber planar sheet with a homogeneous parent texture on it onto the objects. The homogeneous planar parent texture is modeled by a stationary Gaussian Markov random field (GMRF). The probability density function of the projected planar parent texture is an explicit function of the parent GMRF parameters, the surface shape parameters, and the camera geometry. The surface shape parameter estimation is posed as a maximum-likelihood estimation problem. A stereo-windows concept is introduced to obtain a unique and consistent parent texture from the image data.<<ETX>>"
            },
            "slug": "Shape-from-texture-using-Markov-random-field-models-Patel-Cohen",
            "title": {
                "fragments": [],
                "text": "Shape from texture using Markov random field models and stereo-windows"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "The problem of extracting the local shape information of a 3D textured surface from a single 2D image is addressed and a stereo-windows concept is introduced to obtain a unique and consistent parent texture from the image data."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 1992 IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122895910,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "50c2835852d5f0d3a746446198a0893ed6f872aa",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "We study the illuminance texture due to three-dimensional surface mesostructure. In the conventional rendering algorithms various methods of approximate photometry are used whose domains of validity have been ill defined. We introduce the necessary photometric concepts and do a comparative study of rendering algorithms. In the computer graphics/vision literature the physically distinct causes of illuminance variation, namely, the obliqueness of surface elements and the effects of vignetting of extended sources, are thoroughly confused. This leads to serious errors when expressions are used in contexts outside their original realm. The treatment of the texture that is due to the illumination of surface mesostructure is an example. Erroneous results are obtained when simple expressions for the illuminance of convex bodies are interpreted in terms of equivalent sources and when these again are used in calculations involving different geometrical structures. We classify current methods in terms of the approximations (often implicitly) made and compare results for a large class of applications: that of surface mesostructure on convex objects. Large differences among the various approximative methods are found. We discuss simple methods that might be used to produce more realistic results at reasonable computational cost."
            },
            "slug": "Illuminance-texture-due-to-surface-mesostructure-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Illuminance texture due to surface mesostructure"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The necessary photometric concepts are introduced, current methods in terms of the approximations made are classified and results for a large class of applications are compared: that of surface mesostructure on convex objects."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266088"
                        ],
                        "name": "T. Leung",
                        "slug": "T.-Leung",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Leung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Leung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 40
                            }
                        ],
                        "text": "Some examples include [23], [44], [11], [27]: [23] discusses the issues involved in texture due to surface geometry, [44] measures the variation of brick texture with imaging conditions, [11] incorporates a type of view-dependent texture for rendering architecture and [27] considers perpendicular texture comprised of elements normal to the surface."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14729783,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f66b58c3c1a660500be7367c863891bf58238f28",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Almost all work on texture in the computer vision and graphics communities has modeled the texture as tangential, i.e. lying in the tangent plane to the surface. This is equivalent to thinking of the texture as a pattern painted on the surface. Three-dimensional textures, where the elements may point out of the surface, have largely been ignored. We study a special class of 3D textures, perpendicular textures where we can model the elements as being normal to the surface. The perspective projection of perpendicularly textured surfaces results in several interesting phenomena, which do not occur in the much-studied tangential texture case. These include occlusion, foreshortening and illumination. In this paper, we study the geometry of the problem, modeling the locations of the elements of the texture as being a realization of a spatial point process. Relations between slant and tilt of the surface, density and height of elements and occlusions are derived. Occlusions can now be used as a cue to infer shape, instead of being treated as a source of error."
            },
            "slug": "On-perpendicular-texture-or:-Why-do-we-see-more-in-Leung-Malik",
            "title": {
                "fragments": [],
                "text": "On perpendicular texture or: Why do we see more flowers in the distance?"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The geometry of the problem is studied, modeling the locations of the elements of the texture as being a realization of a spatial point process, and Relations between slant and tilt of the surface, density and height of elements and occlusions are derived."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40515830"
                        ],
                        "name": "S. H. Westin",
                        "slug": "S.-H.-Westin",
                        "structuredName": {
                            "firstName": "Stephen",
                            "lastName": "Westin",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. H. Westin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739434"
                        ],
                        "name": "J. Arvo",
                        "slug": "J.-Arvo",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Arvo",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Arvo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2369829"
                        ],
                        "name": "K. Torrance",
                        "slug": "K.-Torrance",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Torrance",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Torrance"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13347031,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "7966095218db22b06904d7a44eba789160097eee",
            "isKey": false,
            "numCitedBy": 414,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "We describe a physically-based Monte Carlo technique for approximating bidirectional reflectance distribution functions (BRDFs) for a large class of geometries by directly simulating optical scattering. The technique is more general than previous analytical models: it removes most restrictions on surface microgeometry. Three main points are described: a new representation of the BRDF, a Monte Carlo technique to estimate the coefficients of the representation, and the means of creating a milliscale BRDF from microscale scattering events. These allowthe prediction of scattering from essentially arbitrary roughness geometries. The BRDF is concisely represented by a matrix of spherical harmonic coefficients; the matrix is directly estimated from a geometric optics simulation, enforcing exact reciprocity. The method applies to roughness scales that are large with respect to the wavelength of light and small with respect to the spatial density at which the BRDF is sampled across the surface; examples include brushed metal and textiles. The method is validated by comparing with an existing scattering model and sample images are generated with a physically-based global illumination algorithm. CR Categories and Subject Descriptors: I.3.7 [Computer Graphics]: Three-Dimensional Graphics and Realism."
            },
            "slug": "Predicting-reflectance-functions-from-complex-Westin-Arvo",
            "title": {
                "fragments": [],
                "text": "Predicting reflectance functions from complex surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 84,
                "text": "A physically-based Monte Carlo technique for approximating bidirectional reflectance distribution functions (BRDFs) for a large class of geometries by directly simulating optical scattering, which removes most restrictions on surface microgeometry."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688682"
                        ],
                        "name": "R. Woodham",
                        "slug": "R.-Woodham",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Woodham",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Woodham"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61691075,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e632f0c2e5e0b91588b3874889fa2d535ed1d3ca",
            "isKey": false,
            "numCitedBy": 1905,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel technique called photometric stereo is introduced. The idea of photometric stereo is to vary the direction of incident illumination between successive images, while holding the viewing direction constant. It is shown that this provides sufficient information to determine surface orientation at each image point. Since the imaging geometry is not changed, the correspondence between image points is known a priori. The technique is photometric because it uses the radiance values recorded at a single image location, in successive views, rather than the relative positions of displaced features. Photometric stereo is used in computer-based image understanding. It can be applied in two ways. First, it is a general technique for deter-mining surface orientation at each image point. Second, it is a technique for determining object points that have a particular surface orientation. These applications are illustrated using synthesized examples."
            },
            "slug": "Photometric-method-for-determining-surface-from-Woodham",
            "title": {
                "fragments": [],
                "text": "Photometric method for determining surface orientation from multiple images"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "The idea of photometric stereo is to vary the direction of incident illumination between successive images, while holding the viewing direction constant, and it is shown that this provides sufficient information to determine surface orientation at each image point."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2951740"
                        ],
                        "name": "Bui Tuong Phong",
                        "slug": "Bui-Tuong-Phong",
                        "structuredName": {
                            "firstName": "Bui",
                            "lastName": "Phong",
                            "middleNames": [
                                "Tuong"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bui Tuong Phong"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1439868,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "90189b948a37477938a8d83d81b6737f930d7997",
            "isKey": false,
            "numCitedBy": 3306,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The quality of computer generated images of three-dimensional scenes depends on the shading technique used to paint the objects on the cathode-ray tube screen. The shading algorithm itself depends in part on the method for modeling the object, which also determines the hidden surface algorithm. The various methods of object modeling, shading, and hidden surface removal are thus strongly interconnected. Several shading techniques corresponding to different methods of object modeling and the related hidden surface algorithms are presented here. Human visual perception and the fundamental laws of optics are considered in the development of a shading rule that provides better quality and increased realism in generated images."
            },
            "slug": "Illumination-for-computer-generated-pictures-Phong",
            "title": {
                "fragments": [],
                "text": "Illumination for computer generated pictures"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Human visual perception and the fundamental laws of optics are considered in the development of a shading rule that provides better quality and increased realism in generated images."
            },
            "venue": {
                "fragments": [],
                "text": "Commun. ACM"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13687267"
                        ],
                        "name": "Tanweer Kabir",
                        "slug": "Tanweer-Kabir",
                        "structuredName": {
                            "firstName": "Tanweer",
                            "lastName": "Kabir",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tanweer Kabir"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2170732251"
                        ],
                        "name": "Fang Liu",
                        "slug": "Fang-Liu",
                        "structuredName": {
                            "firstName": "Fang",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fang Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Present algorithms for shape-fromtexture [14] ,[16],[10], texture segmentation [22],[10] and texture recognition [ 15 ] are only suitable for 2D textures, i.e."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6884754,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2cdfb65cb9d565f831fe11d048c8958c2c5e40f4",
            "isKey": false,
            "numCitedBy": 149,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The Brodatz Album has become the de facto standard for evaluating texture algorithms, with hundreds of studies having been applied to small sets of its images. The authors compare two powerful recognition algorithms, principal components analysis and multiscale autoregressive models, by evaluating them on a 999-image database derived from the entire Brodatz Album. The variety of homogeneous and nonhomogeneous images studied is thus nearly an order of magnitude larger than has been compared before, giving one snapshot of the state of the art in real-time texture recognition.<<ETX>>"
            },
            "slug": "Real-time-recognition-with-the-entire-Brodatz-Picard-Kabir",
            "title": {
                "fragments": [],
                "text": "Real-time recognition with the entire Brodatz texture database"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The authors compare two powerful recognition algorithms, principal components analysis and multiscale autoregressive models, by evaluating them on a 999-image database derived from the entire Brodatz Album, giving one snapshot of the state of the art in real-time texture recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685272"
                        ],
                        "name": "J. Blinn",
                        "slug": "J.-Blinn",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Blinn",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Blinn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Bump-mapping [4],[5],[2] preserves some of the appearance of roughness, but knowledge of the surface shape is required and shadows cast from the local surface relief are not rendered."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 14
                            }
                        ],
                        "text": "Bump-mapping [Blinn 1977, 1978; Becker and Fig."
                    },
                    "intents": []
                }
            ],
            "corpusId": 16775534,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "83fb6d2721cd26be4964882ce929ff8c98ebb688",
            "isKey": false,
            "numCitedBy": 983,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Computer generated shaded images have reached an impressive degree of realism with the current state of the art. They are not so realistic, however, that they would fool many people into believing they are real. One problem is that the surfaces tend to look artificial due to their extreme smoothness. What is needed is a means of simulating the surface irregularities that are on real surfaces. In 1973 Ed Catmull introduced the idea of using the parameter values of parametrically defined surfaces to index into a texture definition function which scales the intensity of the reflected light. By tying the texture pattern to the parameter values, the texture is guaranteed to rotate and move with the object. This is good for showing patterns painted on the surface, but attempts to simulate rough surfaces in this way are unconvincing. This paper presents a method of using a texturing function to perform a small perturbation on the direction of the surface normal before using it in the intensity calculations. This process yields images with realistic looking surface wrinkles without the need to model each wrinkle as a separate surface element. Several samples of images made with this technique are included."
            },
            "slug": "Simulation-of-wrinkled-surfaces-Blinn",
            "title": {
                "fragments": [],
                "text": "Simulation of wrinkled surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A method of using a texturing function to perform a small perturbation on the direction of the surface normal before using it in the intensity calculations yields images with realistic looking surface wrinkles without the need to model each wrinkle as a separate surface element."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '78"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1685272"
                        ],
                        "name": "J. Blinn",
                        "slug": "J.-Blinn",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Blinn",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Blinn"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Bump-mapping [4],[5],[2] preserves some of the appearance of roughness, but knowledge of the surface shape is required and shadows cast from the local surface relief are not rendered."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 14
                            }
                        ],
                        "text": "Bump-mapping [Blinn 1977, 1978; Becker and Fig."
                    },
                    "intents": []
                }
            ],
            "corpusId": 8043767,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "fb8cc7214937e0e8ae7a504c033918205cab7353",
            "isKey": false,
            "numCitedBy": 1381,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "In the production of computer generated pictures of three dimensional objects, one stage of the calculation is the determination of the intensity of a given object once its visibility has been established. This is typically done by modelling the surface as a perfect diffuser, sometimes with a specular component added for the simulation of hilights. This paper presents a more accurate function for the generation of hilights which is based on some experimental measurements of how light reflects from real surfaces. It differs from previous models in that the intensity of the hilight changes with the direction of the light source. Also the position and shape of the hilights is somewhat different from that generated by simpler models. Finally, the hilight function generates different results when simulating metallic vs. nonmetallic surfaces. Many of the effects so generated are somewhat subtle and are apparent only during movie sequences. Some representative still frames from such movies are included."
            },
            "slug": "Models-of-light-reflection-for-computer-synthesized-Blinn",
            "title": {
                "fragments": [],
                "text": "Models of light reflection for computer synthesized pictures"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "A more accurate function for the generation of hilights which is based on some experimental measurements of how light reflects from real surfaces is presented, which differs from previous models in that the intensity of the hilight changes with the direction of the light source."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '77"
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728885"
                        ],
                        "name": "G. Sakas",
                        "slug": "G.-Sakas",
                        "structuredName": {
                            "firstName": "Georgios",
                            "lastName": "Sakas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Sakas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73669293"
                        ],
                        "name": "Bertram Kernke",
                        "slug": "Bertram-Kernke",
                        "structuredName": {
                            "firstName": "Bertram",
                            "lastName": "Kernke",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bertram Kernke"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118451074,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "a9906a770b8042b540b2e6379df6b465fd392e68",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "Texturing methods developed in the past few years are well suited for’ solid objects’, which possess a well-defined and sharp surface, but they are inadequate for texturing ’foggy’ or ’fuzzy’ volume objects, which do not possess such surfaces. Here we propose an approach for quick generating density distributions defining volume objects of arbitrary shape. Our approach is a modified spectral synthesis method operating on the spectral representations of a texture and a main body and generates discrete voxel fields of the desired body shape. For that purpose, a spectral representation of the main body and the texture are calculated first, e.g., by means of a Fourier transform. After this, the amplitude and/or phase spectra of the body and texture are first filtered adequately and then 'merged' together. The resulting spectrum is back-transformed to the (Euclidean) voxel space by means of inverse Fourier transformation. With this approach it is possible to generate continuous transitions of an amorphous and random texture to a desired shape at low computational cost."
            },
            "slug": "Texture-Shaping:-A-Method-for-Modeling-Arbitrarily-Sakas-Kernke",
            "title": {
                "fragments": [],
                "text": "Texture Shaping: A Method for Modeling Arbitrarily Shaped Volume Objects in Texture Space"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "This work proposes an approach for quick generating density distributions defining volume objects of arbitrary shape by operating on the spectral representations of a texture and a main body and generates discrete voxel fields of the desired body shape."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2121368"
                        ],
                        "name": "M. Stavridi",
                        "slug": "M.-Stavridi",
                        "structuredName": {
                            "firstName": "Marigo",
                            "lastName": "Stavridi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Stavridi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 42971411,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8fa5e89d6bfd9feb61b4b04d32a4754c64a3b2b4",
            "isKey": false,
            "numCitedBy": 126,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "In many applications one needs a concise description of the Bidirectional Reflection Distribution Function (BRDF) of real materials. Because the BRDF depends on two independent directions (thus has four degrees of freedom) one typically has only a relatively sparse set of observations. In order to be able to interpolate these sparse data in a convenient and principled manner a series development in terms of an orthonormal basis is required. The elements of the basis should be ordered with respect to angular resolution. Moreover, the basis should automatically respect the inherent symmetries of the physics, i.e., Helmholtz's reciprocity and (most often) surface isotropy. We indicate how to construct a set of orthonormal polynomials on the Cartesian product of the hemisphere with itself with the required symmetry and invariance properties. These “surface scattering modes” form a convenient basis for the description of BRDF's."
            },
            "slug": "Bidirectional-Reflection-Distribution-Function-in-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Bidirectional Reflection Distribution Function Expressed in Terms of Surface Scattering Modes"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work indicates how to construct a set of orthonormal polynomials on the Cartesian product of the hemisphere with itself with the required symmetry and invariance properties."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34740030"
                        ],
                        "name": "L. B. Wolff",
                        "slug": "L.-B.-Wolff",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Wolff",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. B. Wolff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122094283,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "823947b486e2de405f6f08069d87f01a5e9f1c11",
            "isKey": false,
            "numCitedBy": 134,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A reflectance model that accurately predicts diffuse reflection from smooth inhomogeneous dielectric surfaces as a function of both viewing angle and angle of incidence is proposed. Utilizing results of radiative-transfer theory for subsurface multiple scattering, this new model precisely accounts for how incident light and the distribution of subsurface scattered light are influenced by Fresnel attenuation and Snell refraction at a smooth air–dielectric surface boundary. Whereas similar assumptions about subsurface scattering and Fresnel attenuation have been made in previous research on diffuse-reflectance modeling, the proposed model combines these assumptions in a different way and yields a more accurate expression for diffuse reflection that is shown to account for a number of empirical observations not predicted by existing models. What is particularly new about this diffuse-reflectance model is the resulting significant dependence on the viewing angle with respect to the surface normal. This dependence on the viewing angle explains distinctive properties of the behavior of diffuse reflection from smooth dielectric objects, properties not accounted for by existing diffuse-reflection models. Among these properties are prominent diffuse-reflection maxima effects occurring on objects when incident point-source illumination is greater than 50° relative to viewing, including the range from 90° to 180°, where the light source is behind the object with respect to viewing. For this range of incident illumination there is significant deviation from Lambertian behavior over a large portion of most smooth dielectric object surfaces, which makes it important for the computer vision community to be aware of such effects during incorporation of reflectance models into implementation of algorithms such as shape-from-shading. A number of experimental results are presented that verify the proposed diffuse-reflectance model."
            },
            "slug": "Diffuse-reflectance-model-for-smooth-dielectric-Wolff",
            "title": {
                "fragments": [],
                "text": "Diffuse-reflectance model for smooth dielectric surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145849467"
                        ],
                        "name": "Pierre Poulin",
                        "slug": "Pierre-Poulin",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Poulin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pierre Poulin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144881307"
                        ],
                        "name": "A. Fournier",
                        "slug": "A.-Fournier",
                        "structuredName": {
                            "firstName": "Alain",
                            "lastName": "Fournier",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fournier"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Although BRDF models have been widely discussed and used in computer vision and computer graphics (see [52],[49],[40],[51],[29],[48],[53],[22],[34],[18],[24]), the BRDFs of a large and diverse collection of real-world surfaces have never before been available."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 10102821,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "664bc5edbcbc65f81ba3dd951d207cd2900b2f3c",
            "isKey": false,
            "numCitedBy": 210,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "A reflection and refraction model for anisotropic surfaces is introduced. The anisotropy is simulated by small cylinders (added or subtracted) distributed on the anisotropic surface. Different levels of anisotropy are achieved by varying the distance between each cylinder and/or rising the cylinders more or less from the surface. Multidirectional anisotropy is modelled by orienting groups of cylinders in different direction. The intensity of the reflected light is computed by determining the visible and illuminated portion of the cylinders, taking self-blocking into account. We present two techniques to compute this in practice. In one the intensity is computed by sampling the surface of the cylinders. The other is an analytic solution. In the case of the diffuse component, the solution is exact. In the case of the specular component, an approximation is developed using a Chebyshev polynomial approximation of the specular term, and integrating the polynomial.This model can be implemented easily within most rendering system, given a suitable mechanism to define and alter surface tangents. The effectiveness of the model and the visual importance of anisotropy are illustrated with some pictures."
            },
            "slug": "A-model-for-anisotropic-reflection-Poulin-Fournier",
            "title": {
                "fragments": [],
                "text": "A model for anisotropic reflection"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This model can be implemented easily within most rendering system, given a suitable mechanism to define and alter surface tangents, and the visual importance of anisotropy is illustrated with some pictures."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3186450"
                        ],
                        "name": "S. Sandmeier",
                        "slug": "S.-Sandmeier",
                        "structuredName": {
                            "firstName": "Stefan",
                            "lastName": "Sandmeier",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sandmeier"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "70307593"
                        ],
                        "name": "W. Sandmeier",
                        "slug": "W.-Sandmeier",
                        "structuredName": {
                            "firstName": "Willy",
                            "lastName": "Sandmeier",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Sandmeier"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30543708"
                        ],
                        "name": "K. Itten",
                        "slug": "K.-Itten",
                        "structuredName": {
                            "firstName": "Klaus",
                            "lastName": "Itten",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Itten"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2199263"
                        ],
                        "name": "M. Schaepman",
                        "slug": "M.-Schaepman",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Schaepman",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Schaepman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49061867"
                        ],
                        "name": "T. Kellenberger",
                        "slug": "T.-Kellenberger",
                        "structuredName": {
                            "firstName": "Tobias",
                            "lastName": "Kellenberger",
                            "middleNames": [
                                "."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kellenberger"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 195,
                                "start": 174
                            }
                        ],
                        "text": "In other \nsystems, especially when the sample must stay fixed (as in measurement of terrain for remote-sensing), \na goniometer is used to orient the light source and detector [Sandmeier et al. 1995]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 164,
                                "start": 143
                            }
                        ],
                        "text": "For remote-sensing, \nthe surface unit measured can be quite large as the systems are designed to measure large patches of \nterrestrial surfaces [Sandmeier et al. 1995]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14804647,
            "fieldsOfStudy": [
                "Physics",
                "Environmental Science"
            ],
            "id": "78655856258b17f63f7dcd75c04724276d3a7773",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "The reflectance characteristics of most natural objects vary with illumination and viewing geometry, i.e. expose a non-Lambertian behaviour. New sensor systems are capable of viewing targets quasi-simultaneously from nadir and different off-nadir positions. In regard to radiometric corrections the Lambertian assumption has to be overcome by detailed knowledge of the bidirectional reflectance distribution function (BRDF) of targets at the Earth's surface. In order to obtain bidirectional reflectance factor (BRF) data of naturally illuminated targets a transportable field-goniometer system (FIGOS) has been developed. It is operated together with a GER-3700 spectroradiometer. The goniometer consists of an azimuth full-circle and a zenith semi-arc of 2 m radius each. It enables one to observe a target from any desired viewing direction. First measurements are taken from a plane meadow under different solar zenith angles over the hemisphere in a resolution of 15/spl deg/ and 30/spl deg/ in zenith and azimuth direction, respectively. A Spectralon panel is measured at the beginning and end of a hemispherical data set. As the position of the Sun and the atmospheric conditions cannot be assumed constant over the measurement period of about 18 minutes, the global solar irradiance is monitored simultaneously to the BRF-data acquisition. The obtained results clearly show the non-Lambertian reflectance characteristics of the meadow."
            },
            "slug": "The-Swiss-field-goniometer-system-(FIGOS)-Sandmeier-Sandmeier",
            "title": {
                "fragments": [],
                "text": "The Swiss field-goniometer system (FIGOS)"
            },
            "venue": {
                "fragments": [],
                "text": "1995 International Geoscience and Remote Sensing Symposium, IGARSS '95. Quantitative Remote Sensing for Science and Applications"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145278345"
                        ],
                        "name": "E. Marx",
                        "slug": "E.-Marx",
                        "structuredName": {
                            "firstName": "Egon",
                            "lastName": "Marx",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Marx"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "5501744"
                        ],
                        "name": "T. Vorburger",
                        "slug": "T.-Vorburger",
                        "structuredName": {
                            "firstName": "Theodore",
                            "lastName": "Vorburger",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Vorburger"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 168,
                                "start": 145
                            }
                        ],
                        "text": "The type of light sources varies from \nsystem to system and is often either a halogen source [Stavridi et al. 1997; Ward 1992] or a laser source \n[Marx and Vorburger 1989]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 64
                            }
                        ],
                        "text": "In some systems, \nmirrors are used to orient the incoming light [Marx and Vorburger 1989; Betty et al. 1996]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 136690430,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "4ce73a2db010813dbe26564ee09ce38bb1dcf95d",
            "isKey": false,
            "numCitedBy": 5,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The angular distribution of the light scattered by a rough surface contains information on the texture of the surface. Profiles of nine specimens were measured with a stylus instrument and angular distributions of the scattered light were measured with a detector. The rms roughness of a surface that has an identifiable specular beam can be determined from the relative intensity of that beam. The autocorrelation length and the parameters that define the autocorrelation function, as well as the roughness of rougher surfaces that produce no specular beam, can in principle be determined by fitting the distribution computed from a model of a random rough surface to the measured distribution. In practice, measurement errors and computation errors preclude the determination of these parameters by a leastÃ¢â‚¬â€?squares fit. Angular distributions were also computed from the surface profiles using a simplified model of the electromagnetic scattering."
            },
            "slug": "Light-Scattered-By-Random-Rough-Surfaces-And-Marx-Vorburger",
            "title": {
                "fragments": [],
                "text": "Light Scattered By Random Rough Surfaces And Roughness Determination"
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1778676"
                        ],
                        "name": "P. Debevec",
                        "slug": "P.-Debevec",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Debevec",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Debevec"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31589308"
                        ],
                        "name": "C. J. Taylor",
                        "slug": "C.-J.-Taylor",
                        "structuredName": {
                            "firstName": "Camillo",
                            "lastName": "Taylor",
                            "middleNames": [
                                "Jose"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. J. Taylor"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2609415,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37b0da92da8796835383f85c65cc81a386052a99",
            "isKey": false,
            "numCitedBy": 1993,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a new approach for modeling and rendering existing architectural scenes from a sparse set of still photographs. Our modeling approach, which combines both geometry-based and imagebased techniques, has two components. The first component is a photogrammetricmodeling method which facilitates the recovery of the basic geometry of the photographed scene. Our photogrammetric modeling approach is effective, convenient, and robust because it exploits the constraints that are characteristic of architectural scenes. The second component is a model-based stereo algorithm, which recovers how the real scene deviates from the basic model. By making use of the model, our stereo technique robustly recovers accurate depth from widely-spaced image pairs. Consequently, our approach can model large architectural environments with far fewer photographs than current image-based modeling approaches. For producing renderings, we present view-dependent texture mapping, a method of compositing multiple views of a scene that better simulates geometric detail on basic models. Our approach can be used to recover models for use in either geometry-based or image-based rendering systems. We present results that demonstrate our approach’s ability to create realistic renderings of architectural scenes from viewpoints far from the original photographs. CR Descriptors: I.2.10 [Artificial Intelligence]: Vision and Scene Understanding Modeling and recovery of physical attributes; I.3.7 [Computer Graphics]: Three-Dimensional Graphics and Realism Color, shading, shadowing, and texture I.4.8 [Image Processing]: Scene Analysis Stereo; J.6 [Computer-Aided Engineering]: Computer-aided design (CAD)."
            },
            "slug": "Modeling-and-rendering-architecture-from-a-hybrid-Debevec-Taylor",
            "title": {
                "fragments": [],
                "text": "Modeling and rendering architecture from photographs: a hybrid geometry- and image-based approach"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "This work presents a new approach for modeling and rendering existing architectural scenes from a sparse set of still photographs, which combines both geometry-based and imagebased techniques, and presents view-dependent texture mapping, a method of compositing multiple views of a scene that better simulates geometric detail on basic models."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750470"
                        ],
                        "name": "S. Nayar",
                        "slug": "S.-Nayar",
                        "structuredName": {
                            "firstName": "Shree",
                            "lastName": "Nayar",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Nayar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739452"
                        ],
                        "name": "K. Ikeuchi",
                        "slug": "K.-Ikeuchi",
                        "structuredName": {
                            "firstName": "Katsushi",
                            "lastName": "Ikeuchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Ikeuchi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18592894,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "64b6cd6a6351e82a9995899220f52b93af881476",
            "isKey": false,
            "numCitedBy": 745,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Reflectance models based on physical optics and geometrical optics are studied. Specifically, the authors consider the Beckmann-Spizzichino (physical optics) model and the Torrance-Sparrow (geometrical optics) model. These two models were chosen because they have been reported to fit experimental data well. Each model is described in detail, and the conditions that determine the validity of the model are clearly stated. By studying reflectance curves predicted by the two models, the authors propose a reflectance framework comprising three components: the diffuse lobe, the specular lobe, and the specular spike. The effects of surface roughness on the three primary components are analyzed in detail. >"
            },
            "slug": "Surface-Reflection:-Physical-and-Geometrical-Nayar-Ikeuchi",
            "title": {
                "fragments": [],
                "text": "Surface Reflection: Physical and Geometrical Perspectives"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "Reflectance models based on physical optics and geometrical optics are studied and a reflectance framework comprising three components is proposed: the diffuse lobe, the specular lobe, andThe specular spike is proposed."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1876626"
                        ],
                        "name": "G. Ward",
                        "slug": "G.-Ward",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Ward",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Ward"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3051069,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "804b9b7a7bece07b4cf885b3764bd4412325a55b",
            "isKey": false,
            "numCitedBy": 1311,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "A new device for measuring the spatial reflectancedistributionsof surfaces is introduced, along with a new mathematical model of sniaorropic reflectance. The reflectance model presented is both simple and accurate, permitting efficient reflectance data reduction rasdreproduction. Tire validity of the model is substantiated with comparisons to complete meaarsremems of surface reflectance functions gathered with the novel retlectometry device. This new device uses imaging technology to capture the entire hemisphem of reflected directions simttkarreously, which greatly accelerates the reflectance data gathering process, making it pssible to measure dozens of surfaces in the time that it used to take to do one. Example measurements and simulations are shown. and a table of fitted parameters for several surfaces is presented. General Terms: algorithms, measurement, theory, verification. CR Categories and Descriptors: 1.3.7 Three-dimensionalgraphics and rw#ism, 1.6.4 Model validation and analysis. Additional"
            },
            "slug": "Measuring-and-modeling-anisotropic-reflection-Ward",
            "title": {
                "fragments": [],
                "text": "Measuring and modeling anisotropic reflection"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "A new device for measuring the spatial reflectancedistributions of surfaces is introduced, along with a new mathematical model of sniaorropic reflectance, which is both simple and accurate, permitting efficient reflectance data reduction in production."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107094422"
                        ],
                        "name": "Z. Xie",
                        "slug": "Z.-Xie",
                        "structuredName": {
                            "firstName": "Z.",
                            "lastName": "Xie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Xie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144431498"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 29357945,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6d50e2bca57d22770d2fd632d55757f66e73c33d",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Wavelet transforms are attracting increasing interest in computer vision because they provide a mathematical tool for multiscale image analysis. In this paper, we show that i) the subsampled wavelet multiresolution representation is translationally variant; and ii) a wavelet transform of a signal generally confounds the phase component of the analysing wavelet associated with that scale and orientation. The importance of this observation is that commonly used features in texture analysis also depend on this phase component. This not only causes unnecessary spatial variation of features at each scale but also makes it more difficult to match features across scales."
            },
            "slug": "Texture-Segmentation-Using-Local-Energy-in-Wavelet-Xie-Brady",
            "title": {
                "fragments": [],
                "text": "Texture Segmentation Using Local Energy in Wavelet Scale Space"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is shown that i) the subsampled wavelet multiresolution representation is translationally variant; and ii) a wavelet transform of a signal generally confounds the phase component of the analysing wavelet associated with that scale and orientation."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38725127"
                        ],
                        "name": "B. Becker",
                        "slug": "B.-Becker",
                        "structuredName": {
                            "firstName": "Barry",
                            "lastName": "Becker",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Becker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744909"
                        ],
                        "name": "N. Max",
                        "slug": "N.-Max",
                        "structuredName": {
                            "firstName": "Nelson",
                            "lastName": "Max",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Max"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Bump-mapping [4],[5],[2] preserves some of the appearance of roughness, but knowledge of the surface shape is required and shadows cast from the local surface relief are not rendered."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16225234,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ab20338c4297248cca5f32322fce6352461c2915",
            "isKey": false,
            "numCitedBy": 127,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "A method is described for switching smoothly between rendering algorithms as required by the amount of visible surface detail. The result will be more realism with less computation for displaying objects whose surface detail can be described by one or more bump maps. The three rendering algorithms considered are a BRDF, bump mapping, and displacement mapping. The bump mapping has been modified to make it consistent with the other two. For a given viewpoint, one of these algorithms will show a better trade-off between quality, computation time, and aliasing than the other two. The decision as to which algorithm is appropriate is a function of distance, viewing angle, and the frequency of bumps in the bump map."
            },
            "slug": "Smooth-transitions-between-bump-rendering-Becker-Max",
            "title": {
                "fragments": [],
                "text": "Smooth transitions between bump rendering algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 96,
                "text": "A method is described for switching smoothly between rendering algorithms as required by the amount of visible surface detail, which will be more realism with less computation for displaying objects whose surface detail can be described by one or more bump maps."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "20784727"
                        ],
                        "name": "D. Peachey",
                        "slug": "D.-Peachey",
                        "structuredName": {
                            "firstName": "Darwyn",
                            "lastName": "Peachey",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Peachey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Another method of rendering surface texture is solid texturing [36],[38],[37],[19],[41] which combines a volumetric texture synthesis with volume rendering techniques."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18634415,
            "fieldsOfStudy": [
                "Materials Science"
            ],
            "id": "ef92edad4532fe2fd33dd0cfdeee661be2e6351e",
            "isKey": false,
            "numCitedBy": 402,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Texturing is an effective method of simulating surface detail at relatively low cost. Traditionally, texture functions have been defined on the two-dimensional surface coordinate systems of individual surface patches. This paper introduces the notion of \"solid texturing\". Solid texturing uses texture functions defined throughout a region of three-dimensional space. Many nonhomogeneous materials, including wood and stone, may be more realistically rendered using solid texture functions. In addition, solid texturing can easily be applied to complex surface which are difficult to texture using two-dimensional texture functions. The paper gives examples of solid texture functions based on Fourier synthesis, stochastic texture models, projections of two-dimensional textures, and combinations of other solid textures."
            },
            "slug": "Solid-texturing-of-complex-surfaces-Peachey",
            "title": {
                "fragments": [],
                "text": "Solid texturing of complex surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The paper gives examples of solid texture functions based on Fourier synthesis, stochastic texture models, projections of two-dimensional textures, and combinations of other solid textures."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '85"
            },
            "year": 1985
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145849467"
                        ],
                        "name": "Pierre Poulin",
                        "slug": "Pierre-Poulin",
                        "structuredName": {
                            "firstName": "Pierre",
                            "lastName": "Poulin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Pierre Poulin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144881307"
                        ],
                        "name": "A. Fournier",
                        "slug": "A.-Fournier",
                        "structuredName": {
                            "firstName": "Alain",
                            "lastName": "Fournier",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fournier"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17899534,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "6c82f0e626262209a6b5274527fedf856801d98d",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "A reeection and refraction model for anisotropic surfaces is introduced. The anisotropy is simulated by small cylinders (added or subtracted) distributed on the anisotropic surface. Diierent levels of anisotropy are achieved by varying the distance between each cylinder and/or rising the cylinders more or less from the surface. Multidirectional anisotropy is modelled by orienting groups of cylinders in diierent direction. The intensity of the reeected light is computed by determining the visible and illuminated portion of the cylinders, taking self-blocking into account. We present two techniques to compute this in practice. In one the intensity is computed by sampling the surface of the cylinders. The other is an analytic solution. In the case of the diiuse component , the solution is exact. In the case of the specular component, an approximation is developed using a Cheby-shev polynomial approximation of the specular term, and integrating the polynomial. This model can be implemented easily within most rendering system, given a suitable mechanism to deene and alter surface tangents. The eeectiveness of the model and the visual importance of anisotropy are illustrated with some pictures."
            },
            "slug": "A-Model-for-Anisotropic-Reeection-Poulin-Fournier",
            "title": {
                "fragments": [],
                "text": "A Model for Anisotropic Reeection"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2990085"
                        ],
                        "name": "C. L. Betty",
                        "slug": "C.-L.-Betty",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Betty",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. L. Betty"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2451086"
                        ],
                        "name": "A. Fung",
                        "slug": "A.-Fung",
                        "structuredName": {
                            "firstName": "Adrian",
                            "lastName": "Fung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1817663"
                        ],
                        "name": "J. Irons",
                        "slug": "J.-Irons",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Irons",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Irons"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61529522,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "5c86b70d7a3a1e55c6275f2f9c0eb157655fbb64",
            "isKey": false,
            "numCitedBy": 10,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The polarized bidirectional reflectance distribution function is measured for a Spectralon calibration target using an automated, broadband, polarized, optical goniometer. Measurements are acquired for illumination angles of 0, -20, -30, -40 -50, and -60 degrees as a function of receiver view angle. Both like- and cross-polarized components are measured for horizontally polarized incident illumination. The Spectralon target exhibits stronger specular behavior than expected where the ratio of the cross-polarized to like-polarized component in the specular direction varies from 0.67 to 0.1 for 0 and -60 degrees incidence respectively."
            },
            "slug": "The-measured-polarized-bidirectional-reflectance-of-Betty-Fung",
            "title": {
                "fragments": [],
                "text": "The measured polarized bidirectional reflectance distribution function of a Spectralon calibration target"
            },
            "venue": {
                "fragments": [],
                "text": "IGARSS '96. 1996 International Geoscience and Remote Sensing Symposium"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052819"
                        ],
                        "name": "A. Nolin",
                        "slug": "A.-Nolin",
                        "structuredName": {
                            "firstName": "Anne",
                            "lastName": "Nolin",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Nolin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144194831"
                        ],
                        "name": "K. Steffen",
                        "slug": "K.-Steffen",
                        "structuredName": {
                            "firstName": "Konrad",
                            "lastName": "Steffen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Steffen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144957194"
                        ],
                        "name": "J. Dozier",
                        "slug": "J.-Dozier",
                        "structuredName": {
                            "firstName": "Jeff",
                            "lastName": "Dozier",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Dozier"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "In remote-sensing, the BRDF of terrestrial surfaces such as soil, vegetation, snow and ice is a popular research topic [42],[33],[26],[43]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 61993543,
            "fieldsOfStudy": [
                "Environmental Science",
                "Mathematics"
            ],
            "id": "e7fbf5476f1101a9208338f72818a2d2ddedeef5",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "The angular distribution of reflected sunlight from snow is strongly anisotropic with most of the energy scattered in the forward direction. But, to obtain snow albedo from remote sensing data requires that we know the spectral bidirectional reflectance-distribution function (BRDF) as a function of snowpack physical properties such as snow depth, ice grain size, concentration of absorbing impurities and snowpack stratification. The authors establish the relationship between snow BRDF, snow physical properties, and solar/viewing geometries to improve estimates of surface albedo from remote sensing data. Using a discrete-ordinates radiative transfer model the authors have calculated the reflected spectral intensity of snow for a wide range of solar and viewing geometries. Corresponding snow reflectance measurements from Greenland and the Sierra Nevada, California, collected over a wide variety of snowpack conditions, show some agreement with the model results but the model appears to overestimate reflectance for solar zenith angles greater than 70 degrees. While snowpack physical properties are known to strongly affect the spectral reflectance of snow, the authors show how grain size, snowpack layering, and other physical properties also influence the angular reflectance from snow.<<ETX>>"
            },
            "slug": "Measurement-and-modeling-of-the-bidirectional-of-Nolin-Steffen",
            "title": {
                "fragments": [],
                "text": "Measurement and modeling of the bidirectional reflectance of snow"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IGARSS '94 - 1994 IEEE International Geoscience and Remote Sensing Symposium"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48459107"
                        ],
                        "name": "Z. Li",
                        "slug": "Z.-Li",
                        "structuredName": {
                            "firstName": "Z.",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2451086"
                        ],
                        "name": "A. Fung",
                        "slug": "A.-Fung",
                        "structuredName": {
                            "firstName": "Adrian",
                            "lastName": "Fung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Fung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50243627"
                        ],
                        "name": "D. Gibbs",
                        "slug": "D.-Gibbs",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Gibbs",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Gibbs"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2990085"
                        ],
                        "name": "C. L. Betty",
                        "slug": "C.-L.-Betty",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Betty",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. L. Betty"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733745"
                        ],
                        "name": "S. Tjuatja",
                        "slug": "S.-Tjuatja",
                        "structuredName": {
                            "firstName": "Saibun",
                            "lastName": "Tjuatja",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Tjuatja"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1817663"
                        ],
                        "name": "J. Irons",
                        "slug": "J.-Irons",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Irons",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Irons"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62740560,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "18e9b64a5ef1f0d8b254d87d58f760e5c6088d25",
            "isKey": false,
            "numCitedBy": 4,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "An examination of soil particles from very fine to medium sand surfaces has indicated that they are generally on the order of 50 to 500 microns. Thus, at an incident wavelength around 0.6 micron, the incident light should \"see\" microscopic roughness features on the particle rather than its macroscopic features. It is anticipated that the macroscopic features of a soil particle are responsible for the shadowing and tilting of the much smaller roughness scales that ride on it. Note that these smaller scales of roughness may still be larger than the incident wavelength. In view of this physical structure, a soil particle is modeled as a layer with two arbitrarily oriented surface boundaries to simulate the overall roughness effect. A scattering phase function is then developed for this layer by considering wave scattering from and propagation through it. A probability distribution function for the orientation of the layer boundaries is assumed for the calculation of this phase function. After the phase function is developed, it is incorporated into a matrix doubling algorithm to calculate the polarized bidirectional reflectance distribution function (BRDF) for a half space of soil particles. This quantity is then converted to the polarized bidirectional reflectance factor (BRF) so that the calculated BRF can be compared with polarized BRF measurements. Preliminary results indicate that backscattering is dominated by the small scales of roughness riding on the particle, and that large scales of roughness are responsible for tilting.<<ETX>>"
            },
            "slug": "A-modeling-study-of-bidirectional-reflectance-from-Li-Fung",
            "title": {
                "fragments": [],
                "text": "A modeling study of bidirectional reflectance from soil surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "Preliminary results indicate that backscattering is dominated by the small scales of roughness riding on the particle, and that large scales ofroughness are responsible for tilting."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IGARSS '94 - 1994 IEEE International Geoscience and Remote Sensing Symposium"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "105051852"
                        ],
                        "name": "G. Schluessel",
                        "slug": "G.-Schluessel",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Schluessel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Schluessel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7562455"
                        ],
                        "name": "R. Dickinson",
                        "slug": "R.-Dickinson",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Dickinson",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Dickinson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2447286"
                        ],
                        "name": "J. Privette",
                        "slug": "J.-Privette",
                        "structuredName": {
                            "firstName": "Jeffrey",
                            "lastName": "Privette",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Privette"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1773018"
                        ],
                        "name": "W. Emery",
                        "slug": "W.-Emery",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Emery",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Emery"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1726909"
                        ],
                        "name": "R. Kokaly",
                        "slug": "R.-Kokaly",
                        "structuredName": {
                            "firstName": "Raymond",
                            "lastName": "Kokaly",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kokaly"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 128704185,
            "fieldsOfStudy": [
                "Environmental Science",
                "Mathematics"
            ],
            "id": "4c89911b5987d73ced0876965dd525f119084142",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "An analytical model of the bidirectional reflectance for optically semi-infinite plant canopies has been extended to describe the reflectance of finite depth canopies with contributions from the underlying soil. The model depends on 10 independent parameters describing vegetation and soil optical and structural properties. The model is inverted with a nonlinear minimization routine using directional reflectance data for lawn (leaf area index (LAI) is equal to 9.9), soybeans (LAI, 2.9) and simulated reflectance data (LAI, 1.0) from a numerical bidirectional reflectance distribution function (BRDF) model (Myneni et al., 1988). While the ten-parameter model results in relatively low rms differences for the BRDF, most of the retrieved parameters exhibit poor stability. The most stable parameter was the single-scattering albedo of the vegetation. Canopy albedo could be derived with an accuracy of less than 5% relative error in the visible and less than 1% in the near-infrared. Sensitivity tests were performed to determine which of the 10 parameters were most important and to assess the effects of Gaussian noise on the parameter retrievals. Out of the 10 parameters, three were identified which described most of the BRDF variability. At low LAI values the most influential parameters were the single-scattering albedos (both soil and vegetation) and LAI, while at higher LAI values (> 2.5) these shifted to the two scattering phase function parameters for vegetation and the single-scattering albedo of the vegetation. The three-parameter model, formed by fixing the seven least significant parameters, gave higher rms values but was less sensitive to noise in the BRDF than the full ten-parameter model. A full hemispherical reflectance data set for lawn was then interpolated to yield BRDF values corresponding to advanced very high resolution radiometer (AVHRR) scan geometries collected over a period of nine days. The resulting retrieved parameters and BRDFs are similar to those for the full sampling geometry, suggesting that the limited geometry of AVHRR measurements might be used to reliably retrieve BRDF and canopy albedo with this model."
            },
            "slug": "Modeling-the-bidirectional-reflectance-distribution-Schluessel-Dickinson",
            "title": {
                "fragments": [],
                "text": "Modeling the bidirectional reflectance distribution function of mixed finite plant canopies and soil"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7147905"
                        ],
                        "name": "J. Stover",
                        "slug": "J.-Stover",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Stover",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Stover"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 94
                            }
                        ],
                        "text": "Optical scatter is considered a source of \nnoise that limits system resolution and throughput [Stover 1989]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 136,
                                "start": 125
                            }
                        ],
                        "text": "In the development of space optics, \nscatter from contami­nants (such as rocket exhaust) is a key issue in system development [Stover 1989; \nHerren 1989; Howard et al. 1989]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 109657629,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "374a71d34a472521c6a75c2eb260bb4921ea0904",
            "isKey": false,
            "numCitedBy": 7,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Although optical scatter is a source of noise, limits resolution and reduces system throughput, it is also an extremely sensitive metrology tool and is being employed in a wide variety of applications both in and out of the optics industry. This paper is intended as a brief review of the current state of this important technology as it emerges from university and government laboratories to more general industry use. The bidirectional scatter distribution function (or BSDF) has become the common format for expressing scatter data and is now used almost universally. Measurements are routinely made at several laboratories around the country from the UV to the mid-IR. Data analysis of optical component scatter has progressed to the point where a variety of analysis tools are becoming available for discriminating between the various sources of scatter. Work has progressed on the analysis of rough surface scatter and the application of these techniques to some challenging problems outside the optical industry. Scatter metrology is acquiring standards and formal test procedures. The available scatter data base is rapidly expanding as the number and sophistication of measurement facilities increases. Scatter from contaminants, which is a key issue for space optics, is continuing to be a major area of work as scatterometers appear in vacuum chambers at various laboratories across the country. The current flurry of work in this growing area of metrology can be expected to continue for several more years and expand to applications outside the optics industry."
            },
            "slug": "Scatter-From-Optical-Components:-An-Overview-Stover",
            "title": {
                "fragments": [],
                "text": "Scatter From Optical Components: An Overview"
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2529896"
                        ],
                        "name": "H. Gouraud",
                        "slug": "H.-Gouraud",
                        "structuredName": {
                            "firstName": "Henri",
                            "lastName": "Gouraud",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Gouraud"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 123827991,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "36b7e48f4b5c0a26d3639eda483fb17ecec874fb",
            "isKey": false,
            "numCitedBy": 522,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A procedure for computing shaded pictures of curved surfaces is presented. The surface is approximated by small polygons in order to solve easily the hidden-parts problem, but the shading of each polygon is computed so that discontinuities of shade are eliminated across the surface and a smooth appearance is obtained. In order to achieve speed efficiency, the technique developed by Watkins is used which makes possible a hardware implementation of this algorithm."
            },
            "slug": "Continuous-Shading-of-Curved-Surfaces-Gouraud",
            "title": {
                "fragments": [],
                "text": "Continuous Shading of Curved Surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "The surface is approximated by small polygons in order to solve easily the hidden-parts problem, but the shading of each polygon is computed so that discontinuities of shade are eliminated across the surface and a smooth appearance is obtained."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Computers"
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "153024876"
                        ],
                        "name": "J. P. Lewis",
                        "slug": "J.-P.-Lewis",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Lewis",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. P. Lewis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10227034,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "37d4295a6fe32b5d89217b8fbc023d8185b0cf50",
            "isKey": false,
            "numCitedBy": 215,
            "numCiting": 28,
            "paperAbstract": {
                "fragments": [],
                "text": "A solid noise is a function that defines a random value at each point in space. Solid noises have immediate and powerful applications in surface texturing, stochastic modeling, and the animation of natural phenomena.Existing solid noise synthesis algorithms are surveyed and two new algorithms are presented. The first uses Wiener interpolation to interpolate random values on a discrete lattice. The second is an efficient sparse convolution algorithm. Both algorithms are developed for model-directed synthesis, in which sampling and construction of the noise occur only at points where the noise value is required, rather than over a regularly sampled region of space. The paper attempts to present the rationale for the selection of these particular algorithms.The new algorithms have advantages of efficiency, improved control over the noise power spectrum, and the absence of artifacts. The convolution algorithm additionally allows quality to be traded for efficiency without introducing obvious deterministic effects. The algorithms are particularly suitable for applications where high-quality solid noises are required. Several sample applications in stochastic modeling and solid texturing are shown."
            },
            "slug": "Algorithms-for-solid-noise-synthesis-Lewis",
            "title": {
                "fragments": [],
                "text": "Algorithms for solid noise synthesis"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The paper attempts to present the rationale for the selection of these particular algorithms, which have advantages of efficiency, improved control over the noise power spectrum, and the absence of artifacts."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '89"
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32583901"
                        ],
                        "name": "R. Kashyap",
                        "slug": "R.-Kashyap",
                        "structuredName": {
                            "firstName": "Rangasami",
                            "lastName": "Kashyap",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kashyap"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46507162,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "60e3e8fe3a0e8e804362b41e935325886f70a902",
            "isKey": false,
            "numCitedBy": 103,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "A class of finite-order two-dimensional autoregressive moving average (ARMA) is introduced that can represent any process with rational spectral density. In this model the driving noise is correlated and need not be Gaussian. Currently known classes of ARMA models or AR models are shown to be subsets of the above class. The three definitions of Markov property are discussed, and the class of ARMA models are precisely stated which have the noncausal and semicausal Markov property without imposing any specific boundary conditions. Next two approaches are considered to estimate the parameters of a model to fit a given image. The first method uses only the empirical correlations and involves the solution of linear equations. The second method is the likelihood approach. Since the exact likelihood function is difficult to compute, we resort to approximations suggested by the toroidal models. Numerical experiments compare the quality of the two estimation schemes. Finally the problem of synthesizing a texture obeying an ARMA model is considered."
            },
            "slug": "Characterization-and-estimation-of-two-dimensional-Kashyap",
            "title": {
                "fragments": [],
                "text": "Characterization and estimation of two-dimensional ARMA models"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "A class of finite-order two-dimensional autoregressive moving average (ARMA) is introduced that can represent any process with rational spectral density and has the noncausal and semicausal Markov property without imposing any specific boundary conditions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16964060"
                        ],
                        "name": "F. E. Nicodemus",
                        "slug": "F.-E.-Nicodemus",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Nicodemus",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. E. Nicodemus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52314106"
                        ],
                        "name": "J. Richmond",
                        "slug": "J.-Richmond",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Richmond",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Richmond"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33878926"
                        ],
                        "name": "J. Hsia",
                        "slug": "J.-Hsia",
                        "structuredName": {
                            "firstName": "Jack",
                            "lastName": "Hsia",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Hsia"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33704040"
                        ],
                        "name": "I. Ginsberg",
                        "slug": "I.-Ginsberg",
                        "structuredName": {
                            "firstName": "Irving",
                            "lastName": "Ginsberg",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Ginsberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69408740"
                        ],
                        "name": "T. Limperis",
                        "slug": "T.-Limperis",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Limperis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Limperis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18645782,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "0709f019c495a97b2a0369ded5ec18fe52e8672c",
            "isKey": false,
            "numCitedBy": 1954,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "Report issued by the U.S. National Bureau of Standards discussing specifications of reflectance and proposed nomenclature. As stated in the introduction, \"this monograph presents a unified approach to the specification of reflectance in relation to the beam geometry of both the incident and the reflected flux in any reflectometer or in any application of measured reflectance data\" (p. 1). This report includes illustrations."
            },
            "slug": "Geometrical-considerations-and-nomenclature-for-Nicodemus-Richmond",
            "title": {
                "fragments": [],
                "text": "Geometrical considerations and nomenclature for reflectance"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "This monograph presents a unified approach to the specification of reflectance in relation to the beam geometry of both the incident and the reflected flux in any reflectometer or in any application of measured reflectance data."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1977
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49589450"
                        ],
                        "name": "Timothy L. Howard",
                        "slug": "Timothy-L.-Howard",
                        "structuredName": {
                            "firstName": "Timothy",
                            "lastName": "Howard",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Timothy L. Howard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50407047"
                        ],
                        "name": "P. George",
                        "slug": "P.-George",
                        "structuredName": {
                            "firstName": "Patricia",
                            "lastName": "George",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. George"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "105043956"
                        ],
                        "name": "Steve Flammang",
                        "slug": "Steve-Flammang",
                        "structuredName": {
                            "firstName": "Steve",
                            "lastName": "Flammang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steve Flammang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34640681"
                        ],
                        "name": "D. Mossman",
                        "slug": "D.-Mossman",
                        "structuredName": {
                            "firstName": "Daryl",
                            "lastName": "Mossman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Mossman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 169,
                                "start": 151
                            }
                        ],
                        "text": "In the development of space optics, \nscatter from contami­nants (such as rocket exhaust) is a key issue in system development [Stover 1989; \nHerren 1989; Howard et al. 1989]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 129181366,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "ce7057f68787da8ecdf7485772af4d5f00fc7f5a",
            "isKey": false,
            "numCitedBy": 2,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Spaceborne optical systems designed for long-duration missions are susceptible to degradation from contaminants in the spacecraft environment. In order to assess contamination build-up rates and corresponding scatter changes, we have designed a BRDF measurement system for use in a high-vacuum (10-8 Torr), low-temperature (20K) environment. The system measures cryocooled optics at angles from near-specular (< 1°) to approximately 30° off-axis, at wavelengths of 0.633 and 10.6 microns. We describe the design characteristics of the instrument, and discuss preliminary experiments which demonstrate contamination build-up correlated with changes in the sample BRDF profiles. The current status of the instrument is reviewed and future plans and applications summarized."
            },
            "slug": "Vacuum-BRDF-Measurements-Of-Cryogenic-Optical-Howard-George",
            "title": {
                "fragments": [],
                "text": "Vacuum BRDF Measurements Of Cryogenic Optical Surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "91856001"
                        ],
                        "name": "K. Herren",
                        "slug": "K.-Herren",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Herren",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Herren"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 138
                            }
                        ],
                        "text": "In the development of space optics, \nscatter from contami­nants (such as rocket exhaust) is a key issue in system development [Stover 1989; \nHerren 1989; Howard et al. 1989]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 122209216,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "6a7fbbac4b0453ea6b45dd7a4482b2305501058e",
            "isKey": false,
            "numCitedBy": 1,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "NASA's In-Situ Contamination Effects Facility, Marshall Space Flight Center will be used to measure the polarization scattering from optical surfaces due to outgassed molecular contamination. Measurements will be taken using a non-coherent vacuum ultraviolet (VUV) source at 123.6 nm and a set of three solar blind VUV photomultipliers. An in-plane VUV BRDF experiment is described and details of the on-going program to characterize optical materials exposed to the space environment is reported."
            },
            "slug": "Measurements-Of-Polarization-Scattering-In-The-Herren",
            "title": {
                "fragments": [],
                "text": "Measurements Of Polarization Scattering In The Vacuum Ultraviolet"
            },
            "venue": {
                "fragments": [],
                "text": "Optics & Photonics"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48282972"
                        ],
                        "name": "A. Exline",
                        "slug": "A.-Exline",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Exline",
                            "middleNames": [],
                            "suffix": ""
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Exline"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1482961,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d1713935c6037ffef0a5452426370b1940e8690c",
            "isKey": false,
            "numCitedBy": 1018,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "The history of computer graphics is sketched. Hardware principles are outlined, and the various types of display are described. Computer graphic standards are discussed. Future developments are predicted.<<ETX>>"
            },
            "slug": "Computer-graphics-Exline",
            "title": {
                "fragments": [],
                "text": "Computer graphics"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The history of computer graphics is sketched, hardware principles are outlined, and the various types of display are described."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Potentials"
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "To compare our calibration and normalization with the standards proposed by [1], we discuss our methods in the context of the standard’s recommendations outlined in the calibration and normalization section (section 6 of [1])."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 21,
                                "start": 18
                            }
                        ],
                        "text": "The ASTM standard [1] outlines a standard practice for BRDF measurement."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 172,
                                "start": 169
                            }
                        ],
                        "text": "Variations of BRDF measurement techniques as described and observation of sources of error among different BRDF measurements led to the development of the ASTM standard [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 71,
                                "start": 68
                            }
                        ],
                        "text": "To compare our measurement equipment with the standards proposed by [1], we iterate through each item in the apparatus section (section 5 of [1]) and discuss the relevant item of our measurement system in the context of the standard’s recommendations."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Standard practice for angle resolved optical scatter measurements on specular or diffuse surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "American Society for Testing and Materials."
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 119
                            }
                        ],
                        "text": "In remote-sensing, the BRDF of terrestrial surfaces such as soil, vegetation, snow and ice is a popular research topic [42],[33],[26],[43]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 146,
                                "start": 142
                            }
                        ],
                        "text": "For remote-sensing, the surface unit measured can be quite large as the systems are designed to measure large patches of terrestrial surfaces [42]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 177,
                                "start": 173
                            }
                        ],
                        "text": "In other systems, especially when the sample must stay fixed (as in measurement of terrain for remote-sensing), a goniometer is used to orient the light source and detector [42]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 164,
                                "start": 143
                            }
                        ],
                        "text": "For remote-sensing, \nthe surface unit measured can be quite large as the systems are designed to measure large patches of \nterrestrial surfaces [Sandmeier et al. 1995]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 195,
                                "start": 174
                            }
                        ],
                        "text": "In other \nsystems, especially when the sample must stay fixed (as in measurement of terrain for remote-sensing), \na goniometer is used to orient the light source and detector [Sandmeier et al. 1995]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The Swiss field-goniometer system"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IGARSS ’95, IEEE International Geoscience and Remote Sensing Symposium, pp. 2078-2080, July 1995."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143814637"
                        ],
                        "name": "Berthold K. P. Horn",
                        "slug": "Berthold-K.-P.-Horn",
                        "structuredName": {
                            "firstName": "Berthold",
                            "lastName": "Horn",
                            "middleNames": [
                                "K.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Berthold K. P. Horn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728401"
                        ],
                        "name": "M. Brooks",
                        "slug": "M.-Brooks",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brooks",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brooks"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 127217532,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "a1c45a16a17a94fbb1fb794f07237eabaddbe5e6",
            "isKey": false,
            "numCitedBy": 703,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Understanding how the shape of a three dimensional object may be recovered from shading in a two-dimensional image of the object is one of the most important - and still unresolved - problems in machine vision. Although this important subfield is now in its second decade, this book is the first to provide a comprehensive review of shape from shading. It brings together all of the seminal papers on the subject, shows how recent work relates to more traditional approaches, and provides a comprehensive annotated bibliography.The book's 17 chapters cover: Surface Descriptions from Stereo and Shading. Shape and Source from Shading. The Eikonal Equation: some Results Applicable to Computer Vision. A Method for Enforcing Integrability in Shape from Shading Algorithms. Obtaining Shape from Shading Information. The Variational Approach to Shape from Shading. Calculating the Reflectance Map. Numerical Shape from Shading and Occluding Boundaries. Photometric Invariants Related to Solid Shape. Improved Methods of Estimating Shape from Shading Using the Light Source Coordinate System. A Provably Convergent Algorithm for Shape from Shading. Recovering Three Dimensional Shape from a Single Image of Curved Objects. Perception of Solid Shape from Shading. Local Shading Analysis Pentland. Radarclinometry for the Venus Radar Mapper. Photometric Method for Determining Surface Orientation from Multiple Images.Berthold K. P. Horn is Professor of Electrical Engineering and Computer Science at MIT. He has presided over the field of machine vision for more than a decade and is the author of \"Robot Vision. \"Michael Brooks is Reader in Computer Science at The Flinders University of South Australia. \"Shape from Shading\" is included in the Artificial Intelligence series, edited by Michael Brady, Daniel Bobrow, and Randall Davis."
            },
            "slug": "Shape-from-shading-Horn-Brooks",
            "title": {
                "fragments": [],
                "text": "Shape from shading"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122895910,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "50c2835852d5f0d3a746446198a0893ed6f872aa",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "We study the illuminance texture due to three-dimensional surface mesostructure. In the conventional rendering algorithms various methods of approximate photometry are used whose domains of validity have been ill defined. We introduce the necessary photometric concepts and do a comparative study of rendering algorithms. In the computer graphics/vision literature the physically distinct causes of illuminance variation, namely, the obliqueness of surface elements and the effects of vignetting of extended sources, are thoroughly confused. This leads to serious errors when expressions are used in contexts outside their original realm. The treatment of the texture that is due to the illumination of surface mesostructure is an example. Erroneous results are obtained when simple expressions for the illuminance of convex bodies are interpreted in terms of equivalent sources and when these again are used in calculations involving different geometrical structures. We classify current methods in terms of the approximations (often implicitly) made and compare results for a large class of applications: that of surface mesostructure on convex objects. Large differences among the various approximative methods are found. We discuss simple methods that might be used to produce more realistic results at reasonable computational cost."
            },
            "slug": "Illuminance-texture-due-to-surface-mesostructure-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Illuminance texture due to surface mesostructure"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The necessary photometric concepts are introduced, current methods in terms of the approximations made are classified and results for a large class of applications are compared: that of surface mesostructure on convex objects."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34740030"
                        ],
                        "name": "L. B. Wolff",
                        "slug": "L.-B.-Wolff",
                        "structuredName": {
                            "firstName": "Lawrence",
                            "lastName": "Wolff",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. B. Wolff"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122094283,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "823947b486e2de405f6f08069d87f01a5e9f1c11",
            "isKey": false,
            "numCitedBy": 134,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A reflectance model that accurately predicts diffuse reflection from smooth inhomogeneous dielectric surfaces as a function of both viewing angle and angle of incidence is proposed. Utilizing results of radiative-transfer theory for subsurface multiple scattering, this new model precisely accounts for how incident light and the distribution of subsurface scattered light are influenced by Fresnel attenuation and Snell refraction at a smooth air–dielectric surface boundary. Whereas similar assumptions about subsurface scattering and Fresnel attenuation have been made in previous research on diffuse-reflectance modeling, the proposed model combines these assumptions in a different way and yields a more accurate expression for diffuse reflection that is shown to account for a number of empirical observations not predicted by existing models. What is particularly new about this diffuse-reflectance model is the resulting significant dependence on the viewing angle with respect to the surface normal. This dependence on the viewing angle explains distinctive properties of the behavior of diffuse reflection from smooth dielectric objects, properties not accounted for by existing diffuse-reflection models. Among these properties are prominent diffuse-reflection maxima effects occurring on objects when incident point-source illumination is greater than 50° relative to viewing, including the range from 90° to 180°, where the light source is behind the object with respect to viewing. For this range of incident illumination there is significant deviation from Lambertian behavior over a large portion of most smooth dielectric object surfaces, which makes it important for the computer vision community to be aware of such effects during incorporation of reflectance models into implementation of algorithms such as shape-from-shading. A number of experimental results are presented that verify the proposed diffuse-reflectance model."
            },
            "slug": "Diffuse-reflectance-model-for-smooth-dielectric-Wolff",
            "title": {
                "fragments": [],
                "text": "Diffuse-reflectance model for smooth dielectric surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40701106"
                        ],
                        "name": "M. Born",
                        "slug": "M.-Born",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Born",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Born"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144279306"
                        ],
                        "name": "E. Wolf",
                        "slug": "E.-Wolf",
                        "structuredName": {
                            "firstName": "Emil",
                            "lastName": "Wolf",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Wolf"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 118723218,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "d098e0cefa98fff6fc50fb59333b06abf1fad9ce",
            "isKey": false,
            "numCitedBy": 18496,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Principles-of-Optics-Born-Wolf",
            "title": {
                "fragments": [],
                "text": "Principles of Optics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1959
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745416"
                        ],
                        "name": "H. Tagare",
                        "slug": "H.-Tagare",
                        "structuredName": {
                            "firstName": "Hemant",
                            "lastName": "Tagare",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Tagare"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4271743"
                        ],
                        "name": "R. Defigueiredo",
                        "slug": "R.-Defigueiredo",
                        "structuredName": {
                            "firstName": "Rui",
                            "lastName": "Defigueiredo",
                            "middleNames": [
                                "J.",
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Defigueiredo"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 63796669,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e38d0c7d471c8150c26e1fc48ee9c7f8fc86cbf1",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract A reflectance map is the transfer function from surface orientation and illumination geometry to the surface normal, and in machine vision it plays a fundamental role in the reconstruction of surface by shape-from-shading and photometric stereo algorithms. While reflectance maps for Lambertain and specular surfaces are well understood, maps for real-world diffusely reflecting surfaces are scant. In this paper, the fundamental mechanisms of reflection from such surfaces are reviewed. Based on this, it is proposed that for point light source illumination, the diffuse component of the reflectance map has three terms: a forescatter term, a normal term, and a backscatter term. The physical origin of the three terms is discussed in detail and useful mathematical expressions are obtained for them. The range of applicability of the proposed reflectance maps is established, and an example of their use in photometric stereo is provided. The mathematical form of the reflectance map obtained from physical theories is amenable to generalization and such a generalization is called the m-lobed reflectance map is proposed."
            },
            "slug": "A-framework-for-the-construction-of-reflectance-for-Tagare-Defigueiredo",
            "title": {
                "fragments": [],
                "text": "A framework for the construction of reflectance maps for machine vision"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The fundamental mechanisms of reflection from such surfaces are reviewed and it is proposed that for point light source illumination, the diffuse component of the reflectance map has three terms: a forescatter term, a normal term, and a backscatterterm."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688682"
                        ],
                        "name": "R. Woodham",
                        "slug": "R.-Woodham",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Woodham",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Woodham"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61691075,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e632f0c2e5e0b91588b3874889fa2d535ed1d3ca",
            "isKey": false,
            "numCitedBy": 1905,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "A novel technique called photometric stereo is introduced. The idea of photometric stereo is to vary the direction of incident illumination between successive images, while holding the viewing direction constant. It is shown that this provides sufficient information to determine surface orientation at each image point. Since the imaging geometry is not changed, the correspondence between image points is known a priori. The technique is photometric because it uses the radiance values recorded at a single image location, in successive views, rather than the relative positions of displaced features. Photometric stereo is used in computer-based image understanding. It can be applied in two ways. First, it is a general technique for deter-mining surface orientation at each image point. Second, it is a technique for determining object points that have a particular surface orientation. These applications are illustrated using synthesized examples."
            },
            "slug": "Photometric-method-for-determining-surface-from-Woodham",
            "title": {
                "fragments": [],
                "text": "Photometric method for determining surface orientation from multiple images"
            },
            "tldr": {
                "abstractSimilarityScore": 78,
                "text": "The idea of photometric stereo is to vary the direction of incident illumination between successive images, while holding the viewing direction constant, and it is shown that this provides sufficient information to determine surface orientation at each image point."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1980
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2369829"
                        ],
                        "name": "K. Torrance",
                        "slug": "K.-Torrance",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Torrance",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Torrance"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2486939"
                        ],
                        "name": "E. Sparrow",
                        "slug": "E.-Sparrow",
                        "structuredName": {
                            "firstName": "Ephraim",
                            "lastName": "Sparrow",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Sparrow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 51991162,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "c80820bfb0c5e02afe96d31cf29f8299cdb57849",
            "isKey": false,
            "numCitedBy": 1865,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The directional distribution of radiant flux reflected from roughened surfaces is analyzed on the basis of geometrical optics. The analytical model assumes that the surface consists of small, randomly disposed, mirror-like facets. Specular reflection from these facets plus a diffuse component due to multiple reflections and/or internal scattering are postulated as the basic mechanisms of the reflection process. The effects of shadowing and masking of facets by adjacent facets are included in the analysis. The angular distributions of reflected flux predicted by the analysis are in very good agreement with experiment for both metallic and nonmetallic surfaces. Moreover, the analysis successfully predicts the off-specular maxima in the reflection distribution which are observed experimentally and which emerge as the incidence angle increases. The model thus affords a rational explanation for the off-specular peak phenomenon in terms of mutual masking and shadowing of mirror-like, specularly reflecting surface facets."
            },
            "slug": "Theory-for-off-specular-reflection-from-roughened-Torrance-Sparrow",
            "title": {
                "fragments": [],
                "text": "Theory for off-specular reflection from roughened surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145878923"
                        ],
                        "name": "Maqbool Patel",
                        "slug": "Maqbool-Patel",
                        "structuredName": {
                            "firstName": "Maqbool",
                            "lastName": "Patel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Maqbool Patel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35175118"
                        ],
                        "name": "F. Cohen",
                        "slug": "F.-Cohen",
                        "structuredName": {
                            "firstName": "Fernand",
                            "lastName": "Cohen",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Cohen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Present algorithms for shape-fromtexture [ 14 ] ,[16],[10], texture segmentation [22],[10] and texture recognition [15] are only suitable for 2D textures, i.e."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 26757832,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8935f89a685bc950d2a40a6832e4bdbd8c6d7023",
            "isKey": false,
            "numCitedBy": 9,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of extracting the local shape information of a 3D textured surface from a single 2D image is addressed. The textured objects of interest are planar and developable surfaces that are viewed as originating by laying down a rubber planar sheet with a homogeneous parent texture on it onto the objects. The homogeneous planar parent texture is modeled by a stationary Gaussian Markov random field (GMRF). The probability density function of the projected planar parent texture is an explicit function of the parent GMRF parameters, the surface shape parameters, and the camera geometry. The surface shape parameter estimation is posed as a maximum-likelihood estimation problem. A stereo-windows concept is introduced to obtain a unique and consistent parent texture from the image data.<<ETX>>"
            },
            "slug": "Shape-from-texture-using-Markov-random-field-models-Patel-Cohen",
            "title": {
                "fragments": [],
                "text": "Shape from texture using Markov random field models and stereo-windows"
            },
            "tldr": {
                "abstractSimilarityScore": 70,
                "text": "The problem of extracting the local shape information of a 3D textured surface from a single 2D image is addressed and a stereo-windows concept is introduced to obtain a unique and consistent parent texture from the image data."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings 1992 IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2143362639"
                        ],
                        "name": "Lizhi Wang",
                        "slug": "Lizhi-Wang",
                        "structuredName": {
                            "firstName": "Lizhi",
                            "lastName": "Wang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lizhi Wang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144644545"
                        ],
                        "name": "G. Healey",
                        "slug": "G.-Healey",
                        "structuredName": {
                            "firstName": "Glenn",
                            "lastName": "Healey",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Healey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Current literature deals almost exclusively with textures due to albedo and color variations on planar surfaces (see [ 19 ],[3],[7])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 19520469,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "75a64111a7b5a62f0b2ff68bbd2187b051ef8c5f",
            "isKey": false,
            "numCitedBy": 14,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "We develop a method for recognizing color texture independent of rotation, scale, and illumination. Color texture is modeled using spatial correlation functions defined within and between sensor bands. Using a linear model for surface spectral reflectance with the same number of parameters as the number of sensor classes, we show that illumination and geometry changes in the scene correspond to a linear transformation of the correlation functions and a linear transformation of their coordinates. A several step algorithm which includes scale estimation and correlation moment computation is used to achieve the invariance. The key to the method is the new result that illumination and geometry changes in the scene correspond to a specific transformation of correlation function Zernike moment matrices. These matrices can be estimated from a color image. This relationship is used to derive an efficient algorithm for recognition. The algorithm is substantiated using classification results on over 200 images of color textures obtained under various illumination conditions and geometric configurations."
            },
            "slug": "Illumination-and-geometry-invariant-recognition-of-Wang-Healey",
            "title": {
                "fragments": [],
                "text": "Illumination and geometry invariant recognition of texture in color images"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A several step algorithm which includes scale estimation and correlation moment computation is used to achieve the invariance that illumination and geometry changes in the scene correspond to a specific transformation of correlation function Zernike moment matrices."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings CVPR IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107094422"
                        ],
                        "name": "Z. Xie",
                        "slug": "Z.-Xie",
                        "structuredName": {
                            "firstName": "Z.",
                            "lastName": "Xie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Z. Xie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144431498"
                        ],
                        "name": "M. Brady",
                        "slug": "M.-Brady",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Brady",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Brady"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 29357945,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6d50e2bca57d22770d2fd632d55757f66e73c33d",
            "isKey": false,
            "numCitedBy": 20,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Wavelet transforms are attracting increasing interest in computer vision because they provide a mathematical tool for multiscale image analysis. In this paper, we show that i) the subsampled wavelet multiresolution representation is translationally variant; and ii) a wavelet transform of a signal generally confounds the phase component of the analysing wavelet associated with that scale and orientation. The importance of this observation is that commonly used features in texture analysis also depend on this phase component. This not only causes unnecessary spatial variation of features at each scale but also makes it more difficult to match features across scales."
            },
            "slug": "Texture-Segmentation-Using-Local-Energy-in-Wavelet-Xie-Brady",
            "title": {
                "fragments": [],
                "text": "Texture Segmentation Using Local Energy in Wavelet Scale Space"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "It is shown that i) the subsampled wavelet multiresolution representation is translationally variant; and ii) a wavelet transform of a signal generally confounds the phase component of the analysing wavelet associated with that scale and orientation."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2121368"
                        ],
                        "name": "M. Stavridi",
                        "slug": "M.-Stavridi",
                        "structuredName": {
                            "firstName": "Marigo",
                            "lastName": "Stavridi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Stavridi"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Although BRDF models have been widely discussed and used in vision (sec [11],[17],[20],[ 8 ],[13]) the BRDFs of a"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [],
                        "text": "Specifically, the measurements are fit to two existing analytical representations: the Oren-Nayar model [13] for surfaces with isotropic roughness and the Koenderink et al. decomposition [ 8 ] for both anisotropic and isotropic surfaces."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 42971411,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8fa5e89d6bfd9feb61b4b04d32a4754c64a3b2b4",
            "isKey": false,
            "numCitedBy": 126,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "In many applications one needs a concise description of the Bidirectional Reflection Distribution Function (BRDF) of real materials. Because the BRDF depends on two independent directions (thus has four degrees of freedom) one typically has only a relatively sparse set of observations. In order to be able to interpolate these sparse data in a convenient and principled manner a series development in terms of an orthonormal basis is required. The elements of the basis should be ordered with respect to angular resolution. Moreover, the basis should automatically respect the inherent symmetries of the physics, i.e., Helmholtz's reciprocity and (most often) surface isotropy. We indicate how to construct a set of orthonormal polynomials on the Cartesian product of the hemisphere with itself with the required symmetry and invariance properties. These “surface scattering modes” form a convenient basis for the description of BRDF's."
            },
            "slug": "Bidirectional-Reflection-Distribution-Function-in-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Bidirectional Reflection Distribution Function Expressed in Terms of Surface Scattering Modes"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work indicates how to construct a set of orthonormal polynomials on the Cartesian product of the hemisphere with itself with the required symmetry and invariance properties."
            },
            "venue": {
                "fragments": [],
                "text": "ECCV"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3221174"
                        ],
                        "name": "B. Super",
                        "slug": "B.-Super",
                        "structuredName": {
                            "firstName": "Boaz",
                            "lastName": "Super",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Super"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1747569"
                        ],
                        "name": "A. Bovik",
                        "slug": "A.-Bovik",
                        "structuredName": {
                            "firstName": "Alan",
                            "lastName": "Bovik",
                            "middleNames": [
                                "Conrad"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bovik"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6928355,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "e7650ef03c6fe9938ae57af9960a29887a527352",
            "isKey": false,
            "numCitedBy": 165,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Presents a non-feature-based solution to the problem of computing the shape of curved surfaces from texture information. First, the use of local spatial-frequency spectra and their moments to describe texture is discussed and motivated. A new, more accurate method for measuring the local spatial-frequency moments of an image texture using Gabor elementary functions and their derivatives is presented. Also described is a technique for separating shading from texture information, which makes the shape-from-texture algorithm robust to the shading effects found in real imagery. Second, a detailed model for the projection of local spectra and spectral moments of any surface reflectance patterns (not just textures) is developed. Third, the conditions under which the projection model can be solved for the orientation of the surface at each point are explored. Unlike earlier non-feature-based, curved surface shape-from-texture approaches, the assumption that the surface texture is isotropic is not required; surface texture homogeneity can be assumed instead. The algorithm's ability to operate on anisotropic and nondeterministic textures, and on both smooth- and rough-textured surfaces, is demonstrated. >"
            },
            "slug": "Shape-from-Texture-Using-Local-Spectral-Moments-Super-Bovik",
            "title": {
                "fragments": [],
                "text": "Shape from Texture Using Local Spectral Moments"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "Unlike earlier non-feature-based, curved surface shape-from-texture approaches, the assumption that the surface texture is isotropic is not required; surface texture homogeneity can be assumed instead."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32583901"
                        ],
                        "name": "R. Kashyap",
                        "slug": "R.-Kashyap",
                        "structuredName": {
                            "firstName": "Rangasami",
                            "lastName": "Kashyap",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Kashyap"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Current literature deals almost exclusively with textures due to albedo and color variations on planar surfaces (see [19],[3],[ 7 ])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 46507162,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "60e3e8fe3a0e8e804362b41e935325886f70a902",
            "isKey": false,
            "numCitedBy": 103,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "A class of finite-order two-dimensional autoregressive moving average (ARMA) is introduced that can represent any process with rational spectral density. In this model the driving noise is correlated and need not be Gaussian. Currently known classes of ARMA models or AR models are shown to be subsets of the above class. The three definitions of Markov property are discussed, and the class of ARMA models are precisely stated which have the noncausal and semicausal Markov property without imposing any specific boundary conditions. Next two approaches are considered to estimate the parameters of a model to fit a given image. The first method uses only the empirical correlations and involves the solution of linear equations. The second method is the likelihood approach. Since the exact likelihood function is difficult to compute, we resort to approximations suggested by the toroidal models. Numerical experiments compare the quality of the two estimation schemes. Finally the problem of synthesizing a texture obeying an ARMA model is considered."
            },
            "slug": "Characterization-and-estimation-of-two-dimensional-Kashyap",
            "title": {
                "fragments": [],
                "text": "Characterization and estimation of two-dimensional ARMA models"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "A class of finite-order two-dimensional autoregressive moving average (ARMA) is introduced that can represent any process with rational spectral density and has the noncausal and semicausal Markov property without imposing any specific boundary conditions."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Inf. Theory"
            },
            "year": 1984
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719389"
                        ],
                        "name": "Rosalind W. Picard",
                        "slug": "Rosalind-W.-Picard",
                        "structuredName": {
                            "firstName": "Rosalind",
                            "lastName": "Picard",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rosalind W. Picard"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "13687267"
                        ],
                        "name": "Tanweer Kabir",
                        "slug": "Tanweer-Kabir",
                        "structuredName": {
                            "firstName": "Tanweer",
                            "lastName": "Kabir",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tanweer Kabir"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2170732251"
                        ],
                        "name": "Fang Liu",
                        "slug": "Fang-Liu",
                        "structuredName": {
                            "firstName": "Fang",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fang Liu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Present algorithms for shape-fromtexture [14] ,[16],[10], texture segmentation [22],[10] and texture recognition [ 15 ] are only suitable for 2D textures, i.e."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 6884754,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2cdfb65cb9d565f831fe11d048c8958c2c5e40f4",
            "isKey": false,
            "numCitedBy": 149,
            "numCiting": 5,
            "paperAbstract": {
                "fragments": [],
                "text": "The Brodatz Album has become the de facto standard for evaluating texture algorithms, with hundreds of studies having been applied to small sets of its images. The authors compare two powerful recognition algorithms, principal components analysis and multiscale autoregressive models, by evaluating them on a 999-image database derived from the entire Brodatz Album. The variety of homogeneous and nonhomogeneous images studied is thus nearly an order of magnitude larger than has been compared before, giving one snapshot of the state of the art in real-time texture recognition.<<ETX>>"
            },
            "slug": "Real-time-recognition-with-the-entire-Brodatz-Picard-Kabir",
            "title": {
                "fragments": [],
                "text": "Real-time recognition with the entire Brodatz texture database"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The authors compare two powerful recognition algorithms, principal components analysis and multiscale autoregressive models, by evaluating them on a 999-image database derived from the entire Brodatz Album, giving one snapshot of the state of the art in real-time texture recognition."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750470"
                        ],
                        "name": "S. Nayar",
                        "slug": "S.-Nayar",
                        "structuredName": {
                            "firstName": "Shree",
                            "lastName": "Nayar",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Nayar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739452"
                        ],
                        "name": "K. Ikeuchi",
                        "slug": "K.-Ikeuchi",
                        "structuredName": {
                            "firstName": "Katsushi",
                            "lastName": "Ikeuchi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Ikeuchi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1733113"
                        ],
                        "name": "T. Kanade",
                        "slug": "T.-Kanade",
                        "structuredName": {
                            "firstName": "Takeo",
                            "lastName": "Kanade",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Kanade"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18592894,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "64b6cd6a6351e82a9995899220f52b93af881476",
            "isKey": false,
            "numCitedBy": 745,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Reflectance models based on physical optics and geometrical optics are studied. Specifically, the authors consider the Beckmann-Spizzichino (physical optics) model and the Torrance-Sparrow (geometrical optics) model. These two models were chosen because they have been reported to fit experimental data well. Each model is described in detail, and the conditions that determine the validity of the model are clearly stated. By studying reflectance curves predicted by the two models, the authors propose a reflectance framework comprising three components: the diffuse lobe, the specular lobe, and the specular spike. The effects of surface roughness on the three primary components are analyzed in detail. >"
            },
            "slug": "Surface-Reflection:-Physical-and-Geometrical-Nayar-Ikeuchi",
            "title": {
                "fragments": [],
                "text": "Surface Reflection: Physical and Geometrical Perspectives"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "Reflectance models based on physical optics and geometrical optics are studied and a reflectance framework comprising three components is proposed: the diffuse lobe, the specular lobe, andThe specular spike is proposed."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Pattern Anal. Mach. Intell."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2951740"
                        ],
                        "name": "Bui Tuong Phong",
                        "slug": "Bui-Tuong-Phong",
                        "structuredName": {
                            "firstName": "Bui",
                            "lastName": "Phong",
                            "middleNames": [
                                "Tuong"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bui Tuong Phong"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1439868,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "90189b948a37477938a8d83d81b6737f930d7997",
            "isKey": false,
            "numCitedBy": 3306,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "The quality of computer generated images of three-dimensional scenes depends on the shading technique used to paint the objects on the cathode-ray tube screen. The shading algorithm itself depends in part on the method for modeling the object, which also determines the hidden surface algorithm. The various methods of object modeling, shading, and hidden surface removal are thus strongly interconnected. Several shading techniques corresponding to different methods of object modeling and the related hidden surface algorithms are presented here. Human visual perception and the fundamental laws of optics are considered in the development of a shading rule that provides better quality and increased realism in generated images."
            },
            "slug": "Illumination-for-computer-generated-pictures-Phong",
            "title": {
                "fragments": [],
                "text": "Illumination for computer generated pictures"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Human visual perception and the fundamental laws of optics are considered in the development of a shading rule that provides better quality and increased realism in generated images."
            },
            "venue": {
                "fragments": [],
                "text": "Commun. ACM"
            },
            "year": 1975
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2061525227"
                        ],
                        "name": "J. Krumm",
                        "slug": "J.-Krumm",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Krumm",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Krumm"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "12290634"
                        ],
                        "name": "S. Shafer",
                        "slug": "S.-Shafer",
                        "structuredName": {
                            "firstName": "Steven",
                            "lastName": "Shafer",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shafer"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2441315,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b0987bce2f5fdf1c1e1909a8a17b7e830324c08c",
            "isKey": false,
            "numCitedBy": 38,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "Uniformly textured surfaces in 3D scenes provide important cues for image understanding. Texture can be used for both segmentation and for 3D shape inference. Unfortunately, virtually all current algorithms are based on assumptions that make it impossible to do texture segmentation and shape-from-texture in the same image. Texture segmentation algorithms rely on an absence of 3D effects that tend to distort the texture. Shape-from-texture algorithms depend on these effects, relying instead on the texture being already segmented. To really understand texture in images, texture segmentation and shape-from-texture must be viewed as a combined problem to be solved simultaneously. We present a solution to this problem with a region-growing algorithm that explicitly accounts for perspective distortions of otherwise uniform texture. We use the image spectrogram to compute local surface normals, which are in turn used to \"frontalize\" the texture. These frontalized texture patches are then subjected to a region-growing algorithm based on similarity in the local frequency domain and a minimum description length criteria. We show results of our algorithm on real texture images taken in the lab and outdoors.<<ETX>>"
            },
            "slug": "Texture-segmentation-and-shape-in-the-same-image-Krumm-Shafer",
            "title": {
                "fragments": [],
                "text": "Texture segmentation and shape in the same image"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work uses the image spectrogram to compute local surface normals, which are in turn used to \"frontalize\" the texture, which is subjected to a region-growing algorithm based on similarity in the local frequency domain and a minimum description length criteria."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE International Conference on Computer Vision"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2156356502"
                        ],
                        "name": "SK Nayar",
                        "slug": "SK-Nayar",
                        "structuredName": {
                            "firstName": "SK",
                            "lastName": "Nayar",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "SK Nayar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145328018"
                        ],
                        "name": "M. Oren",
                        "slug": "M.-Oren",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Oren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Oren"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The rendered spheres of plaster (Sample 30) and roofing shingle (Sample 32) show a fairly flat appearance which is quite different from the Lambertian prediction for such matte objects, but is consistent with [ 12 ] and [13]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 5611174,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "4adc3e505f4877ac8fea80dc96eca20d981e3179",
            "isKey": false,
            "numCitedBy": 79,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "All visual sensors, biological and artificial, are finite in resolution by necessity. As a result, the effective reflectance of surfaces in a scene varies with magnification. A reflectance model for matte surfaces is described that incorporates the effect of macroscopic surface undulations on image brightness. The model takes into account complex physical phenomena such as masking, shadowing, and interreflections between points on the surface, and it predicts the appearance of a wide range of natural surfaces. The implications of these results for human vision, machine vision, and computer graphics are demonstrated with both real and rendered images of three-dimensional objects. In particular, objects with extremely rough surfaces produce silhouette images devoid of shading, precluding visual perception of the object's shape."
            },
            "slug": "Visual-appearance-of-matte-surfaces-Nayar-Oren",
            "title": {
                "fragments": [],
                "text": "Visual appearance of matte surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A reflectance model for matte surfaces is described that incorporates the effect of macroscopic surface undulations on image brightness and takes into account complex physical phenomena such as masking, shadowing, and interreflections between points on the surface."
            },
            "venue": {
                "fragments": [],
                "text": "Science"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2369829"
                        ],
                        "name": "K. Torrance",
                        "slug": "K.-Torrance",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Torrance",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Torrance"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2486939"
                        ],
                        "name": "E. Sparrow",
                        "slug": "E.-Sparrow",
                        "structuredName": {
                            "firstName": "Ephraim",
                            "lastName": "Sparrow",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Sparrow"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 51991162,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "c80820bfb0c5e02afe96d31cf29f8299cdb57849",
            "isKey": false,
            "numCitedBy": 1865,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "The directional distribution of radiant flux reflected from roughened surfaces is analyzed on the basis of geometrical optics. The analytical model assumes that the surface consists of small, randomly disposed, mirror-like facets. Specular reflection from these facets plus a diffuse component due to multiple reflections and/or internal scattering are postulated as the basic mechanisms of the reflection process. The effects of shadowing and masking of facets by adjacent facets are included in the analysis. The angular distributions of reflected flux predicted by the analysis are in very good agreement with experiment for both metallic and nonmetallic surfaces. Moreover, the analysis successfully predicts the off-specular maxima in the reflection distribution which are observed experimentally and which emerge as the incidence angle increases. The model thus affords a rational explanation for the off-specular peak phenomenon in terms of mutual masking and shadowing of mirror-like, specularly reflecting surface facets."
            },
            "slug": "Theory-for-off-specular-reflection-from-roughened-Torrance-Sparrow",
            "title": {
                "fragments": [],
                "text": "Theory for off-specular reflection from roughened surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16964060"
                        ],
                        "name": "F. E. Nicodemus",
                        "slug": "F.-E.-Nicodemus",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Nicodemus",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. E. Nicodemus"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10983620,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "7241f6068e27964706c9031df3637429c6aee60b",
            "isKey": false,
            "numCitedBy": 359,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Reflectance-nomenclature-and-directional-and-Nicodemus",
            "title": {
                "fragments": [],
                "text": "Reflectance nomenclature and directional reflectance and emissivity."
            },
            "venue": {
                "fragments": [],
                "text": "Applied optics"
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2307214"
                        ],
                        "name": "K. Perlin",
                        "slug": "K.-Perlin",
                        "structuredName": {
                            "firstName": "Ken",
                            "lastName": "Perlin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. Perlin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Another method of rendering surface texture is solid texturing [36],[38],[37],[19],[41] which combines a volumetric texture synthesis with volume rendering techniques."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 207669324,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e04d7772b91a83a901408eb0876bbb7814b1d4b5",
            "isKey": false,
            "numCitedBy": 991,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "We introduce the concept of a Pixel Stream Editor. This forms the basis for an interactive synthesizer for designing highly realistic Computer Generated Imagery. The designer works in an interactive Very High Level programming environment which provides a very fast concept/implement/view iteration cycle.Naturalistic visual complexity is built up by composition of non-linear functions, as opposed to the more conventional texture mapping or growth model algorithms. Powerful primitives are included for creating controlled stochastic effects. We introduce the concept of \"solid texture\" to the field of CGI.We have used this system to create very convincing representations of clouds, fire, water, stars, marble, wood, rock, soap films and crystal. The algorithms created with this paradigm are generally extremely fast, highly realistic, and asynchronously parallelizable at the pixel level."
            },
            "slug": "An-image-synthesizer-Perlin",
            "title": {
                "fragments": [],
                "text": "An image synthesizer"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The concept of \"solid texture\" to the field of CGI is introduced and used to create very convincing representations of clouds, fire, water, stars, marble, wood, rock, soap films and crystal."
            },
            "venue": {
                "fragments": [],
                "text": "SIGGRAPH '85"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A diffuse reflectance model for smooth dielectrics"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America A -Special Issue on Physics Based Machine Vision"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Proceedings of SIGGRAPH"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of SIGGRAPH"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Standard E 1392 - 90 , Standard practice for angle resolved optical scatter measurements on specular or diffuse surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Continuous shading of curves surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Comput"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 68
                            }
                        ],
                        "text": "Another method of rendering surface texture is solid texturing [36],[38],[37],[19],[41] which combines a volumetric texture synthesis with volume rendering techniques."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hypertexture"
            },
            "venue": {
                "fragments": [],
                "text": "Computer Graphics, Vol. 23, No. 3, pp. 253-262, July 1989."
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 124,
                                "start": 115
                            }
                        ],
                        "text": "The type of light sources varies from \nsystem to system and is often either a halogen source [Stavridi et al. 1997; Ward 1992] or a laser source \n[Marx and Vorburger 1989]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 117,
                                "start": 108
                            }
                        ],
                        "text": "In most cases the detector is some type of photometer, but in some apparatus, \nthe detector is a CCD camera [Ward 1992; Karner et al. 1996]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 148,
                                "start": 139
                            }
                        ],
                        "text": "One system allows the simultaneous capture \nof the hemisphere of scatter­ing directions by using a hemispherical mirror and a fish-eye lens [Ward \n1992]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Measuring and Modeling Anisotropic Reeection"
            },
            "venue": {
                "fragments": [],
                "text": "Computer Graphics"
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Received August"
            },
            "venue": {
                "fragments": [],
                "text": "Received August"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Solid texturing of complex surfaces An image synthesizer"
            },
            "venue": {
                "fragments": [],
                "text": "Computer Graphics"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Continuous shading of curves surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. on Computers"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Classiication of Natural Textures using Gaussian Markov Random Fields Markov Random Fields: Theory and Applications"
            },
            "venue": {
                "fragments": [],
                "text": "\\Classiication of Natural Textures using Gaussian Markov Random Fields Markov Random Fields: Theory and Applications"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Texturing of Complex Surfaces Proceedings of SIGGRAPH"
            },
            "venue": {
                "fragments": [],
                "text": "Computer Graphics"
            },
            "year": 1985
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Correction factors for each sample. The left column of each table has the image number and the right column has the correction factor"
            },
            "venue": {
                "fragments": [],
                "text": "Table"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Standard practice for angle resolved optical scatter measurements on specular or diffuse surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "ASTM. Standard E1392-90"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Theory for oospecular reeection from roughened surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Classification of natural textures using Gaussian Markov random fields"
            },
            "venue": {
                "fragments": [],
                "text": "Markov Random Fields: Theory and Applications"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A diffuse reflectance model for smooth dielectrics"
            },
            "venue": {
                "fragments": [],
                "text": "J. Opt. Soc. Am. A—Special Issue on Physics Based Machine Vision"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Classification of natural textures using Gaussian Markov random fields Markov Random Fields: Theory and Applications"
            },
            "venue": {
                "fragments": [],
                "text": "Classification of natural textures using Gaussian Markov random fields Markov Random Fields: Theory and Applications"
            },
            "year": 1975
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Hypertexture. Comput. Graph"
            },
            "venue": {
                "fragments": [],
                "text": "Hypertexture. Comput. Graph"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Standard practice for angle resolved optical scatter measurements on specular or diffuse surfaces American Society for Testing and Ma- terials"
            },
            "venue": {
                "fragments": [],
                "text": "Standard practice for angle resolved optical scatter measurements on specular or diffuse surfaces American Society for Testing and Ma- terials"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Solid texturing of complex surfaces An image synthesizer"
            },
            "venue": {
                "fragments": [],
                "text": "Computer Graphics"
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\A Framework for the Construction of Reeectance Maps for Machine Vision CVGIP: Image Understanding, V ol"
            },
            "venue": {
                "fragments": [],
                "text": "\\A Framework for the Construction of Reeectance Maps for Machine Vision CVGIP: Image Understanding, V ol"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 14
                            }
                        ],
                        "text": "(2)Please see Chatterjee [1993], Kashyap [1984], Krumm and Shafer [1995], Patel and Cohen [1992], Super and Bovik [1995], Wang and Healey [1996], and Xie and Brady [1996]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Classification of natural textures using Gaussian Markov random fields"
            },
            "venue": {
                "fragments": [],
                "text": "Markov Random Fields: Theory and Applications, Academic Press, Boston, 159–177."
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\A Diiuse Reeectance Model for Smooth Dielectrics"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America A -S p ecial Issue on Physics Based Machine Vision"
            },
            "year": 1994
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Gouraud , “ Continous shading of curves surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "“ Classification of natural textures using Gaussian Markov random fields , ” Markov Random Fields : Theory and Applications"
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Theory for OO-Specular Reeection from Roughened Surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "Journal of the Optical Society of America"
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Continous shading of curves surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. on Computers"
            },
            "year": 1971
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "\\Classiication of natural textures using Gaussian Markov random elds Markov Random Fields: Theory and Applications"
            },
            "venue": {
                "fragments": [],
                "text": "\\Classiication of natural textures using Gaussian Markov random elds Markov Random Fields: Theory and Applications"
            },
            "year": 1993
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 18,
            "methodology": 13,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 96,
        "totalPages": 10
    },
    "page_url": "https://www.semanticscholar.org/paper/Reflectance-and-texture-of-real-world-surfaces-Dana-Ginneken/8a07de049e417cc61442d8c1ecc576155f6777a8?sort=total-citations"
}