{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9171912"
                        ],
                        "name": "Sarvesh S. Chakradeo",
                        "slug": "Sarvesh-S.-Chakradeo",
                        "structuredName": {
                            "firstName": "Sarvesh",
                            "lastName": "Chakradeo",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Sarvesh S. Chakradeo"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9299506"
                        ],
                        "name": "Aishwarya S. Hendre",
                        "slug": "Aishwarya-S.-Hendre",
                        "structuredName": {
                            "firstName": "Aishwarya",
                            "lastName": "Hendre",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Aishwarya S. Hendre"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47981385"
                        ],
                        "name": "Shantanu U. Deshpande",
                        "slug": "Shantanu-U.-Deshpande",
                        "structuredName": {
                            "firstName": "Shantanu",
                            "lastName": "Deshpande",
                            "middleNames": [
                                "U."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shantanu U. Deshpande"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 17949970,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a415635a3d0b67867b4128dada9d9d110df83e8c",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 19,
            "paperAbstract": {
                "fragments": [],
                "text": "This study proposes to generalize the hybridization of evolutionary algorithm for solving large dimensional continuous global optimization problems. Inspired by various dual hybridizations being used, this paper proposes hybrid evolutionary algorithms based on crossing over the FFA, PSO, BAT, ACO and GA algorithms. The main idea of the proposed method is to integrate the aforementioned algorithms by following best solutions of other algorithm using roulette wheel approach. The aim of the proposed hybrid algorithm was to enable problem solving using two or more Evolutionary Algorithms as is, without modification, besides effectively exploring and exploiting of the problem search space. Simulations for a series of benchmark test functions justify that an adroit hybridization of various evolutionary algorithms could yield a robust and efficient means of solving wide range of global optimization problems than the standalone evolutionary algorithms."
            },
            "slug": "Generalized-theory-for-hybridization-of-algorithms-Chakradeo-Hendre",
            "title": {
                "fragments": [],
                "text": "Generalized theory for hybridization of evolutionary algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 56,
                "text": "Simulations for a series of benchmark test functions justify that an adroit hybridization of various evolutionary algorithms could yield a robust and efficient means of solving wide range of global optimization problems than the standalone evolutionary algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "2014 IEEE International Conference on Computational Intelligence and Computing Research"
            },
            "year": 2014
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37569770"
                        ],
                        "name": "Xinjie Yu",
                        "slug": "Xinjie-Yu",
                        "structuredName": {
                            "firstName": "Xinjie",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xinjie Yu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1650410,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "15d1a9d555c193bef38f028c61638434b8b2c261",
            "isKey": false,
            "numCitedBy": 290,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Some interesting features of the new book “Introduction to Evolutionary Algorithms”, which is written by Xinjie Yu and Mitsuo Gen and be published by Springer in 2010, will be illustrated, including covering nearly all the hot evolutionary-computation-related topics, referring to the latest published journal papers, introducing the applications of EAs as many as possible, and adopting many pedagogical ways to make EAs easy and interesting. The contents and the consideration of selecting these contents will be discussed. Then the focus will be put on the pedagogical ways for teaching and self-study. The algorithms introduced in the tutorial include constrained optimization evolutionary algorithms (COEA), multiobjective evolutionary algorithms (MOEA), ant colony optimization (ACO), particle swarm optimization (PSO), and artificial immune systems (AIS). Some of the applications of these evolutionary algorithms will be discussed."
            },
            "slug": "Introduction-to-evolutionary-algorithms-Yu",
            "title": {
                "fragments": [],
                "text": "Introduction to evolutionary algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 99,
                "text": "Some interesting features of the new book “Introduction to Evolutionary Algorithms”, which is written by Xinjie Yu and Mitsuo Gen and be published by Springer in 2010, will be illustrated, including covering nearly all the hot evolutionary-computation-related topics, referring to the latest published journal papers, and introducing the applications of EAs as many as possible."
            },
            "venue": {
                "fragments": [],
                "text": "The 40th International Conference on Computers & Indutrial Engineering"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143901532"
                        ],
                        "name": "X. Yao",
                        "slug": "X.-Yao",
                        "structuredName": {
                            "firstName": "Xin",
                            "lastName": "Yao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Yao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152891866"
                        ],
                        "name": "Yong Liu",
                        "slug": "Yong-Liu",
                        "structuredName": {
                            "firstName": "Yong",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yong Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2342413"
                        ],
                        "name": "Guangming Lin",
                        "slug": "Guangming-Lin",
                        "structuredName": {
                            "firstName": "Guangming",
                            "lastName": "Lin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Guangming Lin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15370058,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d437d9222472afc281145254dbb17a45f6786719",
            "isKey": false,
            "numCitedBy": 3178,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "Evolutionary programming (EP) has been applied with success to many numerical and combinatorial optimization problems in recent years. EP has rather slow convergence rates, however, on some function optimization problems. In the paper, a \"fast EP\" (FEP) is proposed which uses a Cauchy instead of Gaussian mutation as the primary search operator. The relationship between FEP and classical EP (CEP) is similar to that between fast simulated annealing and the classical version. Both analytical and empirical studies have been carried out to evaluate the performance of FEP and CEP for different function optimization problems. The paper shows that FEP is very good at search in a large neighborhood while CEP is better at search in a small local neighborhood. For a suite of 23 benchmark problems, FEP performs much better than CEP for multimodal functions with many local minima while being comparable to CEP in performance for unimodal and multimodal functions with only a few local minima. The paper also shows the relationship between the search step size and the probability of finding a global optimum and thus explains why FEP performs better than CEP on some functions but not on others. In addition, the importance of the neighborhood size and its relationship to the probability of finding a near-optimum is investigated. Based on these analyses, an improved FEP (IFEP) is proposed and tested empirically. This technique mixes different search operators (mutations). The experimental results show that IFEP performs better than or as well as the better of FEP and CEP for most benchmark problems tested."
            },
            "slug": "Evolutionary-programming-made-faster-Yao-Liu",
            "title": {
                "fragments": [],
                "text": "Evolutionary programming made faster"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A \"fast EP\" (FEP) is proposed which uses a Cauchy instead of Gaussian mutation as the primary search operator and is proposed and tested empirically, showing that IFEP performs better than or as well as the better of FEP and CEP for most benchmark problems tested."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Evol. Comput."
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3247745"
                        ],
                        "name": "Thomas Bäck",
                        "slug": "Thomas-Bäck",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Bäck",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Thomas Bäck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15421575"
                        ],
                        "name": "Joshua D. Knowles",
                        "slug": "Joshua-D.-Knowles",
                        "structuredName": {
                            "firstName": "Joshua",
                            "lastName": "Knowles",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Joshua D. Knowles"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2742958"
                        ],
                        "name": "O. M. Shir",
                        "slug": "O.-M.-Shir",
                        "structuredName": {
                            "firstName": "Ofer",
                            "lastName": "Shir",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. M. Shir"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 6348425,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "359560fb724e06f92e1f9e368e8997e19b8d7688",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 2,
            "paperAbstract": {
                "fragments": [],
                "text": "This tutorial addresses applications of evolutionary algorithms to optimization tasks where the function evaluation cannot be done through a computer simulation, but requires the execution of an experiment in the real world (i.e., cosmetics, detergents, wind tunnel experiments, taste experiments, to mention a few).The use of EAs for experimental optimization is placed in its historical context with an overview of the landmark studies in this area carried out in the 1960s at the Technical University of Berlin. Statistical design of experiments (DoE) methods from the late 50s are also reviewed, and it is shown how relatives of these approaches are converging in modern sequential DoE/EA hybrid methods.The main characteristics of experimental optimization work, in comparison to optimization of simulated systems, are discussed, and practical guidelines for real-world experiments with EAs are given. For example, experimental problems can constrain the evolution due to overhead considerations, interruptions, changes of variables, and population sizes that are determined by the experimental platform.A series of modern-day case studies shows the persistence of experimental optimization problems today. These cover experimental quantum control, real DNA and RNA evolution, combinatorial drug discovery, coffee and chocolate processing, and others. These applications can push EA methods outside of their normal operating envelope, and raise research questions in a number of different areas ranging across constrained EAs, multiobjective EAs, robust and reliable methods for noisy problems, and metamodeling methods for expensive cost functions."
            },
            "slug": "Experimental-optimization-by-evolutionary-Bäck-Knowles",
            "title": {
                "fragments": [],
                "text": "Experimental optimization by evolutionary algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This tutorial addresses applications of evolutionary algorithms to optimization tasks where the function evaluation cannot be done through a computer simulation, but requires the execution of an experiment in the real world (i.e., cosmetics, detergents, wind tunnel experiments, taste experiments, to mention a few)."
            },
            "venue": {
                "fragments": [],
                "text": "GECCO '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1406760771"
                        ],
                        "name": "Nada M. A. AL-Salami",
                        "slug": "Nada-M.-A.-AL-Salami",
                        "structuredName": {
                            "firstName": "Nada",
                            "lastName": "AL-Salami",
                            "middleNames": [
                                "M.",
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nada M. A. AL-Salami"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17724198,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "97f2936e273c9fa4a406e2bf4e34e63977f9bc1d",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Problem statement: Most resent evolutionary algorithms work under weak theoretical basis and thus, they are computationally expensive. Approach: This study discussed the use of new evolutionary algorithm for automatic programming, based on theoretical definitions of program behaviors. Evolutionary process adapted fixed and self-organized input-output specification of the problem, to evolve good finite state machine that efficiently satisfies these specifications. Results: The proposed algorithm enhanced evolutionary process by simultaneously solving multi-parts from the same problem. Conclusion: The probability that the algorithm will converge to the optimal solution was highly enhanced when decomposing the main problem into multi-part."
            },
            "slug": "Evolutionary-Algorithm-Definition-AL-Salami",
            "title": {
                "fragments": [],
                "text": "Evolutionary Algorithm Definition"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This study discussed the use of new evolutionary algorithm for automatic programming, based on theoretical definitions of program behaviors, which enhanced evolutionary process by simultaneously solving multi-parts from the same problem."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2236789"
                        ],
                        "name": "Yujiao Zeng",
                        "slug": "Yujiao-Zeng",
                        "structuredName": {
                            "firstName": "Yujiao",
                            "lastName": "Zeng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yujiao Zeng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2961523"
                        ],
                        "name": "Yanguang Sun",
                        "slug": "Yanguang-Sun",
                        "structuredName": {
                            "firstName": "Yanguang",
                            "lastName": "Sun",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yanguang Sun"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 54
                            }
                        ],
                        "text": "8 Multi-objective Particle Swarm Optimization (MOPSO) [18] Given multi-objective functions to solve optimization problem"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 926,
                                "start": 921
                            }
                        ],
                        "text": "No EA Technique Description\n1 Genetic Swarm Optimization (GSO) [14]\nCombines GA and PSO to solve electromagnetic problem\n2 Hybrid PSO [14] It reduces probability of trapping local optima using Cauchy mutation for PSO\n3 Self-adaptive differential evolution (SaDE) [15]\nIt adaptively search for suitable strategy and associated parameter setting\n4 Immune self-adaptive differential evolution (ISDE) [15]\nScale and crossover factors of DE are adaptively modified by information process mechanism of biological immune system\n5 Multi-objective Evolutionary algorithm (MOEAs) [16] [19]\nExtension to simple evolutionary multi-objective optimizer\n6\nMulti-objective Evolutionary algorithm based on decomposition (MOEA/D) [17]\nBased on simple evolutionary multi-objective optimizer and decomposition\n7 Dynamic multi-agent GA [17]\nIntegrates dynamic multi-agent with Genetic algorithm\n8 Multi-objective Particle Swarm Optimization (MOPSO) [18]\nGiven multi-objective functions to solve optimization problem"
                    },
                    "intents": []
                }
            ],
            "corpusId": 22581159,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "94460ff562208a428cec9f296461409bddf3536f",
            "isKey": false,
            "numCitedBy": 19,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "The optimal reactive power dispatch (ORPD) problem is formulated as a complex multiobjective optimization problem, involving nonlinear functions, continuous and discrete variables and various constraints. Recently, multiobjective evolutionary algorithms (MOEAs) and multiobjective particle swarm optimization (MOPSO) have received a growing interest in solving the multiobjective optimization problems. In this paper, MOPSO, and two highly competitive algorithms of MOEAs, that is, nondominated sorting genetic algorithm II (NSGA-II) and strength Pareto evolutionary algorithm (SPEA2) are presented for solving the ORPD problem. Moreover, a mixed-variable handling method and an effective constraint handling approach are employed to deal with various types of variables and constraints. The proposed algorithms are evaluated on the standard IEEE 30-bus and 118-bus test systems. In addition, several multiobjective performance metrics are employed to compare these algorithms with respect to convergence, diversity, and computational efficiency. The results show the effectiveness of MOEAs and MOPSO for solving the ORPD problem. Furthermore, the comparison results indicate that MOPSO generally outperforms other algorithms for ORPD and has a great potential in dealing with large-scale optimal power flow problems."
            },
            "slug": "Comparison-of-multiobjective-particle-swarm-and-for-Zeng-Sun",
            "title": {
                "fragments": [],
                "text": "Comparison of multiobjective particle swarm optimization and evolutionary algorithms for optimal reactive power dispatch problem"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The comparison results indicate that MOPSO generally outperforms other algorithms for ORPD and has a great potential in dealing with large-scale optimal power flow problems."
            },
            "venue": {
                "fragments": [],
                "text": "2014 IEEE Congress on Evolutionary Computation (CEC)"
            },
            "year": 2014
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1749302"
                        ],
                        "name": "Felix Streichert",
                        "slug": "Felix-Streichert",
                        "structuredName": {
                            "firstName": "Felix",
                            "lastName": "Streichert",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Felix Streichert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14560339,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5076681a60baf80ddcc3965215c85f9fd00251da",
            "isKey": false,
            "numCitedBy": 6,
            "numCiting": 69,
            "paperAbstract": {
                "fragments": [],
                "text": "Evolutionary Algorithms (EA) consist of several heuristics, which are able to solve optimisation tasks by imitating some aspects of natural evolution. They may use different levels of abstraction, but they are always working on whole populations of possible solutions for a given task. EAs are an approved set of heuristics, which are flexible to use and postulate only neglectible requirements on the optimisation task. As a practical application, technical trading rules found by the use of EA will be presented."
            },
            "slug": "Introduction-to-evolutionary-algorithms-Streichert",
            "title": {
                "fragments": [],
                "text": "Introduction to evolutionary algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 59,
                "text": "Evolutionary Algorithms are an approved set of heuristics, which are flexible to use and postulate only neglectible requirements on the optimisation task."
            },
            "venue": {
                "fragments": [],
                "text": "Evolutionary Computation 1"
            },
            "year": 2018
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144400645"
                        ],
                        "name": "Jun He",
                        "slug": "Jun-He",
                        "structuredName": {
                            "firstName": "Jun",
                            "lastName": "He",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jun He"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1727189"
                        ],
                        "name": "B. Mitavskiy",
                        "slug": "B.-Mitavskiy",
                        "structuredName": {
                            "firstName": "Boris",
                            "lastName": "Mitavskiy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Mitavskiy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "11362141"
                        ],
                        "name": "Yuren Zhou",
                        "slug": "Yuren-Zhou",
                        "structuredName": {
                            "firstName": "Yuren",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuren Zhou"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 58,
                                "start": 54
                            }
                        ],
                        "text": "5 Multi-objective Evolutionary algorithm (MOEAs) [16] [19] Extension to simple evolutionary multi-objective optimizer"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14983984,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "44c01802b3ab6c03f1d81e113ef1663ea4cf7363",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 55,
            "paperAbstract": {
                "fragments": [],
                "text": "Evolutionary algorithms are well suited for solving the knapsack problem. Some empirical studies claim that evolutionary algorithms can produce good solutions to the 0-1 knapsack problem. Nonetheless, few rigorous investigations address the quality of solutions that evolutionary algorithms may produce for the knapsack problem. This paper focuses on a theoretical investigation of three types of (N+1) evolutionary algorithms that exploit bitwise mutation, truncation selection, plus different repair methods for the 0-1 knapsack problem. It assesses the solution quality in terms of the approximation ratio. Our work indicates that the solution produced by both pure strategy and mixed strategy evolutionary algorithms is arbitrarily bad. Nevertheless, an evolutionary algorithm using helper objectives may produce 1/2-approximation solutions to the 0-1 knapsack problem."
            },
            "slug": "A-theoretical-assessment-of-solution-quality-in-for-He-Mitavskiy",
            "title": {
                "fragments": [],
                "text": "A theoretical assessment of solution quality in evolutionary algorithms for the knapsack problem"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "A theoretical investigation of three types of (N+1) evolutionary algorithms that exploit bitwise mutation, truncation selection, plus different repair methods for the 0-1 knapsack problem indicates that the solution produced by both pure strategy and mixed strategy evolutionary algorithms is arbitrarily bad."
            },
            "venue": {
                "fragments": [],
                "text": "2014 IEEE Congress on Evolutionary Computation (CEC)"
            },
            "year": 2014
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2477764"
                        ],
                        "name": "Yuan-Long Li",
                        "slug": "Yuan-Long-Li",
                        "structuredName": {
                            "firstName": "Yuan-Long",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuan-Long Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "11362141"
                        ],
                        "name": "Yuren Zhou",
                        "slug": "Yuren-Zhou",
                        "structuredName": {
                            "firstName": "Yuren",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuren Zhou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680620"
                        ],
                        "name": "Zhi-hui Zhan",
                        "slug": "Zhi-hui-Zhan",
                        "structuredName": {
                            "firstName": "Zhi-hui",
                            "lastName": "Zhan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhi-hui Zhan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "18997752"
                        ],
                        "name": "Jun Zhang",
                        "slug": "Jun-Zhang",
                        "structuredName": {
                            "firstName": "Jun",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jun Zhang"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "5 Multi-objective Evolutionary algorithm (MOEAs) [16] [19] Extension to simple evolutionary multi-objective optimizer"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 7528920,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0f028a6dbd8e204fd4d19ad13f939e77abd1c7fd",
            "isKey": false,
            "numCitedBy": 28,
            "numCiting": 69,
            "paperAbstract": {
                "fragments": [],
                "text": "Decomposition-based multiobjective evolutionary algorithms (MOEAs) have been studied a lot and have been widely and successfully used in practice. However, there are no related theoretical studies on this kind of MOEAs. In this paper, we theoretically analyze the MOEAs based on decomposition. First, we analyze the runtime complexity with two basic simple instances. In both cases the Pareto front have oneto-one map to the decomposed subproblems or not. Second, we analyze the runtime complexity on two difficult instances with bad neighborhood relations in fitness space or decision space. Our studies show that: 1) in certain cases, polynomialsized evenly distributed weight parameters-based decomposition cannot map each point in a polynomial sized Pareto front to a subproblem; 2) an ideal serialized algorithm can be very efficient on some simple instances; 3) the standard MOEA based on decomposition can benefit a runtime cut of a constant fraction from its neighborhood coevolution scheme; and 4) the standard MOEA based on decomposition performs well on difficult instances because both the Pareto domination-based and the scalar subproblem-based search schemes are combined in a proper way."
            },
            "slug": "A-Primary-Theoretical-Study-on-Decomposition-Based-Li-Zhou",
            "title": {
                "fragments": [],
                "text": "A Primary Theoretical Study on Decomposition-Based Multiobjective Evolutionary Algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The studies show that in certain cases, polynomialsized evenly distributed weight parameters-based decomposition cannot map each point in a polynomial sized Pareto front to a subproblem; an ideal serialized algorithm can be very efficient on some simple instances; the standard MOEA can benefit a runtime cut of a constant fraction from its neighborhood coevolution scheme."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Evolutionary Computation"
            },
            "year": 2016
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9481621"
                        ],
                        "name": "Chengfo Sun",
                        "slug": "Chengfo-Sun",
                        "structuredName": {
                            "firstName": "Chengfo",
                            "lastName": "Sun",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chengfo Sun"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9143092"
                        ],
                        "name": "Hai-fang Zhou",
                        "slug": "Hai-fang-Zhou",
                        "structuredName": {
                            "firstName": "Hai-fang",
                            "lastName": "Zhou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hai-fang Zhou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2109077958"
                        ],
                        "name": "Liqing Chen",
                        "slug": "Liqing-Chen",
                        "structuredName": {
                            "firstName": "Liqing",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Liqing Chen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 50,
                                "start": 46
                            }
                        ],
                        "text": "3 Self-adaptive differential evolution (SaDE) [15] It adaptively search for suitable strategy and associated parameter setting 4 Immune self-adaptive differential evolution (ISDE) [15] Scale and crossover factors of DE are adaptively modified by information process mechanism of biological immune system"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 395,
                                "start": 391
                            }
                        ],
                        "text": "No EA Technique Description\n1 Genetic Swarm Optimization (GSO) [14]\nCombines GA and PSO to solve electromagnetic problem\n2 Hybrid PSO [14] It reduces probability of trapping local optima using Cauchy mutation for PSO\n3 Self-adaptive differential evolution (SaDE) [15]\nIt adaptively search for suitable strategy and associated parameter setting\n4 Immune self-adaptive differential evolution (ISDE) [15]\nScale and crossover factors of DE are adaptively modified by information process mechanism of biological immune system\n5 Multi-objective Evolutionary algorithm (MOEAs) [16] [19]\nExtension to simple evolutionary multi-objective optimizer\n6\nMulti-objective Evolutionary algorithm based on decomposition (MOEA/D) [17]\nBased on simple evolutionary multi-objective optimizer and decomposition\n7 Dynamic multi-agent GA [17]\nIntegrates dynamic multi-agent with Genetic algorithm\n8 Multi-objective Particle Swarm Optimization (MOPSO) [18]\nGiven multi-objective functions to solve optimization problem"
                    },
                    "intents": []
                }
            ],
            "corpusId": 23681742,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "94c9e185dea8e5147a8bd7832edce3cc4f22da38",
            "isKey": false,
            "numCitedBy": 25,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Before improving the differential evolution (DE), the premature convergence feature of the differential evolution must be analyzed, which demonstrates that the differential evolution is not able to guarantee the global convergence. In order to improve the searching ability of differential evolution, two modified differential evolution are introduced by merging the mechanisms of quadratic approximation, Gaussian disturbing, immune theory and differential evolution. First, the simplified quadratic approximation is employed to improve the performance of the Immune Self-adaptive Differential Evolution and the novel algorithm is named Quadratic Approximation based Immune Self-adaptive Differential Evolution. Besides, the Gaussian disturbing is introduced into the framework of ISDE to improve the variety of the individual and the proposed algorithm is called Gaussian Disturbing based Immune Self-adaptive Differential Evolution. The performance of the proposed algorithms is tested by the benchmark problems and compared with original DE and ISDE. Both of the proposed algorithms outperform the compared algorithms. This electronic document is a \"live\" template."
            },
            "slug": "Improved-differential-evolution-algorithms-Sun-Zhou",
            "title": {
                "fragments": [],
                "text": "Improved differential evolution algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "Two modified differential evolution are introduced by merging the mechanisms of quadratic approximation, Gaussian disturbing, immune theory and differential evolution to improve the searching ability of differential evolution."
            },
            "venue": {
                "fragments": [],
                "text": "2012 IEEE International Conference on Computer Science and Automation Engineering (CSAE)"
            },
            "year": 2012
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145485250"
                        ],
                        "name": "C. Coello",
                        "slug": "C.-Coello",
                        "structuredName": {
                            "firstName": "Carlos",
                            "lastName": "Coello",
                            "middleNames": [
                                "A.",
                                "Coello"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Coello"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 61,
                                "start": 57
                            }
                        ],
                        "text": "Some well-known applications of evolution strategies are [11] routing and networking, Biochemistry, Optics, Engineering design."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 128,
                                "start": 124
                            }
                        ],
                        "text": "Forecasting, Generalization, Games and Automatic control are some suitable areas of application of evolutionary programming [11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 14
                            }
                        ],
                        "text": "It often used [11] for machine learning, pattern recognition and optimization problem."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 70
                            }
                        ],
                        "text": "Due to trees based encoding genetic programming , applicable to areas [11] like Arithmetic operations , Mathematical functions, Boolean Operations (e."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 32275713,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0d018581fdf5551938d6beb34ac0215e64058128",
            "isKey": true,
            "numCitedBy": 24,
            "numCiting": 67,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper provides a brief introduction to evolutionary algorithms including some of their applications. Our discussion includes short descriptions of genetic algorithms, evolution strategies, evolutionary programming and genetic programming. Then, a few case studies involving applications of evolutionary algorithms in real-world problems are analyzed. In the final part of the paper, some of the current research directions in this area are provided."
            },
            "slug": "An-Introduction-to-Evolutionary-Algorithms-and-Coello",
            "title": {
                "fragments": [],
                "text": "An Introduction to Evolutionary Algorithms and Their Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 77,
                "text": "This paper provides a brief introduction to evolutionary algorithms including some of their applications and some of the current research directions in this area are provided."
            },
            "venue": {
                "fragments": [],
                "text": "ISSADS"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145285040"
                        ],
                        "name": "L. D. Whitley",
                        "slug": "L.-D.-Whitley",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "Whitley",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. D. Whitley"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 70
                            }
                        ],
                        "text": "Evolutionary computing involves various algorithms, commonly known as Evolutionary Algorithms (EAs) [2][3]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 157,
                                "start": 154
                            }
                        ],
                        "text": "Sub area of Evolutionary algorithm includes Evolutionary Programming (EP), Evolution Strategies (ES), Genetic Programming (GP) and Genetic Algorithm (GA) [6][8][9][10]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 7
                            }
                        ],
                        "text": "Though Evolutionary Algorithms are widely applicable to many domains, it delivers only marginal performance."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 36
                            }
                        ],
                        "text": "Distributed Evolutionary Algorithms [6][12][13]"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 155,
                                "start": 152
                            }
                        ],
                        "text": "EAs have been widely used in many complex problem solving applications, due to its many advantages over classical search and optimization techniques [3][6][9]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 267,
                                "start": 244
                            }
                        ],
                        "text": "It is applicable to various optimization problems with limited computation capability and having\nSearch methods\nCalculus- Based Techniques\nGuided Random Search Techniques\nEnumerative Techniques\nDirect Method\nIndirect Method\nSimulated Annealing\nEvolutionary Algorithms\nDynamic Programming\nEvolutionary Strategies\nGenetic Algorithm\nGenetic Programming\nEvolutionary Programming\n978-1-5090-0467-6/16/$31.00 ©2016 IEEE\n261\ninsufficient or imperfect information."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 24
                            }
                        ],
                        "text": "During last two decades Evolutionary Algorithms becomes very popular tool for searching, optimization and providing solutions to complex problems [4]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 18637958,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7417f4bae3d12366afe3194649c1f5a20654a635",
            "isKey": true,
            "numCitedBy": 429,
            "numCiting": 70,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "An-overview-of-evolutionary-algorithms:-practical-Whitley",
            "title": {
                "fragments": [],
                "text": "An overview of evolutionary algorithms: practical issues and common pitfalls"
            },
            "venue": {
                "fragments": [],
                "text": "Inf. Softw. Technol."
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1746176"
                        ],
                        "name": "Dirk Sudholt",
                        "slug": "Dirk-Sudholt",
                        "structuredName": {
                            "firstName": "Dirk",
                            "lastName": "Sudholt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dirk Sudholt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 47,
                                "start": 43
                            }
                        ],
                        "text": "Distributed Evolutionary Algorithms [6][12][13]"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 90,
                                "start": 86
                            }
                        ],
                        "text": "It also increases the quality of the solution found in multimodular search spaces [12][13]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 129
                            }
                        ],
                        "text": "To increase overall performance of EA methods two extensions are suggested namely Memetic Algorithms (MA) and distributed EA [12][13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 20411870,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8b1a32d45d60b9d065bfb90d6158e506b20fd4d5",
            "isKey": false,
            "numCitedBy": 40,
            "numCiting": 69,
            "paperAbstract": {
                "fragments": [],
                "text": "Evolutionary algorithms (EA s) have given rise to many parallel variants, fuelled by the rapidly increasing number of CPU cores and the ready availability of computation power through GPUs and cloud computing. A very popular approach is to parallelize evolution in island models, or coarse-grained EA s, by evolving different populations on different processors. These populations run independently most of the time, but they periodically communicate genetic information to coordinate search. Many applications have shown that island models can speed up computation significantly, and that parallel populations can further increase solution diversity."
            },
            "slug": "Parallel-Evolutionary-Algorithms-Sudholt",
            "title": {
                "fragments": [],
                "text": "Parallel Evolutionary Algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This paper focuses on island models, or coarse-grained EA s, which have shown that island models can speed up computation significantly, and that parallel populations can further increase solution diversity."
            },
            "venue": {
                "fragments": [],
                "text": "Handbook of Computational Intelligence"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143725191"
                        ],
                        "name": "A. Eiben",
                        "slug": "A.-Eiben",
                        "structuredName": {
                            "firstName": "Agoston",
                            "lastName": "Eiben",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Eiben"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2119125196"
                        ],
                        "name": "J. E. Smith",
                        "slug": "J.-E.-Smith",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Smith",
                            "middleNames": [
                                "Edward"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. E. Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 74
                            }
                        ],
                        "text": "It can be continued until sufficiently good quality candidate is found [1][2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 103,
                                "start": 100
                            }
                        ],
                        "text": "Evolutionary computing involves various algorithms, commonly known as Evolutionary Algorithms (EAs) [2][3]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 165,
                                "start": 162
                            }
                        ],
                        "text": "The problems like robotics, operation research, decision making, bioinformatics, machine learning, data mining and many more are very complex and hard to solve[1][2]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 147,
                                "start": 144
                            }
                        ],
                        "text": "In the following section the diagrammatic view (figure 1) of simple EA is shown and it is thoroughly explained along with terminology used in EA[2] [9]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 46
                            }
                        ],
                        "text": "Steps involved in solving the problem with EA [2][9]"
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10740158,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "81d51bf638a6a7c405e1e1d461ae979f83fd929b",
            "isKey": true,
            "numCitedBy": 4669,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The overall structure of this new edition is three-tier: Part I presents the basics, Part II is concerned with methodological issues, and Part III discusses advanced topics. In the second edition the authors have reorganized the material to focus on problems, how to represent them, and then how to choose and design algorithms for different representations. They also added a chapter on problems, reflecting the overall book focus on problem-solvers, a chapter on parameter tuning, which they combined with the parameter control and \"how-to\" chapters into a methodological part, and finally a chapter on evolutionary robotics with an outlook on possible exciting developments in this field. The book is suitable for undergraduate and graduate courses in artificial intelligence and computational intelligence, and for self-study by practitioners and researchers engaged with all aspects of bioinspired design and optimization."
            },
            "slug": "Introduction-to-Evolutionary-Computing-Eiben-Smith",
            "title": {
                "fragments": [],
                "text": "Introduction to Evolutionary Computing"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "The authors have reorganized the material to focus on problems, how to represent them, and then how to choose and design algorithms for different representations, and added a chapter on evolutionary robotics with an outlook on possible exciting developments in this field."
            },
            "venue": {
                "fragments": [],
                "text": "Natural Computing Series"
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48211068"
                        ],
                        "name": "Jing Liu",
                        "slug": "Jing-Liu",
                        "structuredName": {
                            "firstName": "Jing",
                            "lastName": "Liu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jing Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38443701"
                        ],
                        "name": "Yaxiong Chi",
                        "slug": "Yaxiong-Chi",
                        "structuredName": {
                            "firstName": "Yaxiong",
                            "lastName": "Chi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yaxiong Chi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2004934215"
                        ],
                        "name": "Chen Zhu",
                        "slug": "Chen-Zhu",
                        "structuredName": {
                            "firstName": "Chen",
                            "lastName": "Zhu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chen Zhu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 73
                            }
                        ],
                        "text": "6 Multi-objective Evolutionary algorithm based on decomposition (MOEA/D) [17] Based on simple evolutionary multi-objective optimizer and decomposition"
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 29,
                                "start": 25
                            }
                        ],
                        "text": "7 Dynamic multi-agent GA [17] Integrates dynamic multi-agent with Genetic algorithm"
                    },
                    "intents": []
                }
            ],
            "corpusId": 34452093,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5f11e466d2521d439ac290ca826b679c564e7206",
            "isKey": false,
            "numCitedBy": 56,
            "numCiting": 78,
            "paperAbstract": {
                "fragments": [],
                "text": "In order to reconstruct large-scale gene regulatory networks (GRNs) with high accuracy, a robust evolutionary algorithm, a dynamic multiagent genetic algorithm (dMAGA), is proposed to reconstruct GRNs from time-series expression profiles based on fuzzy cognitive maps (FCMs) in this paper. The algorithm is labeled as dMAGAFCM-GRN. In dMAGAFCM-GRN, agents and their behaviors are designed with the intrinsic properties of GRN reconstruction problems in mind. All agents live in a lattice-like environment, and the neighbors of each agent are changed dynamically according to their energy in each generation. dMAGAFCM-GRN can learn continuous states directly for FCMs from data. In the experiments, the performance of dMAGAFCM-GRN is validated on both large-scale synthetic data and the benchmark DREAM3 and DREAM4. The experimental results show that dMAGAFCM-GRN is able to effectively learn FCMs with 200 nodes; that is, 40 000 weights need to be optimized. The systematic comparison with five existing algorithms shows that dMAGAFCM-GRN outperforms all other algorithms and can approximate the time series with high accuracy."
            },
            "slug": "A-Dynamic-Multiagent-Genetic-Algorithm-for-Gene-on-Liu-Chi",
            "title": {
                "fragments": [],
                "text": "A Dynamic Multiagent Genetic Algorithm for Gene Regulatory Network Reconstruction Based on Fuzzy Cognitive Maps"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The systematic comparison with five existing algorithms shows that dMAGAFCM-GRN outperforms all other algorithms and can approximate the time series with high accuracy."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Fuzzy Systems"
            },
            "year": 2016
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 79,
                                "start": 76
                            }
                        ],
                        "text": "It is a metaheuristc optimization algorithm worked on concept of population [3]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 152,
                                "start": 149
                            }
                        ],
                        "text": "EAs have been widely used in many complex problem solving applications, due to its many advantages over classical search and optimization techniques [3][6][9]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 106,
                                "start": 103
                            }
                        ],
                        "text": "Evolutionary computing involves various algorithms, commonly known as Evolutionary Algorithms (EAs) [2][3]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "AL-Salami, “Evolutionary Algorithm Definition"
            },
            "venue": {
                "fragments": [],
                "text": "American J. of Engineering and Applied Sciences,"
            },
            "year": 2009
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Evolutionary Algorithm : A Classical Search and Optimization Technique ”"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Michalewiczz, “Evolutionary Algorithms"
            },
            "venue": {
                "fragments": [],
                "text": "Fuzzy Evolutionary Computation,"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 146
                            }
                        ],
                        "text": "During last two decades Evolutionary Algorithms becomes very popular tool for searching, optimization and providing solutions to complex problems [4]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Global Optimization by Evolutionary Algorithms"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Evolutionary Computation,Vol:3 ,"
            },
            "year": 1999
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Coello Coello , ‘ An Introduction to Evolutionary Algorithms and Their Applications"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2005
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 7,
            "methodology": 8
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 20,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Evolutionary-algorithms:-A-critical-review-and-its-Vikhar/9c4b8f3b53067a34cc13e8b5b3d54071327a1388?sort=total-citations"
}