{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145266088"
                        ],
                        "name": "T. Leung",
                        "slug": "T.-Leung",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Leung",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Leung"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143751119"
                        ],
                        "name": "Jitendra Malik",
                        "slug": "Jitendra-Malik",
                        "structuredName": {
                            "firstName": "Jitendra",
                            "lastName": "Malik",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jitendra Malik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14729783,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "f66b58c3c1a660500be7367c863891bf58238f28",
            "isKey": false,
            "numCitedBy": 37,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Almost all work on texture in the computer vision and graphics communities has modeled the texture as tangential, i.e. lying in the tangent plane to the surface. This is equivalent to thinking of the texture as a pattern painted on the surface. Three-dimensional textures, where the elements may point out of the surface, have largely been ignored. We study a special class of 3D textures, perpendicular textures where we can model the elements as being normal to the surface. The perspective projection of perpendicularly textured surfaces results in several interesting phenomena, which do not occur in the much-studied tangential texture case. These include occlusion, foreshortening and illumination. In this paper, we study the geometry of the problem, modeling the locations of the elements of the texture as being a realization of a spatial point process. Relations between slant and tilt of the surface, density and height of elements and occlusions are derived. Occlusions can now be used as a cue to infer shape, instead of being treated as a source of error."
            },
            "slug": "On-perpendicular-texture-or:-Why-do-we-see-more-in-Leung-Malik",
            "title": {
                "fragments": [],
                "text": "On perpendicular texture or: Why do we see more flowers in the distance?"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The geometry of the problem is studied, modeling the locations of the elements of the texture as being a realization of a spatial point process, and Relations between slant and tilt of the surface, density and height of elements and occlusions are derived."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1710772"
                        ],
                        "name": "Kristin J. Dana",
                        "slug": "Kristin-J.-Dana",
                        "structuredName": {
                            "firstName": "Kristin",
                            "lastName": "Dana",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kristin J. Dana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8038506"
                        ],
                        "name": "B. Ginneken",
                        "slug": "B.-Ginneken",
                        "structuredName": {
                            "firstName": "Bram",
                            "lastName": "Ginneken",
                            "middleNames": [
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Ginneken"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1750470"
                        ],
                        "name": "S. Nayar",
                        "slug": "S.-Nayar",
                        "structuredName": {
                            "firstName": "Shree",
                            "lastName": "Nayar",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Nayar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 622815,
            "fieldsOfStudy": [
                "Computer Science",
                "Mathematics"
            ],
            "id": "8a07de049e417cc61442d8c1ecc576155f6777a8",
            "isKey": false,
            "numCitedBy": 1081,
            "numCiting": 78,
            "paperAbstract": {
                "fragments": [],
                "text": "In this work, we investigate the visual appearance of real-world surfaces and the dependence of appearance on imaging conditions. We present a BRDF (bidirectional reflectance distribution function) database with reflectance measurements for over 60 different samples, each observed with over 200 different combinations of viewing and source directions. We fit the BRDF measurements to two recent models to obtain a BRDF parameter database. These BRDF parameters can be directly used for both image analysis and image synthesis. Finally, we present a BTF (bidirectional texture function) database with image textures from over 60 different samples, each observed with over 200 different combinations of viewing and source directions. Each of these unique databases has important implications for a variety of vision algorithms and each is made publicly available."
            },
            "slug": "Reflectance-and-texture-of-real-world-surfaces-Dana-Ginneken",
            "title": {
                "fragments": [],
                "text": "Reflectance and texture of real-world surfaces"
            },
            "tldr": {
                "abstractSimilarityScore": 90,
                "text": "The visual appearance of real-world surfaces and the dependence of appearance on imaging conditions is investigated and a BRDF (bidirectional reflectance distribution function) database with reflectance measurements for over 60 different samples, each observed with over 200 different combinations of viewing and source directions is presented."
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of IEEE Computer Society Conference on Computer Vision and Pattern Recognition"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "7977369"
                        ],
                        "name": "A. Doorn",
                        "slug": "A.-Doorn",
                        "structuredName": {
                            "firstName": "Andrea",
                            "lastName": "Doorn",
                            "middleNames": [
                                "J.",
                                "van"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Doorn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 122895910,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "50c2835852d5f0d3a746446198a0893ed6f872aa",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "We study the illuminance texture due to three-dimensional surface mesostructure. In the conventional rendering algorithms various methods of approximate photometry are used whose domains of validity have been ill defined. We introduce the necessary photometric concepts and do a comparative study of rendering algorithms. In the computer graphics/vision literature the physically distinct causes of illuminance variation, namely, the obliqueness of surface elements and the effects of vignetting of extended sources, are thoroughly confused. This leads to serious errors when expressions are used in contexts outside their original realm. The treatment of the texture that is due to the illumination of surface mesostructure is an example. Erroneous results are obtained when simple expressions for the illuminance of convex bodies are interpreted in terms of equivalent sources and when these again are used in calculations involving different geometrical structures. We classify current methods in terms of the approximations (often implicitly) made and compare results for a large class of applications: that of surface mesostructure on convex objects. Large differences among the various approximative methods are found. We discuss simple methods that might be used to produce more realistic results at reasonable computational cost."
            },
            "slug": "Illuminance-texture-due-to-surface-mesostructure-Koenderink-Doorn",
            "title": {
                "fragments": [],
                "text": "Illuminance texture due to surface mesostructure"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The necessary photometric concepts are introduced, current methods in terms of the approximations made are classified and results for a large class of applications are compared: that of surface mesostructure on convex objects."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2121368"
                        ],
                        "name": "M. Stavridi",
                        "slug": "M.-Stavridi",
                        "structuredName": {
                            "firstName": "Marigo",
                            "lastName": "Stavridi",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Stavridi"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2064076416"
                        ],
                        "name": "B. van Ginneken",
                        "slug": "B.-van-Ginneken",
                        "structuredName": {
                            "firstName": "Bram",
                            "lastName": "van Ginneken",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. van Ginneken"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716904"
                        ],
                        "name": "J. Koenderink",
                        "slug": "J.-Koenderink",
                        "structuredName": {
                            "firstName": "Jan",
                            "lastName": "Koenderink",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Koenderink"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18065356,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "fc3c045b41634df69b0dae23ce20d3984d6aa188",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "We study and analyze properties underlying the visual appearance of materials such as the surface bidirectional reflection distribution function and texture. The spatial distribution of scattered light in relation to the incident light determines the surface appearance and can be partly specified by the bidirectional reflection distribution function, which is defined as the directionally dependent ratio of radiance to irradiance. We perform gonioradiometric measurements on samples of bricks and tiles. To describe the reflection mechanisms in the surfaces under study, we combine models of specular and diffuse reflectance from rough surfaces and fit them to the experimental data. We also collect images and determine the textural differences in the surface appearance, resulting from the variation in the illumination direction and the viewing directions."
            },
            "slug": "Surface-bidirectional-reflection-distribution-and-Stavridi-Ginneken",
            "title": {
                "fragments": [],
                "text": "Surface bidirectional reflection distribution function and the texture of bricks and tiles."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "To describe the reflection mechanisms in the surfaces under study, this work combines models of specular and diffuse reflectance from rough surfaces and fit them to the experimental data."
            },
            "venue": {
                "fragments": [],
                "text": "Applied optics"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1905962"
                        ],
                        "name": "K. E. Hawker",
                        "slug": "K.-E.-Hawker",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Hawker",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. E. Hawker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98361448"
                        ],
                        "name": "P. Welton",
                        "slug": "P.-Welton",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Welton",
                            "middleNames": [
                                "J"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Welton"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120915107,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "a9ffc575667d0c2d3246cebc6bed8b5361411f2d",
            "isKey": false,
            "numCitedBy": 45,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Measurements have been made of the reduction in illuminated area of a randomly rough surface due to shadowing in the geometrical optics limit. These measurements were made using extremely high‐contrast photographs of a randomly rough model surface having known statistics. The illumination was quasicollimated incoherent light. The resulting photographs were measured by two different methods in order to determine the ratio of total area to shadowed area. Data are given for several surfaces having different mean‐square slopes. The resulting shadowing curves, given as a function of grazing angle, are compared with a theory developed by Wagner. The agreement was found to be generally good, and the theory for area reduction due to shadowing appears to be sufficiently accurate to warrant its incorporation in the theory of scattering from randomly rough surfaces."
            },
            "slug": "Shadowing-of-Randomly-Rough-Surfaces-Hawker-Welton",
            "title": {
                "fragments": [],
                "text": "Shadowing of Randomly Rough Surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1969
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98361448"
                        ],
                        "name": "P. Welton",
                        "slug": "P.-Welton",
                        "structuredName": {
                            "firstName": "P",
                            "lastName": "Welton",
                            "middleNames": [
                                "J"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Welton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1905962"
                        ],
                        "name": "K. E. Hawker",
                        "slug": "K.-E.-Hawker",
                        "structuredName": {
                            "firstName": "Kenneth",
                            "lastName": "Hawker",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "K. E. Hawker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98093066"
                        ],
                        "name": "H. G. Frey",
                        "slug": "H.-G.-Frey",
                        "structuredName": {
                            "firstName": "Harlan",
                            "lastName": "Frey",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. G. Frey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This assumption has been verified empirically both for one-dimensional surfaces [2] and two-dimensional surfaces [10]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 122092839,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "3980633f906b054e4fc1751acf79458794a9a6e7",
            "isKey": false,
            "numCitedBy": 8,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The dependence of the shadowing function on grazing angle was optically measured on three rough surfaces which are identical except for the rms reliefs (and slopes) which had been scaled in the ratios 1 : 2 : 4. Both one‐ and two‐dimensional shadowing measurements were made. The one‐dimensional measurements are in good agreement with the one‐dimensional theory of shadowing developed by R. J. Wagner. In addition, the one‐ and two‐dimensional shadowing measurements are in excellent agreement with one another as would be expected for nearly isotropic surfaces."
            },
            "slug": "Experimental-shadowing-measurements-on-surfaces-Welton-Hawker",
            "title": {
                "fragments": [],
                "text": "Experimental shadowing measurements on randomly-rough surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1973
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2191078"
                        ],
                        "name": "P. Beckmann",
                        "slug": "P.-Beckmann",
                        "structuredName": {
                            "firstName": "Petr",
                            "lastName": "Beckmann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Beckmann"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "(3)"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 89,
                                "start": 86
                            }
                        ],
                        "text": "Note that the event (N ∈ Co) is not equivalent to the event (η ∈ Co) because of the effects of masking, shadowing and foreshortening."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 25,
                                "start": 22
                            }
                        ],
                        "text": "For example, if there are 256 discrete intensity values Ω is a 256 × L matrix."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 121928481,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "54fe9af91e06fdea4440b13fb628a1c33154d8cf",
            "isKey": true,
            "numCitedBy": 147,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "To account for shadowing in investigations of scattering by rough surfaces, the area subtending the surface is multiplied by a shadowing function equal to the ratio of illuminated to total area. This is derived for a surface generated by a stationary process in general and a normal process in particular. The resulting height distribution of the surface, when only its illuminated parts are considered, is also derived; this is used to determine the effect of shadowing by a more rigorous method."
            },
            "slug": "Shadowing-of-random-rough-surfaces-Beckmann",
            "title": {
                "fragments": [],
                "text": "Shadowing of random rough surfaces"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1965
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107848481"
                        ],
                        "name": "B. Smith",
                        "slug": "B.-Smith",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Smith",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Smith"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121963872,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "8421679890a562a180829d39714c5e8c268715b7",
            "isKey": false,
            "numCitedBy": 452,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "In the context of the backscattering of waves from a random rough surface, a theoretical model is used to investigate the geometrical self-shadowing of a surface described by Gaussian statistics. Expressions are derived for various shadowing probabilities as functions of the parameter characterizing surface roughness and of the angle of incidence of the illuminating beam. The theoretical shadowing functions compare closely with those obtained experimentally from a recent computer simulation of a Gaussian surface."
            },
            "slug": "Geometrical-shadowing-of-a-random-rough-surface-Smith",
            "title": {
                "fragments": [],
                "text": "Geometrical shadowing of a random rough surface"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1967
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16849225"
                        ],
                        "name": "R. Brockelman",
                        "slug": "R.-Brockelman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Brockelman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brockelman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8428090"
                        ],
                        "name": "T. Hagfors",
                        "slug": "T.-Hagfors",
                        "structuredName": {
                            "firstName": "Tor",
                            "lastName": "Hagfors",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Hagfors"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120086526,
            "fieldsOfStudy": [
                "Physics"
            ],
            "id": "4babecd8d7ca06a7de69899773d6d96d80b0f9b9",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "A one-dimensional random rough surface is modeled as a Gaussian noise signal. The effect of shadowing in the case of backscattering of waves from such a surface is studied in the geometric optic limit by analyzing the Gaussian noise signal in a digital computer. It is found that presently accepted theories for the shadowing effect are of doubtful validity."
            },
            "slug": "Note-on-the-effect-of-shadowing-on-the-of-waves-a-Brockelman-Hagfors",
            "title": {
                "fragments": [],
                "text": "Note on the effect of shadowing on the backscattering of waves from a random rough surface"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1966
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Shadowing of RandoT Rough Surfaces."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Antennas Propag.,"
            },
            "year": 1965
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Tex - ture histograms as a function of irradiaion and viewing direction Shadowing of Randomly Rough Surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "J . Acoust . Soc . Am ."
            },
            "year": 1967
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Shadowing of RandoT Rough SurfacesNote on the effect of Shadowing on the Backscattering of Waves from a random rough surfaces"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Antennas Propag. IEEE Trans. Antennas Propag"
            },
            "year": 1965
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Geometrical Shadowing of Randomly Rough Surfaces,"
            },
            "venue": {
                "fragments": [],
                "text": "IEEE tins. Antennas Propag.. p. 668,"
            },
            "year": 1967
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 1,
            "methodology": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 13,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Histogram-model-for-3D-textures-Dana-Nayar/bd2ef7dbd1dbe42e2dfeefa6b03f3b689a8f3f08?sort=total-citations"
}