{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646084"
                        ],
                        "name": "B. Sarwar",
                        "slug": "B.-Sarwar",
                        "structuredName": {
                            "firstName": "Badrul",
                            "lastName": "Sarwar",
                            "middleNames": [
                                "Munir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Sarwar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50877490"
                        ],
                        "name": "G. Karypis",
                        "slug": "G.-Karypis",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Karypis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Karypis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8047550,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f82c52452c7de8cd6472202c1be2cce9fbcb8dda",
            "isKey": false,
            "numCitedBy": 8423,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems apply knowledge discovery techniques to the problem of making personalized recommendations for information, products or services during a live interaction. These systems, especially the k-nearest neighbor collaborative ltering based ones, are achieving widespread success on the Web. The tremendous growth in the amount of available information and the number of visitors to Web sites in recent years poses some key challenges for recommender systems. These are: producing high quality recommendations, performing many recommendations per second for millions of users and items and achieving high coverage in the face of data sparsity. In traditional collaborative ltering systems the amount of work increases with the number of participants in the system. New recommender system technologies are needed that can quickly produce high quality recommendations, even for very large-scale problems. To address these issues we have explored item-based collaborative ltering techniques. Item-based techniques rst analyze the user-item matrix to identify relationships between di erent items, and then use these relationships to indirectly compute recommendations for users. In this paper we analyze di erent item-based recommendation generation algorithms. We look into di erent techniques for computing item-item similarities (e.g., item-item correlation vs. cosine similarities between item vectors) and di erent techniques for obtaining recommendations from them (e.g., weighted sum vs. regression model). Finally, we experimentally evaluate our results and compare them to the basic k-nearest neighbor approach. Our experiments suggest that item-based algorithms provide dramatically better performance than user-based algorithms, while at the same time providing better quality than the best available userbased algorithms."
            },
            "slug": "Item-based-collaborative-filtering-recommendation-Sarwar-Karypis",
            "title": {
                "fragments": [],
                "text": "Item-based collaborative filtering recommendation algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper analyzes item-based collaborative ltering techniques and suggests that item- based algorithms provide dramatically better performance than user-based algorithms, while at the same time providing better quality than the best available userbased algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "WWW '01"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8874758"
                        ],
                        "name": "J. Schafer",
                        "slug": "J.-Schafer",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Schafer",
                            "middleNames": [
                                "Ben"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schafer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 480771,
            "fieldsOfStudy": [
                "Business",
                "Computer Science"
            ],
            "id": "b51653d992f02e0e420cb65ed05fbd52094a83cc",
            "isKey": false,
            "numCitedBy": 1665,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems are being used by an ever-increasing number of E-commerce sites to help consumers find products to purchase. What started as a novelty has turned into a serious business tool. Recommender systems use product knowledge—either hand-coded knowledge provided by experts or “mined” knowledge learned from the behavior of consumers—to guide consumers through the often-overwhelming task of locating products they will like. In this article we present an explanation of how recommender systems are related to some traditional database analysis techniques. We examine how recommender systems help E-commerce sites increase sales and analyze the recommender systems at six market-leading sites. Based on these examples, we create a taxonomy of recommender systems, including the inputs required from the consumers, the additional knowledge required from the database, the ways the recommendations are presented to consumers, the technologies used to create the recommendations, and the level of personalization of the recommendations. We identify five commonly used E-commerce recommender application models, describe several open research problems in the field of recommender systems, and examine privacy implications of recommender systems technology."
            },
            "slug": "E-Commerce-Recommendation-Applications-Schafer-Konstan",
            "title": {
                "fragments": [],
                "text": "E-Commerce Recommendation Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "An explanation of how recommender systems are related to some traditional database analysis techniques is presented, and a taxonomy ofRecommender systems is created, including the inputs required from the consumers, the additional knowledge required from a database, the ways the recommendations are presented to consumers,The technologies used to create the recommendations, and the level of personalization of the recommendations."
            },
            "venue": {
                "fragments": [],
                "text": "Data Mining and Knowledge Discovery"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2984498"
                        ],
                        "name": "M. Balabanovic",
                        "slug": "M.-Balabanovic",
                        "structuredName": {
                            "firstName": "Marko",
                            "lastName": "Balabanovic",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Balabanovic"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701353"
                        ],
                        "name": "Y. Shoham",
                        "slug": "Y.-Shoham",
                        "structuredName": {
                            "firstName": "Yoav",
                            "lastName": "Shoham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Shoham"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15277800,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "92cc12f272ff55795c29cd97dc8ee17a5554308e",
            "isKey": false,
            "numCitedBy": 3152,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of recommending items from some fixed database has been studied extensively, and two main paradigms have emerged. In content-based recommendation one tries to recommend items similar to those a given user has liked in the past, whereas in collaborative recommendation one identifies users whose tastes are similar to those of the given user and recommends items they have liked. Our approach in Fab has been to combine these two methods. Here, we explain how a hybrid system can incorporate the advantages of both methods while inheriting the disadvantages of neither. In addition to what one might call the “generic advantages” inherent in any hybrid system, the particular design of the Fab architecture brings two additional benefits. First, two scaling problems common to all Web services are addressed—an increasing number of users and an increasing number of documents. Second, the system automatically identifies emergent communities of interest in the user population, enabling enhanced group awareness and communications. Here we describe the two approaches for contentbased and collaborative recommendation, explain how a hybrid system can be created, and then describe Fab, an implementation of such a system. For more details on both the implemented architecture and the experimental design the reader is referred to [1]. The content-based approach to recommendation has its roots in the information retrieval (IR) community, and employs many of the same techniques. Text documents are recommended based on a comparison between their content and a user profile. Data"
            },
            "slug": "Fab:-content-based,-collaborative-recommendation-Balabanovic-Shoham",
            "title": {
                "fragments": [],
                "text": "Fab: content-based, collaborative recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is explained how a hybrid system can incorporate the advantages of both methods while inheriting the disadvantages of neither, and how the particular design of the Fab architecture brings two additional benefits."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1412391493"
                        ],
                        "name": "L. Ungar",
                        "slug": "L.-Ungar",
                        "structuredName": {
                            "firstName": "Lyle",
                            "lastName": "Ungar",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Ungar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145346320"
                        ],
                        "name": "Dean P. Foster",
                        "slug": "Dean-P.-Foster",
                        "structuredName": {
                            "firstName": "Dean",
                            "lastName": "Foster",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dean P. Foster"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6565845,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d6b99637332f818dc94c0432db617db28873e035",
            "isKey": false,
            "numCitedBy": 790,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Grouping people into clusters based on the items they have purchased allows accurate recommendations of new items for purchase: if you and I have liked many of the same movies, then I will probably enjoy other movies that you like. Recommending items based on similarity of interest (a.k.a. collaborative filtering) is attractive for many domains: books, CDs, movies, etc., but does not always work well. Because data are always sparse - any given person has seen only a small fraction of all movies - much more accurate predictions can be made by grouping people into clusters with similar movies and grouping movies into clusters which tend to be liked by the same people. Finding optimal clusters is tricky because the movie groups should be used to help determine the people groups and visa versa. We present a formal statistical model of collaborative filtering, and compare different algorithms for estimating the model parameters including variations of K-means clustering and Gibbs Sampling. This formal model is easily extended to handle clustering of objects with multiple attributes."
            },
            "slug": "Clustering-Methods-for-Collaborative-Filtering-Ungar-Foster",
            "title": {
                "fragments": [],
                "text": "Clustering Methods for Collaborative Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "A formal statistical model of collaborative filtering is presented, and different algorithms for estimating the model parameters including variations of K-means clustering and Gibbs Sampling are compared."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI 1998"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2984498"
                        ],
                        "name": "M. Balabanovic",
                        "slug": "M.-Balabanovic",
                        "structuredName": {
                            "firstName": "Marko",
                            "lastName": "Balabanovic",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Balabanovic"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701353"
                        ],
                        "name": "Y. Shoham",
                        "slug": "Y.-Shoham",
                        "structuredName": {
                            "firstName": "Yoav",
                            "lastName": "Shoham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Shoham"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2702765,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ffef7168dbbf9b89da27745d2ca7320405fffa57",
            "isKey": false,
            "numCitedBy": 51,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of recommending items from some fixed database has been studied extensively, and two main paradigms have emerged. In content-based recommendation one tries to recommend items similar to those a given user has liked in the past, whereas in collaborative recommendation one identifies users whose tastes are similar to those of the given user and recommends items they have liked. Our approach in Fab has been to combine these two methods. Here, we explain how a hybrid system can incorporate the advantages of both methods while inheriting the disadvantages of neither. In addition to what one might call the “generic advantages” inherent in any hybrid system, the particular design of the Fab architecture brings two additional benefits. First, two scaling problems common to all Web services are addressed—an increasing number of users and an increasing number of documents. Second, the system automatically identifies emergent communities of interest in the user population, enabling enhanced group awareness and communications. Here we describe the two approaches for contentbased and collaborative recommendation, explain how a hybrid system can be created, and then describe Fab, an implementation of such a system. For more details on both the implemented architecture and the experimental design the reader is referred to [1]. The content-based approach to recommendation has its roots in the information retrieval (IR) community, and employs many of the same techniques. Text documents are recommended based on a comparison between their content and a user profile. Data"
            },
            "slug": "Ecom-Syst-Content-based,-Collaborative-Balabanovic-Shoham",
            "title": {
                "fragments": [],
                "text": "Ecom Syst Content-based, Collaborative Recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "It is explained how a hybrid system can incorporate the advantages of both methods while inheriting the disadvantages of neither, and how the particular design of the Fab architecture brings two additional benefits."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1778725"
                        ],
                        "name": "J. Breese",
                        "slug": "J.-Breese",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Breese",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Breese"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48099028"
                        ],
                        "name": "D. Heckerman",
                        "slug": "D.-Heckerman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heckerman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heckerman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1772349"
                        ],
                        "name": "C. Kadie",
                        "slug": "C.-Kadie",
                        "structuredName": {
                            "firstName": "Carl",
                            "lastName": "Kadie",
                            "middleNames": [
                                "Myers"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Kadie"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2885948,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "36b4a92c8eca6fd6d1b8588fc1fd0e3f89a16623",
            "isKey": false,
            "numCitedBy": 5689,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Collaborative filtering or recommender systems use a database about user preferences to predict additional topics or products a new user might like. In this paper we describe several algorithms designed for this task, including techniques based on correlation coefficients, vector-based similarity calculations, and statistical Bayesian methods. We compare the predictive accuracy of the various methods in a set of representative problem domains. We use two basic classes of evaluation metrics. The first characterizes accuracy over a set of individual predictions in terms of average absolute deviation. The second estimates the utility of a ranked list of suggested items. This metric uses an estimate of the probability that a user will see a recommendation in an ordered list. \n \nExperiments were run for datasets associated with 3 application areas, 4 experimental protocols, and the 2 evaluation metr rics for the various algorithms. Results indicate that for a wide range of conditions, Bayesian networks with decision trees at each node and correlation methods outperform Bayesian-clustering and vector-similarity methods. Between correlation and Bayesian networks, the preferred method depends on the nature of the dataset, nature of the application (ranked versus one-by-one presentation), and the availability of votes with which to make predictions. Other considerations include the size of database, speed of predictions, and learning time."
            },
            "slug": "Empirical-Analysis-of-Predictive-Algorithms-for-Breese-Heckerman",
            "title": {
                "fragments": [],
                "text": "Empirical Analysis of Predictive Algorithms for Collaborative Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "Several algorithms designed for collaborative filtering or recommender systems are described, including techniques based on correlation coefficients, vector-based similarity calculations, and statistical Bayesian methods, to compare the predictive accuracy of the various methods in a set of representative problem domains."
            },
            "venue": {
                "fragments": [],
                "text": "UAI"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144344283"
                        ],
                        "name": "Ken Goldberg",
                        "slug": "Ken-Goldberg",
                        "structuredName": {
                            "firstName": "Ken",
                            "lastName": "Goldberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ken Goldberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47012025"
                        ],
                        "name": "T. Roeder",
                        "slug": "T.-Roeder",
                        "structuredName": {
                            "firstName": "Theresa",
                            "lastName": "Roeder",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Roeder"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143701259"
                        ],
                        "name": "Dhruv Gupta",
                        "slug": "Dhruv-Gupta",
                        "structuredName": {
                            "firstName": "Dhruv",
                            "lastName": "Gupta",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dhruv Gupta"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144846471"
                        ],
                        "name": "Chris Perkins",
                        "slug": "Chris-Perkins",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Perkins",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chris Perkins"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2851591,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c6ca4c2912db0708f6df1ad1525746915d392a45",
            "isKey": false,
            "numCitedBy": 1574,
            "numCiting": 42,
            "paperAbstract": {
                "fragments": [],
                "text": "Eigentaste is a collaborative filtering algorithm that uses universal queries to elicit real-valued user ratings on a common set of items and applies principal component analysis (PCA) to the resulting dense subset of the ratings matrix. PCA facilitates dimensionality reduction for offline clustering of users and rapid computation of recommendations. For a database of n users, standard nearest-neighbor techniques require O(n) processing time to compute recommendations, whereas Eigentaste requires O(1) (constant) time. We compare Eigentaste to alternative algorithms using data from Jester, an online joke recommending system.Jester has collected approximately 2,500,000 ratings from 57,000 users. We use the Normalized Mean Absolute Error (NMAE) measure to compare performance of different algorithms. In the Appendix we use Uniform and Normal distribution models to derive analytic estimates of NMAE when predictions are random. On the Jester dataset, Eigentaste computes recommendations two orders of magnitude faster with no loss of accuracy. Jester is online at: http://eigentaste.berkeley.edu"
            },
            "slug": "Eigentaste:-A-Constant-Time-Collaborative-Filtering-Goldberg-Roeder",
            "title": {
                "fragments": [],
                "text": "Eigentaste: A Constant Time Collaborative Filtering Algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This work compares Eigentaste to alternative algorithms using data from Jester, an online joke recommending system, and uses the Normalized Mean Absolute Error (NMAE) measure to compare performance of different algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "Information Retrieval"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144741762"
                        ],
                        "name": "P. Resnick",
                        "slug": "P.-Resnick",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Resnick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Resnick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32895600"
                        ],
                        "name": "N. Iacovou",
                        "slug": "N.-Iacovou",
                        "structuredName": {
                            "firstName": "Neophytos",
                            "lastName": "Iacovou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Iacovou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48185525"
                        ],
                        "name": "M. Suchak",
                        "slug": "M.-Suchak",
                        "structuredName": {
                            "firstName": "Mitesh",
                            "lastName": "Suchak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Suchak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2073783270"
                        ],
                        "name": "P. Bergstrom",
                        "slug": "P.-Bergstrom",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Bergstrom",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Bergstrom"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 2616594,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "64a717dc148b76070bbb6a3190a7e05bb9734400",
            "isKey": false,
            "numCitedBy": 5852,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Collaborative filters help people make choices based on the opinions of other people. GroupLens is a system for collaborative filtering of netnews, to help people find articles they will like in the huge stream of available articles. News reader clients display predicted scores and make it easy for users to rate articles after they read them. Rating servers, called Better Bit Bureaus, gather and disseminate the ratings. The rating servers predict scores based on the heuristic that people who agreed in the past will probably agree again. Users can protect their privacy by entering ratings under pseudonyms, without reducing the effectiveness of the score prediction. The entire architecture is open: alternative software for news clients and Better Bit Bureaus can be developed independently and can interoperate with the components we have developed."
            },
            "slug": "GroupLens:-an-open-architecture-for-collaborative-Resnick-Iacovou",
            "title": {
                "fragments": [],
                "text": "GroupLens: an open architecture for collaborative filtering of netnews"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "GroupLens is a system for collaborative filtering of netnews, to help people find articles they will like in the huge stream of available articles, and protect their privacy by entering ratings under pseudonyms, without reducing the effectiveness of the score prediction."
            },
            "venue": {
                "fragments": [],
                "text": "CSCW '94"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646084"
                        ],
                        "name": "B. Sarwar",
                        "slug": "B.-Sarwar",
                        "structuredName": {
                            "firstName": "Badrul",
                            "lastName": "Sarwar",
                            "middleNames": [
                                "Munir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Sarwar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50877490"
                        ],
                        "name": "G. Karypis",
                        "slug": "G.-Karypis",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Karypis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Karypis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12366165,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3219f5733e87afbe1481f7f99c0d06c7c9752c31",
            "isKey": false,
            "numCitedBy": 1980,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "ABSTRACT Re ommender systems apply statisti al and knowledge disovery te hniques to the problem of making produ t re ommendations during a live ustomer intera tion and they are a hieving widespread su ess in E-Commer e nowadays. In this paper, we investigate several te hniques for analyzing large-s ale pur hase and preferen e data for the purpose of produ ing useful re ommendations to ustomers. In parti ular, we apply a olle tion of algorithms su h as traditional data mining, nearest-neighbor ollaborative ltering, and dimensionality redu tion on two di erent data sets. The rst data set was derived from the web-pur hasing transa tion of a large Eommer e ompany whereas the se ond data set was olle ted from MovieLens movie re ommendation site. For the experimental purpose, we divide the re ommendation generation pro ess into three sub pro esses{ representation of input data, neighborhood formation, and re ommendation generation. We devise di erent te hniques for di erent sub pro esses and apply their ombinations on our data sets to ompare for re ommendation quality and performan e."
            },
            "slug": "Analysis-of-recommendation-algorithms-for-Sarwar-Karypis",
            "title": {
                "fragments": [],
                "text": "Analysis of recommendation algorithms for e-commerce"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper investigates several te hniques for analyzing large-s ale pur hase and preferen e data for the purpose of producing useful re ommendations to ustomers and devise and apply their ombinations on the authors' data sets to ompare for re Ommendation quality and performan e."
            },
            "venue": {
                "fragments": [],
                "text": "EC '00"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052864185"
                        ],
                        "name": "P. Bradley",
                        "slug": "P.-Bradley",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Bradley",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Bradley"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1695784"
                        ],
                        "name": "U. Fayyad",
                        "slug": "U.-Fayyad",
                        "structuredName": {
                            "firstName": "Usama",
                            "lastName": "Fayyad",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "U. Fayyad"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1723460"
                        ],
                        "name": "Cory Reina",
                        "slug": "Cory-Reina",
                        "structuredName": {
                            "firstName": "Cory",
                            "lastName": "Reina",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cory Reina"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1272123,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "338092b7c90f3c6c03dfe52db4ecf58bd23d3a22",
            "isKey": false,
            "numCitedBy": 888,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "Practical clustering algorithms require multiple data scans to achieve convergence. For large databases, these scans become prohibitively expensive. We present a scalable clustering framework applicable to a wide class of iterative clustering. We require at most one scan of the database. In this work, the framework is instantiated and numerically justified with the popular K-Means clustering algorithm. The method is based on identifying regions of the data that are compressible, regions that must be maintained in memory, and regions that are discardable. The algorithm operates within the confines of a limited memory buffer. Empirical results demonstrate that the scalable scheme outperforms a sampling-based approach. In our scheme, data resolution is preserved to the extent possible based upon the size of the allocated memory buffer and the fit of current clustering model to the data. The framework is naturally extended to update multiple clustering models simultaneously. We empirically evaluate on synthetic and publicly available data sets."
            },
            "slug": "Scaling-Clustering-Algorithms-to-Large-Databases-Bradley-Fayyad",
            "title": {
                "fragments": [],
                "text": "Scaling Clustering Algorithms to Large Databases"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A scalable clustering framework applicable to a wide class of iterative clustering that requires at most one scan of the database and is instantiated and numerically justified with the popular K-Means clustering algorithm."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2984498"
                        ],
                        "name": "M. Balabanovic",
                        "slug": "M.-Balabanovic",
                        "structuredName": {
                            "firstName": "Marko",
                            "lastName": "Balabanovic",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Balabanovic"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701353"
                        ],
                        "name": "Y. Shoham",
                        "slug": "Y.-Shoham",
                        "structuredName": {
                            "firstName": "Yoav",
                            "lastName": "Shoham",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Shoham"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 209030898,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6a445dfe4af96615a1d72d3cecc3ef073df29a19",
            "isKey": false,
            "numCitedBy": 513,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Content-Based,-Collaborative-Recommendation.-Balabanovic-Shoham",
            "title": {
                "fragments": [],
                "text": "Content-Based, Collaborative Recommendation."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analysis of Recommendation AlgoPhone:+1 714 821 8380 rithms for E-Commerce,"
            },
            "venue": {
                "fragments": [],
                "text": "ACM Conf. Electronic Commerce,"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "E-Commerce Recommendation Applications,” Data Mining and Knowledge Inside Back Cover  Discovery"
            },
            "venue": {
                "fragments": [],
                "text": "Kluwer Academic,"
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Collaborative Recommendations Using Item-to-Item Similarity Mappings, US Patent 6"
            },
            "venue": {
                "fragments": [],
                "text": "Patent and Trademark Office"
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Goldberg et al . , “ Eigentaste : A Constant Time Collaborative Filtering Algorithm"
            },
            "venue": {
                "fragments": [],
                "text": ""
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 15,
        "totalPages": 2
    },
    "page_url": "https://www.semanticscholar.org/paper/Amazon.com-Recommendations:-Item-to-Item-Filtering-Linden-Smith/da8b0378174bc25ed174be36a1c725787b81854d?sort=total-citations"
}