{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145228938"
                        ],
                        "name": "W. Welch",
                        "slug": "W.-Welch",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Welch",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Welch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1815604"
                        ],
                        "name": "M. Schonlau",
                        "slug": "M.-Schonlau",
                        "structuredName": {
                            "firstName": "Matthias",
                            "lastName": "Schonlau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Schonlau"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60822138,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e89ecae12b44191809befa31404bbc91bec395df",
            "isKey": false,
            "numCitedBy": 410,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "A complex mathematical model that produces output values from input values is now commonly called a computer model. This thesis considers the problem of finding the global optimum of the response with few function evaluations. A small number of function evaluations is desirable since the computer model is often expensive (time consuming) to evaluate. \nThe function to be optimized is modeled as a stochastic process from initial function evaluations. Points are sampled sequentially according to a criterion that combines promising prediction values with prediction uncertainty. Some graphical tools are given that allow early assessment about whether the modeling strategy will work well. The approach is generalized by introducing a parameter that controls how global versus local the search strategy is. Strategies to conduct the optimization in stages and for optimization subject to constraints on additional response variables are presented. \nSpecial consideration is given to the stopping criterion of the global optimization algorithm. The problem of achieving a tolerance on the global minimum can be represented by determining whether the first order statistic of N dependent variables is greater than a certain value. An algorithm is developed that quickly determines bounds on the probability of this event. \nA strategy to explore high-dimensional data informally through effect plots is presented. The interpretation of the plots is guided by pointwise standard errors of the effects which are developed. When used in the context of global optimization, the graphical analysis sheds light on the number and location of local optima."
            },
            "slug": "Computer-experiments-and-global-optimization-Welch-Schonlau",
            "title": {
                "fragments": [],
                "text": "Computer experiments and global optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "This thesis considers the problem of finding the global optimum of the response with few function evaluations and presents strategies to conduct the optimization in stages and for optimization subject to constraints on additional response variables."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2424124"
                        ],
                        "name": "B. Stuckman",
                        "slug": "B.-Stuckman",
                        "structuredName": {
                            "firstName": "Bruce",
                            "lastName": "Stuckman",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Stuckman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 58
                            }
                        ],
                        "text": "The algorithms of Elder [16], Perttunen [27] and Stuckman [33] are heuristic extensions of Kushner’s one-dimensional algorithm [19] and, as such, do not use any statistical model at all."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 31720281,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5b2c742a51e7d06ede251a2e7e82e37df1ecd59a",
            "isKey": false,
            "numCitedBy": 82,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "The theory and implementation of a global search method of optimization in n dimensions, inspired by Kushner's method in one dimension, are presented. This method is meant to address optimization problems where the function has many extrema, where it may or may not be differentiable, and where it is important to reduce the number of evaluations of the function at the expense of increased computation. Comparisons are made to the performance of other global optimization techniques on a set of standard differentiable test functions. A new class of discrete-valued test functions is introduced, and the performance of the method is determined on a randomly generated set of these functions. Overall, this method has the power of other Bayesian/sampling techniques without the need for a separate local optimization technique for improved convergence. This makes it possible for the search to operate on unknown functions that may contain one or more discrete components. >"
            },
            "slug": "A-global-search-method-for-optimizing-nonlinear-Stuckman",
            "title": {
                "fragments": [],
                "text": "A global search method for optimizing nonlinear systems"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "The theory and implementation of a global search method of optimization in n dimensions, inspired by Kushner's method in one dimension, are presented, which has the power of other Bayesian/sampling techniques without the need for a separate local optimization technique for improved convergence."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Trans. Syst. Man Cybern."
            },
            "year": 1988
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "72173680"
                        ],
                        "name": "N. M. Alexandrov",
                        "slug": "N.-M.-Alexandrov",
                        "structuredName": {
                            "firstName": "N.",
                            "lastName": "Alexandrov",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. M. Alexandrov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1800149"
                        ],
                        "name": "J. Dennis",
                        "slug": "J.-Dennis",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Dennis",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Dennis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2107671451"
                        ],
                        "name": "R. Lewis",
                        "slug": "R.-Lewis",
                        "structuredName": {
                            "firstName": "R.",
                            "lastName": "Lewis",
                            "middleNames": [
                                "Michael"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Lewis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2776399"
                        ],
                        "name": "V. Torczon",
                        "slug": "V.-Torczon",
                        "structuredName": {
                            "firstName": "Virginia",
                            "lastName": "Torczon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torczon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 581819,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a085185238a327d4a386c79f6fd11b84e6be0280",
            "isKey": false,
            "numCitedBy": 632,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents an analytically robust, globally convergent approach to managing the use of approximation models of varying fidelity in optimization. By robust global behaviour we mean the mathematical assurance that the iterates produced by the optimization algorithm, started at an arbitrary initial iterate, will converge to a stationary point or local optimizer for the original problem. The approach presented is based on the trust region idea from nonlinear programming and is shown to be provably convergent to a solution of the original high-fidelity problem. The proposed method for managing approximations in engineering optimization suggests ways to decide when the fidelity, and thus the cost, of the approximations might be fruitfully increased or decreased in the course of the optimization iterations. The approach is quite general. We make no assumptions on the structure of the original problem, in particular, no assumptions of convexity and separability, and place only mild requirements on the approximations. The approximations used in the framework can be of any nature appropriate to an application; for instance, they can be represented by analyses, simulations, or simple algebraic models. This paper introduces the approach and outlines the convergence analysis."
            },
            "slug": "A-trust-region-framework-for-managing-the-use-of-in-Alexandrov-Dennis",
            "title": {
                "fragments": [],
                "text": "A trust-region framework for managing the use of approximation models in optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 66,
                "text": "An analytically robust, globally convergent approach to managing the use of approximation models of varying fidelity in optimization, based on the trust region idea from nonlinear programming, which is shown to be provably convergent to a solution of the original high-fidelity problem."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6050918"
                        ],
                        "name": "J. Elder",
                        "slug": "J.-Elder",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Elder",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Elder"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "The algorithms of Elder [16], Perttunen [27] and Stuckman [33] are heuristic extensions of Kushner’s one-dimensional algorithm [19] and, as such, do not use any statistical model at all."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 123629619,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "396e4c51c8a9344d70429777c6d1a7a5a7357a48",
            "isKey": false,
            "numCitedBy": 17,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "A global optimization algorithm is introduced which generalizes H.J. Kushner's (1964) univariate search. It aims to minimize the number of probes required for a given confidence in the results. All known probes contribute to a stochastic model of the underlying score surface, and this model is interrogated for the location most likely to exceed the current result goal. The surface is assumed to be fractal, leading to a piecewise Gaussian model, where the local regions are defined by the Delaunay triangulation of the probes. The algorithm balances the competing aims of (1) sampling in the vicinity of known peaks, and (2) exploring new regions. Preliminary tests on a standard 2-D search problem were very encouraging.<<ETX>>"
            },
            "slug": "Global-R/sup-d/-optimization-when-probes-are-the-Elder",
            "title": {
                "fragments": [],
                "text": "Global R/sup d/ optimization when probes are expensive: the GROPE algorithm"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "A global optimization algorithm is introduced which generalizes H.J. Kushner's (1964) univariate search and balances the competing aims of sampling in the vicinity of known peaks, and exploring new regions."
            },
            "venue": {
                "fragments": [],
                "text": "[Proceedings] 1992 IEEE International Conference on Systems, Man, and Cybernetics"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1921622"
                        ],
                        "name": "I. Androulakis",
                        "slug": "I.-Androulakis",
                        "structuredName": {
                            "firstName": "Ioannis",
                            "lastName": "Androulakis",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Androulakis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2633265"
                        ],
                        "name": "C. Maranas",
                        "slug": "C.-Maranas",
                        "structuredName": {
                            "firstName": "Costas",
                            "lastName": "Maranas",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Maranas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1696826"
                        ],
                        "name": "C. Floudas",
                        "slug": "C.-Floudas",
                        "structuredName": {
                            "firstName": "Christodoulos",
                            "lastName": "Floudas",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Floudas"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 35
                            }
                        ],
                        "text": "h=1 θh|x h − x h |ph (θh ≥ 0, ph ∈ [1,2])."
                    },
                    "intents": []
                }
            ],
            "corpusId": 9951857,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "56ef04561fb2d1e92aeaa552480c0204e14a40ac",
            "isKey": false,
            "numCitedBy": 424,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "A branch and bound global optimization method,αBB, for general continuous optimization problems involving nonconvexities in the objective function and/or constraints is presented. The nonconvexities are categorized as being either of special structure or generic. A convex relaxation of the original nonconvex problem is obtained by (i) replacing all nonconvex terms of special structure (i.e. bilinear, fractional, signomial) with customized tight convex lower bounding functions and (ii) by utilizing the α parameter as defined in [17] to underestimate nonconvex terms of generic structure. The proposed branch and bound type algorithm attains finiteε-convergence to the global minimum through the successive subdivision of the original region and the subsequent solution of a series of nonlinear convex minimization problems. The global optimization method,αBB, is implemented in C and tested on a variety of example problems."
            },
            "slug": "αBB:-A-global-optimization-method-for-general-Androulakis-Maranas",
            "title": {
                "fragments": [],
                "text": "αBB: A global optimization method for general constrained nonconvex problems"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The proposed branch and bound type algorithm attains finiteε-convergence to the global minimum through the successive subdivision of the original region and the subsequent solution of a series of nonlinear convex minimization problems."
            },
            "venue": {
                "fragments": [],
                "text": "J. Glob. Optim."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34816119"
                        ],
                        "name": "M. Morris",
                        "slug": "M.-Morris",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Morris",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Morris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46842850"
                        ],
                        "name": "T. J. Mitchell",
                        "slug": "T.-J.-Mitchell",
                        "structuredName": {
                            "firstName": "Toby",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. J. Mitchell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52107125"
                        ],
                        "name": "D. Ylvisaker",
                        "slug": "D.-Ylvisaker",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Ylvisaker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ylvisaker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 77
                            }
                        ],
                        "text": "As it turns out, the DACE predictor is easily extended to handle derivatives [25]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 121521459,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2e0b322a4751b3d449dfe73bd525ff4f7f38dcc3",
            "isKey": false,
            "numCitedBy": 373,
            "numCiting": 30,
            "paperAbstract": {
                "fragments": [],
                "text": "This article is concerned with the problem of predicting a deterministic response function yo over a multidimensional domain T, given values of yo and all of its first derivatives at a set of design sites (points) in T. The intended application is to computer experiments in which yo is an output from a computer model of a physical system and each point in T represents a particular configuration of the input parameters. It is assumed that the first derivatives are already available (e.g., from a sensitivity analysis) or can be produced by the code that implements the model. A Bayesian approach in which the random function that represents prior uncertainty about yo is taken to be a stationary Gaussian stochastic process is used. The calculations needed to update the prior given observations of yo and its first derivatives at the design sites are given and are illustrated in a small example. The issue of experimental design is also discussed, in particular the criterion of maximizing the reduction in entropy..."
            },
            "slug": "Bayesian-design-and-analysis-of-computer-Use-of-in-Morris-Mitchell",
            "title": {
                "fragments": [],
                "text": "Bayesian design and analysis of computer experiments: Use of derivatives in surface prediction"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This article is concerned with the problem of predicting a deterministic response function yo over a multidimensional domain T, given values of yo and all of its first derivatives at a set of design sites (points) in T."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145669956"
                        ],
                        "name": "D. Eby",
                        "slug": "D.-Eby",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Eby",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Eby"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47052903"
                        ],
                        "name": "R. Averill",
                        "slug": "R.-Averill",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Averill",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Averill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2344970"
                        ],
                        "name": "W. Punch",
                        "slug": "W.-Punch",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Punch",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Punch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699648"
                        ],
                        "name": "E. Goodman",
                        "slug": "E.-Goodman",
                        "structuredName": {
                            "firstName": "Erik",
                            "lastName": "Goodman",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Goodman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "For example, Eby et al. [ 15 ] run several genetic algorithms on the low-fidelity model and use the resulting solutions to ‘seed’ the populations of other genetic algorithms run on the high-fidelity model."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8006113,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d86eee54bc6893c2c62047092f62fd88bcde0b4a",
            "isKey": false,
            "numCitedBy": 65,
            "numCiting": 36,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper first describes optimal design of elastic flywheels using an Injection Island Genetic Algorithm (iiGA). An iiGA in combination with a finite element code is used to search for shape variations to optimize the Specific Energy Density of flywheels (SED is the rotational energy stored per unit mass). iiGA’s seek solutions simultaneously at different levels of refinement of the problem representation (and correspondingly different definitions of the fitness function) in separate subpopulations (islands). Solutions are sought first at low levels of refinement with an axisymmetric plane stress finite element code for high-speed exploration of the coarse design space. Next, individuals are injected into populations with a higher level of resolution that uses an axisymmetric three-dimensional finite element model to “ fine-tune” the flywheel designs. Solutions found for these various “coarse” fitness functions on various nodes are injected into nodes that evaluate the ultimate fitness to be optimized Allowing subpopulations to explore different regions of the fitness space simultaneously allows relatively robust and efficient exploration in problems for which fitness evaluations are costly. First the paper treats a greatly simplified case — one for which all two million possible solutions were enumerated, yielding a known global optimum. Then the success and speed of many methods, including several variations of an iiGA, in finding this known global optimum are compared. The iiGA methods always found the global optimum, and the other methods never did. Hybridizing the iiGA with a local search operator and a Threshold Accepting (TA) search at the end of each generation provided the fastest solutions, without sacrificing robustness. Finally, a problem with a large design space is presented and results are compared for a hybrid iiGA to a parallel GA that uses a topological “ring” structure. The hybrid iiGA greatly outperforms the topological “ring” GA in terms of fitness and search efficiency for this given problem."
            },
            "slug": "Evaluation-of-Injection-Island-GA-Performance-on-Eby-Averill",
            "title": {
                "fragments": [],
                "text": "Evaluation of Injection Island GA Performance on Flywheel Design Optimisation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The paper treats a greatly simplified case — one for which all two million possible solutions were enumerated, yielding a known global optimum, and results are compared for a hybrid iiGA to a parallel GA that uses a topological “ring” structure."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2563797"
                        ],
                        "name": "C. D. Perttunen",
                        "slug": "C.-D.-Perttunen",
                        "structuredName": {
                            "firstName": "Cary",
                            "lastName": "Perttunen",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. D. Perttunen"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 40
                            }
                        ],
                        "text": "The algorithms of Elder [16], Perttunen [27] and Stuckman [33] are heuristic extensions of Kushner’s one-dimensional algorithm [19] and, as such, do not use any statistical model at all."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 124842496,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3667bc1e478a8801d98ffafc493fbdf356574c00",
            "isKey": false,
            "numCitedBy": 13,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Proposes the use of the Delaunay triangulation for feasible region division in constrained global optimization. The mathematical foundations for its use, along with the practical considerations for its implementation, are presented. The Delaunay triangulation algorithm is implemented in C.D. Perttunen's nonparametric method (1989). Results of this application are shown through the use of a standard set of test functions. The use of Delaunay triangulation is shown to yield a search in which the scatter plot of search points mimics the contour plot of the objective function under consideration.<<ETX>>"
            },
            "slug": "A-computational-geometric-approach-to-feasible-in-Perttunen",
            "title": {
                "fragments": [],
                "text": "A computational geometric approach to feasible region division in constrained global optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "The use of Delaunay triangulation is proposed for feasible region division in constrained global optimization and shown to yield a search in which the scatter plot of search points mimics the contour plot of the objective function under consideration."
            },
            "venue": {
                "fragments": [],
                "text": "Conference Proceedings 1991 IEEE International Conference on Systems, Man, and Cybernetics"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145228938"
                        ],
                        "name": "W. Welch",
                        "slug": "W.-Welch",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Welch",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Welch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "15121937"
                        ],
                        "name": "R. J. Buck",
                        "slug": "R.-J.-Buck",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Buck",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. J. Buck"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144350237"
                        ],
                        "name": "J. Sacks",
                        "slug": "J.-Sacks",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Sacks",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Sacks"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "10086045"
                        ],
                        "name": "H. Wynn",
                        "slug": "H.-Wynn",
                        "structuredName": {
                            "firstName": "Henry",
                            "lastName": "Wynn",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Wynn"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46842850"
                        ],
                        "name": "T. J. Mitchell",
                        "slug": "T.-J.-Mitchell",
                        "structuredName": {
                            "firstName": "Toby",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. J. Mitchell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34816119"
                        ],
                        "name": "M. Morris",
                        "slug": "M.-Morris",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Morris",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Morris"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Most recently, the focus has been on developing accurate approximations to expensive computer codes and then using these approximations for visualization and optimization [13, 18, 29,  36 ]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 122210162,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "db3e050905faa8850343b36c010962cbb9ef6ef1",
            "isKey": false,
            "numCitedBy": 654,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Many scientific phenomena are now investigated by complex computer models or codes. Given the input values, the code produces one or more outputs via a complex mathematical model. Often the code is expensive to run, and it may be necessary to build a computationally cheaper predictor to enable, for example, optimization of the inputs. If there are many input factors, an initial step in building a predictor is identifying (screening) the active factors. We model the output of the computer code as the realization of a stochastic process. This model has a number of advantages. First, it provides a statistical basis, via the likelihood, for a stepwise algorithm to determine the important factors. Second, it is very flexible, allowing nonlinear and interaction effects to emerge without explicitly modeling such effects. Third, the same data are used for screening and building the predictor, so expensive runs are efficiently used. We illustrate the methodology with two examples, both having 20 input variables. I..."
            },
            "slug": "Screening,-predicting,-and-computer-experiments-Welch-Buck",
            "title": {
                "fragments": [],
                "text": "Screening, predicting, and computer experiments"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This work model the output of the computer code as the realization of a stochastic process, allowing nonlinear and interaction effects to emerge without explicitly modeling such effects."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69968968"
                        ],
                        "name": "C. Currin",
                        "slug": "C.-Currin",
                        "structuredName": {
                            "firstName": "Carla",
                            "lastName": "Currin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Currin"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46842850"
                        ],
                        "name": "T. J. Mitchell",
                        "slug": "T.-J.-Mitchell",
                        "structuredName": {
                            "firstName": "Toby",
                            "lastName": "Mitchell",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. J. Mitchell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34816119"
                        ],
                        "name": "M. Morris",
                        "slug": "M.-Morris",
                        "structuredName": {
                            "firstName": "Max",
                            "lastName": "Morris",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Morris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "52107125"
                        ],
                        "name": "D. Ylvisaker",
                        "slug": "D.-Ylvisaker",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Ylvisaker",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Ylvisaker"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 187,
                                "start": 171
                            }
                        ],
                        "text": "Most recently, the focus has been on developing accurate approximations to expensive computer codes and then using these approximations for visualization and optimization [13, 18, 29, 36]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 55342507,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b5f3fbedaeabd004d9ca30a53300fd2b10c089b1",
            "isKey": false,
            "numCitedBy": 763,
            "numCiting": 48,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract This article is concerned with prediction of a function y(t) over a (multidimensional) domain T, given the function values at a set of “sites” {t (1), t (2), …, t (n)} in T, and with the design, that is, with the selection of those sites. The motivating application is the design and analysis of computer experiments, where t determines the input to a computer model of a physical or behavioral system, and y(t) is a response that is part of the output or is calculated from it. Following a Bayesian formulation, prior uncertainty about the function y is expressed by means of a random function Y, which is taken here to be a Gaussian stochastic process. The mean of the posterior process can be used as the prediction function ŷ(t), and the variance can be used as a measure of uncertainty. This kind of approach has been used previously in Bayesian interpolation and is strongly related to the kriging methods used in geostatistics. Here emphasis is placed on product linear and product cubic correlation func..."
            },
            "slug": "Bayesian-Prediction-of-Deterministic-Functions,-to-Currin-Mitchell",
            "title": {
                "fragments": [],
                "text": "Bayesian Prediction of Deterministic Functions, with Applications to the Design and Analysis of Computer Experiments"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "This article is concerned with prediction of a function y(t) over a (multidimensional) domain T, given the function values at a set of “sites” in T, and with the design, that is, with the selection of those sites."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2075355113"
                        ],
                        "name": "D. Dennis",
                        "slug": "D.-Dennis",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Dennis",
                            "middleNames": [
                                "Mack"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Dennis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2081260358"
                        ],
                        "name": "Coxy",
                        "slug": "Coxy",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Coxy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Coxy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2054222936"
                        ],
                        "name": "Susan",
                        "slug": "Susan",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "Susan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Susan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2098105830"
                        ],
                        "name": "JohnzAbstractAn",
                        "slug": "JohnzAbstractAn",
                        "structuredName": {
                            "firstName": "",
                            "lastName": "JohnzAbstractAn",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "JohnzAbstractAn"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 16,
                                "start": 13
                            }
                        ],
                        "text": "Cox and John [9] use a statistical model, but they optimize the figure of merit by complete enumeration over a fine grid – a procedure obviously limited to one or two dimensions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9899433,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1825c07187eddd2a3dc26b16d525524730a4feb4",
            "isKey": false,
            "numCitedBy": 170,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm for nding global optima using statistical prediction is presented. Assuming a random function model, lower conndence bounds on predicted values are used for sequential selection of evaluation points and as a convergence criterion. Performance comparision with published results on several test functions indicate that the procedure is very eecient in nding the global optimum of a multimodal function, and in terminating with relatively few evaluations. The statistical computations involve linear algebra operations which are readily vectorized and is easy to adapt to parallel processing environments."
            },
            "slug": "SDO-:-A-Statistical-Method-for-Global-Optimization-Dennis-Coxy",
            "title": {
                "fragments": [],
                "text": "SDO : A Statistical Method for Global Optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Performance comparision with published results on several test functions indicate that the procedure is very eecient in nding the global optimum of a multimodal function, and in terminating with relatively few evaluations."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102631067"
                        ],
                        "name": "D. D. Cox",
                        "slug": "D.-D.-Cox",
                        "structuredName": {
                            "firstName": "Denis",
                            "lastName": "Cox",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. D. Cox"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2149717463"
                        ],
                        "name": "S. John",
                        "slug": "S.-John",
                        "structuredName": {
                            "firstName": "Staddon",
                            "lastName": "John",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. John"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Cox and John [ 9 ] use a statistical model, but they optimize the figure of merit by complete enumeration over a fine grid ‐ a procedure obviously limited to one or two dimensions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 122348801,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ea506a0a281eab154fa4d9c99b9c6e6ecb32974c",
            "isKey": false,
            "numCitedBy": 264,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "An algorithm for finding global optima using statistical prediction is presented. Assuming a random function model, lower confidence bounds on predicted values are used for sequential selection of evaluation points and as a convergence criterion. Comparison with published results for several test functions indicates that the procedure is very efficient in finding the global optimum of a multimodal function, and in terminating with relatively few evaluations.<<ETX>>"
            },
            "slug": "A-statistical-method-for-global-optimization-Cox-John",
            "title": {
                "fragments": [],
                "text": "A statistical method for global optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Comparison with published results for several test functions indicates that the procedure is very efficient in finding the global optimum of a multimodal function, and in terminating with relatively few evaluations."
            },
            "venue": {
                "fragments": [],
                "text": "[Proceedings] 1992 IEEE International Conference on Systems, Man, and Cybernetics"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3444394"
                        ],
                        "name": "E. Ziegel",
                        "slug": "E.-Ziegel",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Ziegel",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Ziegel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2158073046"
                        ],
                        "name": "S. Ghosh",
                        "slug": "S.-Ghosh",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Ghosh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ghosh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144532256"
                        ],
                        "name": "C. R. Rao",
                        "slug": "C.-R.-Rao",
                        "structuredName": {
                            "firstName": "C.",
                            "lastName": "Rao",
                            "middleNames": [
                                "Radhakrishna"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. R. Rao"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123767010,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "388c2259c249d4d58f9882e34ddaff0ab6b98990",
            "isKey": false,
            "numCitedBy": 57,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "point out that both volumes are available for $307, which saves $167 over the prices of the individual volumes purchased separately. Ziegel (1998) was generally positive about Part A, other than some criticism of the audacity of a group of chemists who were essentially writing a statistics book. Unlike Part A, which emphasized data collection and focused mostly on standard univariate statistics topics, Part B is mostly concerned with multivariate statistics and their unique applications that arise in chemistry. In these areas, the chemists have made some significant contributions-most of them, in fact. So here in Part B one encounters QSAR (quantitative structure activity relationships), multivariate calibration, sensory data, pharmokinetic models, and many unique chemistry applications of mostly multivariate statistical procedures. These authors’ expertise for this material is unquestionable. Though I credit the chemometricians with some imaginative use of mathematics and statistics, they do not need to present a large body of material on matrix algebra too. So the first chapter, here actually Chapter 29, serves up 52 superfluous pages. Thereafter I cannot fathom any logic in the presentation order of the topics. Chapter 30 is “Cluster Analysis,” offered as straightforward statistics-book stuff. Chapter 31 is “Analysis of Measurement Tables.” Because rows are observations and columns are variables, for these authors in this context this is just typical multivariate data. Mostly their data analysis is ordinary principal components, but nonlinear analysis and three-way tables are discussed too. Chapter 32 deals with a mostly mathematical matrix approach to the analysis of contingency tables, which ends with correspondence factor analysis and log-linear models. Shifting gears, the book next considers “Supervised Pattern Recognition” as Chapter 33. A wide-ranging set of topics begins with discriminant analysis and ends with neural networks. A fairly classical chemistry problem, resolution of curves and mixtures, provides the focus for Chapter 34. First standard factor-analysis methods are presented, followed by a host of variations and related techniques. Continuing to weave its way among topics, the book offers methods for relating many dependent variables to many independent variables as Chapter 35. These methods include Procrustes analysis, canonical correlation, multivariate regression, reduced rank regression, principal-components regression, partial least squares, and continuum regression. Chapter 36, “Multivariate Calibration,” follows naturally as a principal application. Shifting gears again, Chapter 37 is “QSAR,” which relies on methods discussed previously. Totally unrelated by application or techniques is “Analysis of Sensory Data,” Chapter 38. Somewhat more related are the “Pharmokinetic Models” of Chapter 39, a huge chapter mostly devoted to compartmental models. The next direction is “Signal Processing” in Chapter 40. Another lengthy chapter, it gives everything one could want to know about Fourier transforms, ending with a discussion of other deconvolution and transform methodologies. “Kalman Filtering” follows as Chapter 41. The chapter begins with general material on recursive methods. The last part of the book starts with a rather useless chapter on operations research. The last two chapters, which cover artificial intelligence and neural networks, are a fitting conclusion to this modern update of chemometrics. These chapters, like all the others, have great sets of references, mostly to the chemical literature. There is a 12.page index. Part A of the set was a nice addition to my library, but, as a statistician, I did not need it. Topically, Part B, however, is really outstanding and seemingly very complete. Disregarding the few previous negative comments about topics inclusion and chapter organization, this book probably has everything I will ever want to know about chemometrics. Much as I hate to recommend that anyone plunk down $201 for a book, if one is involved in any way with chemometrics applications, its purchase is a must. It is as big as two books, which makes the price seem a little less exorbitant. Thanks to the six authors and Elsevier for undertaking this project and doing it very thoroughly."
            },
            "slug": "Handbook-of-Statistics-13:-Design-and-Analysis-of-Ziegel-Ghosh",
            "title": {
                "fragments": [],
                "text": "Handbook of Statistics 13: Design and Analysis of Experiments"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "49600153"
                        ],
                        "name": "M. Locatelli",
                        "slug": "M.-Locatelli",
                        "structuredName": {
                            "firstName": "Marco",
                            "lastName": "Locatelli",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Locatelli"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Although we have not proved this conjecture, interested readers might consult the work of Marco Locatelli [20] who has proved a similar theorem for a related one-dimensional Bayesian algorithm."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 35799038,
            "fieldsOfStudy": [
                "Mathematics",
                "Computer Science"
            ],
            "id": "b94597ae958ed215bf57035774759fa8e5d89156",
            "isKey": false,
            "numCitedBy": 122,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper Bayesian analysis and Wiener process are used in orderto build an algorithm to solve the problem of globaloptimization.The paper is divided in two main parts.In the first part an already known algorithm is considered: a new (Bayesian)stopping ruleis added to it and some results are given, such asan upper bound for the number of iterations under the new stopping rule.In the second part a new algorithm is introduced in which the Bayesianapproach is exploited not onlyin the choice of the Wiener model but also in the estimationof the parameter σ2 of the Wiener process, whose value appears to bequite crucial.Some results about this algorithm are also given."
            },
            "slug": "Bayesian-Algorithms-for-One-Dimensional-Global-Locatelli",
            "title": {
                "fragments": [],
                "text": "Bayesian Algorithms for One-Dimensional Global Optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "In this paper Bayesian analysis and Wiener process are used in orderto build an algorithm to solve the problem of globaloptimization and the Bayesian approach is exploited not only in the choice of the Wiener model but also in the estimation of the parameter σ2 of theWiener process."
            },
            "venue": {
                "fragments": [],
                "text": "J. Glob. Optim."
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2210196"
                        ],
                        "name": "J. Mockus",
                        "slug": "J.-Mockus",
                        "structuredName": {
                            "firstName": "Jonas",
                            "lastName": "Mockus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Mockus"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 68
                            }
                        ],
                        "text": "This concept can be found in the literature as early as 1978 (e.g., Mockus et al. [24])."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 20
                            }
                        ],
                        "text": "In contrast, Mockus [23] and Zilinskas [37] use simplified statistical models and optimize their figures of merit heuristically using multistart and Monte Carlo methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 42695024,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "82d51fac26b83f50ceb242b45fd6b1c88e94f867",
            "isKey": false,
            "numCitedBy": 277,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper a review of application of Bayesian approach to global and stochastic optimization of continuous multimodal functions is given. Advantages and disadvantages of Bayesian approach (average case analysis), comparing it with more usual minimax approach (worst case analysis) are discussed. New interactive version of software for global optimization is discussed. Practical multidimensional problems of global optimization are considered"
            },
            "slug": "Application-of-Bayesian-approach-to-numerical-of-Mockus",
            "title": {
                "fragments": [],
                "text": "Application of Bayesian approach to numerical methods of global and stochastic optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Advantages and disadvantages of Bayesian approach (average case analysis), comparing it with more usual minimax approach (worst case analysis) are discussed and new interactive version of software for global optimization is discussed."
            },
            "venue": {
                "fragments": [],
                "text": "J. Glob. Optim."
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2106207999"
                        ],
                        "name": "Margaret J. Robertson",
                        "slug": "Margaret-J.-Robertson",
                        "structuredName": {
                            "firstName": "Margaret",
                            "lastName": "Robertson",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Margaret J. Robertson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 187,
                                "start": 171
                            }
                        ],
                        "text": "Most recently, the focus has been on developing accurate approximations to expensive computer codes and then using these approximations for visualization and optimization [13, 18, 29, 36]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 872471,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "0b6e580b00b144fcafcf857fd96cefb6046f0e1c",
            "isKey": false,
            "numCitedBy": 15460,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "THE DESIGN AND ANALYSIS OF EXPERIMENTS. By Oscar Kempthorne. New York, John Wiley and Sons, Inc., 1952. 631 pp. $8.50. This book by a teacher of statistics (as well as a consultant for \"experimenters\") is a comprehensive study of the philosophical background for the statistical design of experiment. It is necessary to have some facility with algebraic notation and manipulation to be able to use the volume intelligently. The problems are presented from the theoretical point of view, without such practical examples as would be helpful for those not acquainted with mathematics. The mathematical justification for the techniques is given. As a somewhat advanced treatment of the design and analysis of experiments, this volume will be interesting and helpful for many who approach statistics theoretically as well as practically. With emphasis on the \"why,\" and with description given broadly, the author relates the subject matter to the general theory of statistics and to the general problem of experimental inference. MARGARET J. ROBERTSON"
            },
            "slug": "The-Design-and-Analysis-of-Experiments-Robertson",
            "title": {
                "fragments": [],
                "text": "The Design and Analysis of Experiments"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This book by a teacher of statistics (as well as a consultant for \"experimenters\") is a comprehensive study of the philosophical background for the statistical design of experiment."
            },
            "venue": {
                "fragments": [],
                "text": "The Yale Journal of Biology and Medicine"
            },
            "year": 1953
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40698158"
                        ],
                        "name": "A. Booker",
                        "slug": "A.-Booker",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Booker",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Booker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1800149"
                        ],
                        "name": "J. Dennis",
                        "slug": "J.-Dennis",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Dennis",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Dennis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1704765"
                        ],
                        "name": "P. Frank",
                        "slug": "P.-Frank",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Frank",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Frank"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144582109"
                        ],
                        "name": "D. Serafini",
                        "slug": "D.-Serafini",
                        "structuredName": {
                            "firstName": "D.",
                            "lastName": "Serafini",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Serafini"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2776399"
                        ],
                        "name": "V. Torczon",
                        "slug": "V.-Torczon",
                        "structuredName": {
                            "firstName": "Virginia",
                            "lastName": "Torczon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Torczon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15715358,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1b3b70b404f410fb86927406f1596bb212f79fe8",
            "isKey": false,
            "numCitedBy": 118,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper presents results for a 31 variable helicopter rotor design example. Results are given for several numerical methods. This is a brief description of a portion of the Boeing/IBM/Rice University collaboration whose purpose is to develop effective numerical methods for managing the use of approximation concepts or response surface methodology in design optimization."
            },
            "slug": "Optimization-Using-Surrogate-Objectives-on-a-Test-Booker-Dennis",
            "title": {
                "fragments": [],
                "text": "Optimization Using Surrogate Objectives on a Helicopter Test Example"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "A portion of the Boeing/IBM/Rice University collaboration whose purpose is to develop effective numerical methods for managing the use of approximation concepts or response surface methodology in design optimization is described."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2709542"
                        ],
                        "name": "M. D. McKay",
                        "slug": "M.-D.-McKay",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "McKay",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. D. McKay"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1867489"
                        ],
                        "name": "R. Beckman",
                        "slug": "R.-Beckman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Beckman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Beckman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47102013"
                        ],
                        "name": "W. Conover",
                        "slug": "W.-Conover",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Conover",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Conover"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "This motivates the use of space-filling designs such as Latin hypercubes [ 22 ], an example of which is the 21-point design in Figure 3b."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 40429700,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "d23dc281afd418772c3dea9b056013471882ac15",
            "isKey": false,
            "numCitedBy": 6826,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Two types of sampling plans are examined as alternatives to simple random sampling in Monte Carlo studies. These plans are shown to be improvements over simple random sampling with respect to variance for a class of estimators which includes the sample mean and the empirical distribution function."
            },
            "slug": "A-Comparison-of-Three-Methods-for-Selecting-Values-McKay-Beckman",
            "title": {
                "fragments": [],
                "text": "A Comparison of Three Methods for Selecting Values of Input Variables in the Analysis of Output From a Computer Code"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "Two types of sampling plans are examined as alternatives to simple random sampling in Monte Carlo studies and are shown to be improvements oversimple random sampling with respect to variance for a class of estimators which includes the sample mean and the empirical distribution function."
            },
            "venue": {
                "fragments": [],
                "text": "Technometrics"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3269957"
                        ],
                        "name": "A. Zilinskas",
                        "slug": "A.-Zilinskas",
                        "structuredName": {
                            "firstName": "Antanas",
                            "lastName": "Zilinskas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Zilinskas"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 43,
                                "start": 39
                            }
                        ],
                        "text": "In contrast, Mockus [23] and Zilinskas [37] use simplified statistical models and optimize their figures of merit heuristically using multistart and Monte Carlo methods."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 43055364,
            "fieldsOfStudy": [
                "Engineering"
            ],
            "id": "6d036bc27098ff01f19790a764b12bff02aa53fc",
            "isKey": false,
            "numCitedBy": 80,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "A review of statistical models for global optimization is presented. Rationality of the search for a global minimum is formulated axiomatically and the features of the corresponding algorithm are derived from the axioms. Furthermore the results of some applications of the proposed algorithm are presented and the perspectives of the approach are discussed."
            },
            "slug": "A-review-of-statistical-models-for-global-Zilinskas",
            "title": {
                "fragments": [],
                "text": "A review of statistical models for global optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "Rationality of the search for a global minimum is formulated axiomatically and the features of the corresponding algorithm are derived from the axioms."
            },
            "venue": {
                "fragments": [],
                "text": "J. Glob. Optim."
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145163055"
                        ],
                        "name": "F. Gao",
                        "slug": "F.-Gao",
                        "structuredName": {
                            "firstName": "Feng",
                            "lastName": "Gao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Gao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144350237"
                        ],
                        "name": "J. Sacks",
                        "slug": "J.-Sacks",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Sacks",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Sacks"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145228938"
                        ],
                        "name": "W. Welch",
                        "slug": "W.-Welch",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Welch",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Welch"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 160,
                                "start": 156
                            }
                        ],
                        "text": "Although we have not discussed it here, the DACE methodology can also handle data collected using physical experiments where there is both signal and noise [17]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 125038035,
            "fieldsOfStudy": [
                "Environmental Science"
            ],
            "id": "9295326ac754c8cebc2f54070a2a24ba27af6572",
            "isKey": false,
            "numCitedBy": 21,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Ozone in the planetary boundary layer of the troposphere is considered harmful to plants and human health. Surface ozone levels are determined by the strengths of sources and precursor emissions and by meteorological conditions. Therefore, assessing ozone trends is complicated by meteorological variability. Ozone data in the Chicago area over the period 1981 to 1991 were studied. In this article, ozone concentration was modeled as a year effect plus a nonparametric model in meteorological variables. In this way, long-term trend over the 11-year period was separated from the effects of meteorology. Estimation of long-term trend is important for assessing the effectiveness of environmental policy. The indications were that there was a decrease in ozone levels once the meteorological effects on ozone had been adjusted for. The models based on this technique were also shown to provide predictions that closely match the actual ozone levels."
            },
            "slug": "Predicting-Urban-Ozone-Levels-and-Trends-with-Gao-Sacks",
            "title": {
                "fragments": [],
                "text": "Predicting Urban Ozone Levels and Trends with Semiparametric Modeling"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48393332"
                        ],
                        "name": "N. Cressie",
                        "slug": "N.-Cressie",
                        "structuredName": {
                            "firstName": "Noel",
                            "lastName": "Cressie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Cressie"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 123535355,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "dbb473e904b301bff880c34e6c6d22e9001bbbc1",
            "isKey": false,
            "numCitedBy": 1402,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "In this article, kriging is equated with spatial optimal linear prediction, where the unknown random-process mean is estimated with the best linear unbiased estimator. This allows early appearances of (spatial) prediction techniques to be assessed in terms of how close they came to kriging."
            },
            "slug": "The-origins-of-kriging-Cressie",
            "title": {
                "fragments": [],
                "text": "The origins of kriging"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1774321"
                        ],
                        "name": "B. Betrò",
                        "slug": "B.-Betrò",
                        "structuredName": {
                            "firstName": "Bruno",
                            "lastName": "Betrò",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Betrò"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 19324834,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3cd93c773acfd220b6bcc496ba103deba1eaa294",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper reviews methods which have been proposed for solving global optimization problems in the framework of the Bayesian paradigm."
            },
            "slug": "Bayesian-methods-in-global-optimization-Betrò",
            "title": {
                "fragments": [],
                "text": "Bayesian methods in global optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "This paper reviews methods which have been proposed for solving global optimization problems in the framework of the Bayesian paradigm and concludes that these methods should be considered as stand-alone approaches to optimization."
            },
            "venue": {
                "fragments": [],
                "text": "J. Glob. Optim."
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47913669"
                        ],
                        "name": "G. Matheron",
                        "slug": "G.-Matheron",
                        "structuredName": {
                            "firstName": "G.",
                            "lastName": "Matheron",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Matheron"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 128762998,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "0dc2f3ea76b9627497b8c7b1dba92c4037c5d4f0",
            "isKey": false,
            "numCitedBy": 4022,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Knowledge of ore grades and ore reserves as well as error estimation of these values, is fundamental for mining engineers and mining geologists. Until now no appropriate scientific approach to those estimation problems has existed: geostatistics, the principles of which are summarized in this paper, constitutes a new science leading to such an approach. The author criticizes classical statistical methods still in use, and shows some of the main results given by geostatistics. Any ore deposit evaluation as well as proper decision of starting mining operations should be preceded by a geostatistical investigation which may avoid economic failures."
            },
            "slug": "Principles-of-geostatistics-Matheron",
            "title": {
                "fragments": [],
                "text": "Principles of geostatistics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2256718"
                        ],
                        "name": "W. Press",
                        "slug": "W.-Press",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Press",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Press"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48590121"
                        ],
                        "name": "S. Teukolsky",
                        "slug": "S.-Teukolsky",
                        "structuredName": {
                            "firstName": "Saul",
                            "lastName": "Teukolsky",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Teukolsky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35046585"
                        ],
                        "name": "B. Flannery",
                        "slug": "B.-Flannery",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Flannery",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Flannery"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2608024"
                        ],
                        "name": "W. Vetterling",
                        "slug": "W.-Vetterling",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Vetterling",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Vetterling"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "To date, we have addressed these difficulties by using the singular value decomposition of R and zeroing small singular values, as suggested in the book Numerical Recipes [28]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 59788770,
            "fieldsOfStudy": [
                "Philosophy"
            ],
            "id": "ccba09e5f4706f1c19181a6ffcc247bf7fc60bef",
            "isKey": false,
            "numCitedBy": 8407,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Note: Includes bibliographical references and index.- Diskette v 2.04, 3.5'' (720k) for IBM PC, PS/2 and compatibles [DOS] Reference Record created on 2004-09-07, modified on 2016-08-08"
            },
            "slug": "Numerical-Recipes:-FORTRAN-Press-Teukolsky",
            "title": {
                "fragments": [],
                "text": "Numerical Recipes: FORTRAN"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "The Diskette v 2.04, 3.5'' (720k) for IBM PC, PS/2 and compatibles [DOS] Reference Record created on 2004-09-07, modified on 2016-08-08."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 251,
                                "start": 247
                            }
                        ],
                        "text": "It has become common to call the stochastic process model in Equations (1)–(3) the ‘DACE stochastic process model’, where ‘DACE’ is an acronym for ‘Design and Analysis of Computer Experiments’, the title of the paper that popularized the approach [29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 56
                            }
                        ],
                        "text": "(A full derivation of this formula can also be found in [29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 53,
                                "start": 49
                            }
                        ],
                        "text": "The derivation of this predictor can be found in [29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 187,
                                "start": 171
                            }
                        ],
                        "text": "Most recently, the focus has been on developing accurate approximations to expensive computer codes and then using these approximations for visualization and optimization [13, 18, 29, 36]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 212,
                                "start": 208
                            }
                        ],
                        "text": "The derivation of the predictor̂ y(x) as the ‘best linear unbiased predictor’ is not especially intuitive or enlightening and, for that reason, we have not repeated it here (interested readers can find it in [29])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 68
                            }
                        ],
                        "text": "280] and in the literature on kriging [12] and computer experiments [29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Design and analysis of computer experiments (with discussion)"
            },
            "venue": {
                "fragments": [],
                "text": "Statistical"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 113,
                                "start": 109
                            }
                        ],
                        "text": "In Figure 3a we show the contours of the Branin function, a well-known test function for global optimization [14]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 126
                            }
                        ],
                        "text": "To illustrate these ideas, Figure 6 shows the diagnostic tests for a DACE model fit to the Goldstein–Price (GP) test function [14]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 45
                            }
                        ],
                        "text": "We now apply EGO to four test functions from [14]: the Branin function, the Goldstein–Price function, the Hartman 3 function and the Hartman 6 function."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": true,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The global optimisation problem: an introduction, in L.C.W"
            },
            "venue": {
                "fragments": [],
                "text": "Dixon and G.P. Szego (eds.),"
            },
            "year": 1978
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "16834559"
                        ],
                        "name": "H. Theil",
                        "slug": "H.-Theil",
                        "structuredName": {
                            "firstName": "Henri",
                            "lastName": "Theil",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Theil"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 158155120,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "170668e0bd66f54edb0edd9dd3b22faf6380482d",
            "isKey": false,
            "numCitedBy": 2891,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Principles-of-econometrics-Theil",
            "title": {
                "fragments": [],
                "text": "Principles of econometrics"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1971
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37782208"
                        ],
                        "name": "Mike Rees",
                        "slug": "Mike-Rees",
                        "structuredName": {
                            "firstName": "Mike",
                            "lastName": "Rees",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mike Rees"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48393332"
                        ],
                        "name": "N. Cressie",
                        "slug": "N.-Cressie",
                        "structuredName": {
                            "firstName": "Noel",
                            "lastName": "Cressie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Cressie"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 125139256,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "8de150393b15477cb9f45d3da105f39fd35b8700",
            "isKey": false,
            "numCitedBy": 5023,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "5.-Statistics-for-Spatial-Data-Rees-Cressie",
            "title": {
                "fragments": [],
                "text": "5. Statistics for Spatial Data"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4442593"
                        ],
                        "name": "J. V. Ver Hoef",
                        "slug": "J.-V.-Ver-Hoef",
                        "structuredName": {
                            "firstName": "Jay",
                            "lastName": "Ver Hoef",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. V. Ver Hoef"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48393332"
                        ],
                        "name": "N. Cressie",
                        "slug": "N.-Cressie",
                        "structuredName": {
                            "firstName": "Noel",
                            "lastName": "Cressie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Cressie"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 79
                            }
                        ],
                        "text": "In the mathematical geology literature, this approach is known as ‘co-kriging’ [12, 35]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 118731954,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "1ddf89c446570a9db9fd83da3c34ca8039b0d6ee",
            "isKey": false,
            "numCitedBy": 86,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Multivariable-spatial-prediction-Hoef-Cressie",
            "title": {
                "fragments": [],
                "text": "Multivariable spatial prediction"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2256718"
                        ],
                        "name": "W. Press",
                        "slug": "W.-Press",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Press",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Press"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 67339093,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "43e6c055f8d01166ae43bcf08218ca2ecb60fe34",
            "isKey": false,
            "numCitedBy": 4450,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Book-Review-Numerical-Recipes-in-Pascal-the-Art-of-Press",
            "title": {
                "fragments": [],
                "text": "Book-Review - Numerical Recipes in Pascal - the Art of Scientific Computing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1989
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3085659"
                        ],
                        "name": "H. Kushner",
                        "slug": "H.-Kushner",
                        "structuredName": {
                            "firstName": "Harold",
                            "lastName": "Kushner",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Kushner"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 131,
                                "start": 127
                            }
                        ],
                        "text": "The algorithms of Elder [16], Perttunen [27] and Stuckman [33] are heuristic extensions of Kushner’s one-dimensional algorithm [19] and, as such, do not use any statistical model at all."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 65,
                                "start": 61
                            }
                        ],
                        "text": "It dates back to a seminal article by Harold Kushner in 1964 [19] and has since been pursued by many authors [e."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 62599010,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "64c0650c3c559e540ad7fb73c4deadf340da474b",
            "isKey": false,
            "numCitedBy": 802,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "A-New-Method-of-Locating-the-Maximum-Point-of-an-in-Kushner",
            "title": {
                "fragments": [],
                "text": "A New Method of Locating the Maximum Point of an Arbitrary Multipeak Curve in the Presence of Noise"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1815604"
                        ],
                        "name": "M. Schonlau",
                        "slug": "M.-Schonlau",
                        "structuredName": {
                            "firstName": "Matthias",
                            "lastName": "Schonlau",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Schonlau"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145228938"
                        ],
                        "name": "W. Welch",
                        "slug": "W.-Welch",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Welch",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Welch"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2118096690"
                        ],
                        "name": "Donald R. Jones",
                        "slug": "Donald-R.-Jones",
                        "structuredName": {
                            "firstName": "Donald",
                            "lastName": "Jones",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Donald R. Jones"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "We have already implemented one way to do this with some success [ 32 ], but there are other approaches that might be better and need to be tried."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 58806889,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "aa2555e746b4d157a52d9bc4c63c9b386a720016",
            "isKey": false,
            "numCitedBy": 388,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Global-versus-local-search-in-constrained-of-models-Schonlau-Welch",
            "title": {
                "fragments": [],
                "text": "Global versus local search in constrained optimization of computer models"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "98024745"
                        ],
                        "name": "S. Addelman",
                        "slug": "S.-Addelman",
                        "structuredName": {
                            "firstName": "Sidney",
                            "lastName": "Addelman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Addelman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [],
                        "text": "Box et al. [ 8 ]) may wonder how these techniques are related to DACE."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 60675884,
            "fieldsOfStudy": [
                "Education"
            ],
            "id": "a6ea80458c94147504cc2b4d3981f9f3b5364e73",
            "isKey": false,
            "numCitedBy": 5259,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Statistics-for-experimenters-Addelman",
            "title": {
                "fragments": [],
                "text": "Statistics for experimenters"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Statistical designs and integral approximation"
            },
            "venue": {
                "fragments": [],
                "text": "Proceedings of the Twelfth Biennial Seminar of the Canadian Mathematical Congress"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Global modeling for optimization, Boeing Information and Support Services"
            },
            "venue": {
                "fragments": [],
                "text": "Global modeling for optimization, Boeing Information and Support Services"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 163,
                                "start": 159
                            }
                        ],
                        "text": "In statistics, the approach began in the early 1970s out of a general interest in approximating integrals and other hard-to-compute ‘functionals’ of functions [30]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Statistical designs and integral approximation, in R. Pyke (ed.),Proceedings of the Twelfth Biennial Seminar of the Canadian Mathematical Congress"
            },
            "venue": {
                "fragments": [],
                "text": "pp. 115–136,"
            },
            "year": 1970
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Principles of geostatistics,  Economic Geology58: 1246–1266"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "eds.,Handbook of Global Optimization"
            },
            "venue": {
                "fragments": [],
                "text": "Stochastic methods,"
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[6], working on applications at Boeing Corporation, develop a procedure called BLGS based on a statistical model but do not use a figure of merit to select search points."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Global modeling for optimization, Boeing Information and Support Services, Technical Report ISSTECH-95-032"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Global versus local search in constrained optimization of computer models , to appear in"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 187,
                                "start": 171
                            }
                        ],
                        "text": "Most recently, the focus has been on developing accurate approximations to expensive computer codes and then using these approximations for visualization and optimization [13, 18, 29, 36]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Screening, predicting, and computer"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1992
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 65
                            }
                        ],
                        "text": "We have already implemented one way to do this with some success [32], but there are other approaches that might be better and need to be tried."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Global versus local search in constrained optimization of computer"
            },
            "venue": {
                "fragments": [],
                "text": "Institute of Mathematical Statistics. Also available as Technical Report RR-97-11, Institute for Improvement in Quality and Productivity,"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The global optimisation problem: an introduction"
            },
            "venue": {
                "fragments": [],
                "text": "Towards Global Optimisation"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The application of Bayesian methods for seeking the extremum"
            },
            "venue": {
                "fragments": [],
                "text": "Towards Global Optimisation"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[15] run several genetic algorithms on the low-fidelity model and use the resulting solutions to ‘seed’ the populations of other genetic algorithms run on the high-fidelity model."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Evaluation of injection island GA performance on flywheel design optimization, in I.C. Parmee (ed.), A aptive Computing in Design and Manufacture"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Geostatistics, The American Statistician 43: 197–202. See also the comment on this article by G. Wahba and the reply by N"
            },
            "venue": {
                "fragments": [],
                "text": "The American Statistician"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A new approach to the synthesis of optimal smoothing and prediction systems"
            },
            "venue": {
                "fragments": [],
                "text": "Mathematical Optimization Techniques"
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The application of Bayesian methods for seeking the extremum, in L.C.W"
            },
            "venue": {
                "fragments": [],
                "text": "Dixon and G.P. Szego (eds.),"
            },
            "year": 1978
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Geostatistics,  The American Statistician 43: 197–202"
            },
            "venue": {
                "fragments": [],
                "text": "See also the comment on this article by G. Wahba and the reply by N. Cressie"
            },
            "year": 1989
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 188,
                                "start": 184
                            }
                        ],
                        "text": "The exponentph is related to the smoothness of the function in coordinate direction h, with ph = 2 corresponding to smooth functions and values near 1 corresponding to less smoothness [26]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A new approach to the synthesis of optimal smoothing and prediction systems, in R. Bellman, (ed.),  Mathematical Optimization Techniques"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1963
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 77,
                                "start": 73
                            }
                        ],
                        "text": "This motivates the use of space-filling designs such as Latin hypercubes [22], an example of which is the 21-point design in Figure 3b."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "A comparison of three methods for selecting values of input variables in the analysis of output from a computer"
            },
            "venue": {
                "fragments": [],
                "text": "code, Technometrics"
            },
            "year": 1979
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 11,
            "methodology": 19
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 51,
        "totalPages": 6
    },
    "page_url": "https://www.semanticscholar.org/paper/Efficient-Global-Optimization-of-Expensive-Jones-Schonlau/daa63f57c3fbe994c4356f8d986a22e696e776d2?sort=total-citations"
}