{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17265929,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "df93596d4ed71d2863532c063c4c693711216abf",
            "isKey": false,
            "numCitedBy": 1819,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we introduce Factorization Machines (FM) which are a new model class that combines the advantages of Support Vector Machines (SVM) with factorization models. Like SVMs, FMs are a general predictor working with any real valued feature vector. In contrast to SVMs, FMs model all interactions between variables using factorized parameters. Thus they are able to estimate interactions even in problems with huge sparsity (like recommender systems) where SVMs fail. We show that the model equation of FMs can be calculated in linear time and thus FMs can be optimized directly. So unlike nonlinear SVMs, a transformation in the dual form is not necessary and the model parameters can be estimated directly without the need of any support vector in the solution. We show the relationship to SVMs and the advantages of FMs for parameter estimation in sparse settings. On the other hand there are many different factorization models like matrix factorization, parallel factor analysis or specialized models like SVD++, PITF or FPMC. The drawback of these models is that they are not applicable for general prediction tasks but work only with special input data. Furthermore their model equations and optimization algorithms are derived individually for each task. We show that FMs can mimic these models just by specifying the input data (i.e. the feature vectors). This makes FMs easily applicable even for users without expert knowledge in factorization models."
            },
            "slug": "Factorization-Machines-Rendle",
            "title": {
                "fragments": [],
                "text": "Factorization Machines"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "Factorization Machines (FM) are introduced which are a new model class that combines the advantages of Support Vector Machines (SVM) with factorization models and can mimic these models just by specifying the input data (i.e. the feature vectors)."
            },
            "venue": {
                "fragments": [],
                "text": "2010 IEEE International Conference on Data Mining"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 15176324,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "067207b701fc1d068e43782b9842a390edd1ea58",
            "isKey": false,
            "numCitedBy": 50,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "Many factorization models like matrix or tensor factorization have been proposed for the important application of recommender systems. The success of such factorization models depends largely on the choice of good values for the regularization parameters. Without a careful selection they result in poor prediction quality as they either underfit or overfit the data. Regularization values are typically determined by an expensive search that requires learning the model parameters several times: once for each tuple of candidate values for the regularization parameters. In this paper, we present a new method that adapts the regularization automatically while training the model parameters. To achieve this, we optimize simultaneously for two criteria: (1) as usual the model parameters for the regularized objective and (2) the regularization of future parameter updates for the best predictive quality on a validation set. We develop this for the generic model class of Factorization Machines which subsumes a wide variety of factorization models. We show empirically, that the advantages of our adaptive regularization method compared to expensive hyperparameter search do not come to the price of worse predictive quality. In total with our method, learning regularization parameters is as easy as learning model parameters and thus there is no need for any time-consuming search of regularization values because they are found on-the-fly. This makes our method highly attractive for practical use."
            },
            "slug": "Learning-recommender-systems-with-adaptive-Rendle",
            "title": {
                "fragments": [],
                "text": "Learning recommender systems with adaptive regularization"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Learning regularization parameters is as easy as learning model parameters and thus there is no need for any time-consuming search of regularization values because they are found on-the-fly, which makes this method highly attractive for practical use."
            },
            "venue": {
                "fragments": [],
                "text": "WSDM '12"
            },
            "year": 2012
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1825333"
                        ],
                        "name": "C. Freudenthaler",
                        "slug": "C.-Freudenthaler",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Freudenthaler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Freudenthaler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2382247"
                        ],
                        "name": "Zeno Gantner",
                        "slug": "Zeno-Gantner",
                        "structuredName": {
                            "firstName": "Zeno",
                            "lastName": "Gantner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zeno Gantner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388781075"
                        ],
                        "name": "L. Schmidt-Thieme",
                        "slug": "L.-Schmidt-Thieme",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Schmidt-Thieme",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Schmidt-Thieme"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10795036,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "db16e908246f32b60a6e0a8e27093aa145fbb1ed",
            "isKey": false,
            "numCitedBy": 3865,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Item recommendation is the task of predicting a personalized ranking on a set of items (e.g. websites, movies, products). In this paper, we investigate the most common scenario with implicit feedback (e.g. clicks, purchases). There are many methods for item recommendation from implicit feedback like matrix factorization (MF) or adaptive k-nearest-neighbor (kNN). Even though these methods are designed for the item prediction task of personalized ranking, none of them is directly optimized for ranking. In this paper we present a generic optimization criterion BPR-Opt for personalized ranking that is the maximum posterior estimator derived from a Bayesian analysis of the problem. We also provide a generic learning algorithm for optimizing models with respect to BPR-Opt. The learning method is based on stochastic gradient descent with bootstrap sampling. We show how to apply our method to two state-of-the-art recommender models: matrix factorization and adaptive kNN. Our experiments indicate that for the task of personalized ranking our optimization method outperforms the standard learning techniques for MF and kNN. The results show the importance of optimizing models for the right criterion."
            },
            "slug": "BPR:-Bayesian-Personalized-Ranking-from-Implicit-Rendle-Freudenthaler",
            "title": {
                "fragments": [],
                "text": "BPR: Bayesian Personalized Ranking from Implicit Feedback"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper presents a generic optimization criterion BPR-Opt for personalized ranking that is the maximum posterior estimator derived from a Bayesian analysis of the problem and provides a generic learning algorithm for optimizing models with respect to B PR-Opt."
            },
            "venue": {
                "fragments": [],
                "text": "UAI"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145124475"
                        ],
                        "name": "R. Salakhutdinov",
                        "slug": "R.-Salakhutdinov",
                        "structuredName": {
                            "firstName": "Ruslan",
                            "lastName": "Salakhutdinov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Salakhutdinov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714004"
                        ],
                        "name": "A. Mnih",
                        "slug": "A.-Mnih",
                        "structuredName": {
                            "firstName": "Andriy",
                            "lastName": "Mnih",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Mnih"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 467086,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e19971e7d100386b9b4cf4ea1a0782b62fe036e5",
            "isKey": false,
            "numCitedBy": 3875,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Many existing approaches to collaborative filtering can neither handle very large datasets nor easily deal with users who have very few ratings. In this paper we present the Probabilistic Matrix Factorization (PMF) model which scales linearly with the number of observations and, more importantly, performs well on the large, sparse, and very imbalanced Netflix dataset. We further extend the PMF model to include an adaptive prior on the model parameters and show how the model capacity can be controlled automatically. Finally, we introduce a constrained version of the PMF model that is based on the assumption that users who have rated similar sets of movies are likely to have similar preferences. The resulting model is able to generalize considerably better for users with very few ratings. When the predictions of multiple PMF models are linearly combined with the predictions of Restricted Boltzmann Machines models, we achieve an error rate of 0.8861, that is nearly 7% better than the score of Netflix's own system."
            },
            "slug": "Probabilistic-Matrix-Factorization-Salakhutdinov-Mnih",
            "title": {
                "fragments": [],
                "text": "Probabilistic Matrix Factorization"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The Probabilistic Matrix Factorization (PMF) model is presented, which scales linearly with the number of observations and performs well on the large, sparse, and very imbalanced Netflix dataset and is extended to include an adaptive prior on the model parameters."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145124475"
                        ],
                        "name": "R. Salakhutdinov",
                        "slug": "R.-Salakhutdinov",
                        "structuredName": {
                            "firstName": "Ruslan",
                            "lastName": "Salakhutdinov",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Salakhutdinov"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1714004"
                        ],
                        "name": "A. Mnih",
                        "slug": "A.-Mnih",
                        "structuredName": {
                            "firstName": "Andriy",
                            "lastName": "Mnih",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Mnih"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14937958,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5262fe8369992259be27165ccd09d1d31c7a4def",
            "isKey": false,
            "numCitedBy": 1429,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Low-rank matrix approximation methods provide one of the simplest and most effective approaches to collaborative filtering. Such models are usually fitted to data by finding a MAP estimate of the model parameters, a procedure that can be performed efficiently even on very large datasets. However, unless the regularization parameters are tuned carefully, this approach is prone to overfitting because it finds a single point estimate of the parameters. In this paper we present a fully Bayesian treatment of the Probabilistic Matrix Factorization (PMF) model in which model capacity is controlled automatically by integrating over all model parameters and hyperparameters. We show that Bayesian PMF models can be efficiently trained using Markov chain Monte Carlo methods by applying them to the Netflix dataset, which consists of over 100 million movie ratings. The resulting models achieve significantly higher prediction accuracy than PMF models trained using MAP estimation."
            },
            "slug": "Bayesian-probabilistic-matrix-factorization-using-Salakhutdinov-Mnih",
            "title": {
                "fragments": [],
                "text": "Bayesian probabilistic matrix factorization using Markov chain Monte Carlo"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This paper presents a fully Bayesian treatment of the Probabilistic Matrix Factorization (PMF) model in which model capacity is controlled automatically by integrating over all model parameters and hyperparameters and shows that Bayesian PMF models can be efficiently trained using Markov chain Monte Carlo methods by applying them to the Netflix dataset."
            },
            "venue": {
                "fragments": [],
                "text": "ICML '08"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2425143"
                        ],
                        "name": "I. Pilászy",
                        "slug": "I.-Pilászy",
                        "structuredName": {
                            "firstName": "István",
                            "lastName": "Pilászy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Pilászy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2871013"
                        ],
                        "name": "Dávid Zibriczky",
                        "slug": "Dávid-Zibriczky",
                        "structuredName": {
                            "firstName": "Dávid",
                            "lastName": "Zibriczky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dávid Zibriczky"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1754164"
                        ],
                        "name": "D. Tikk",
                        "slug": "D.-Tikk",
                        "structuredName": {
                            "firstName": "Domonkos",
                            "lastName": "Tikk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tikk"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 156
                            }
                        ],
                        "text": "…factorization model, many learning and inference approaches have been studied among \nthem, (stochastic) gradient descent, alternating least-squares (e.g., [Pil´ aszy et al. 2010]), variational \nBayes [Lim and Teh 2007], and Markov Chain Monto Carlo (MCMC) inference [Salakhutdinov and Mnih 2008a]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 115,
                                "start": 96
                            }
                        ],
                        "text": "For MF, many different variations and learning approaches have been proposed, for exam­ple, ALS \n[Pil´ aszy et al. 2010], MCMC [Salakhutdinov and Mnih 2008a], Variational Bayes [Lim and Teh 2007; Stern \net al. 2009], but mostly SGD variants (e.g., [Koren 2008; Salakhutdinov and Mnih 2008b])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1816937,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5ccd14d553d547384d7a848a6a532e65f1fd6746",
            "isKey": false,
            "numCitedBy": 169,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Alternating least squares (ALS) is a powerful matrix factorization (MF) algorithm for both explicit and implicit feedback based recommender systems. As shown in many articles, increasing the number of latent factors (denoted by K) boosts the prediction accuracy of MF based recommender systems, including ALS as well. The price of the better accuracy is paid by the increased running time: the running time of the original version of ALS is proportional to K3. Yet, the running time of model building can be important in recommendation systems; if the model cannot keep up with the changing item portfolio and/or user profile, the prediction accuracy can be degraded.\n In this paper we present novel and fast ALS variants both for the implicit and explicit feedback datasets, which offers better trade-off between running time and accuracy. Due to the significantly lower computational complexity of the algorithm - linear in terms of K - the model being generated under the same amount of time is more accurate, since the faster training enables to build model with more latent factors. We demonstrate the efficiency of our ALS variants on two datasets using two performance measures, RMSE and average relative position (ARP), and show that either a significantly more accurate model can be generated under the same amount of time or a model with similar prediction accuracy can be created faster; for explicit feedback the speed-up factor can be even 5-10."
            },
            "slug": "Fast-als-based-matrix-factorization-for-explicit-Pilászy-Zibriczky",
            "title": {
                "fragments": [],
                "text": "Fast als-based matrix factorization for explicit and implicit feedback datasets"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "Novel and fast ALS variants both for the implicit and explicit feedback datasets, which offers better trade-off between running time and accuracy and either a significantly more accurate model can be generated under the same amount of time or a model with similar prediction accuracy can be created faster."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388781075"
                        ],
                        "name": "L. Schmidt-Thieme",
                        "slug": "L.-Schmidt-Thieme",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Schmidt-Thieme",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Schmidt-Thieme"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 207177737,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bf2b10e9a3bb73499666facf376918e8c275734e",
            "isKey": false,
            "numCitedBy": 663,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Tagging plays an important role in many recent websites. Recommender systems can help to suggest a user the tags he might want to use for tagging a specific item. Factorization models based on the Tucker Decomposition (TD) model have been shown to provide high quality tag recommendations outperforming other approaches like PageRank, FolkRank, collaborative filtering, etc. The problem with TD models is the cubic core tensor resulting in a cubic runtime in the factorization dimension for prediction and learning.\n In this paper, we present the factorization model PITF (Pairwise Interaction Tensor Factorization) which is a special case of the TD model with linear runtime both for learning and prediction. PITF explicitly models the pairwise interactions between users, items and tags. The model is learned with an adaption of the Bayesian personalized ranking (BPR) criterion which originally has been introduced for item recommendation. Empirically, we show on real world datasets that this model outperforms TD largely in runtime and even can achieve better prediction quality. Besides our lab experiments, PITF has also won the ECML/PKDD Discovery Challenge 2009 for graph-based tag recommendation."
            },
            "slug": "Pairwise-interaction-tensor-factorization-for-tag-Rendle-Schmidt-Thieme",
            "title": {
                "fragments": [],
                "text": "Pairwise interaction tensor factorization for personalized tag recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "The factorization model PITF (Pairwise Interaction Tensor Factorization) is presented which is a special case of the TD model with linear runtime both for learning and prediction and shows that this model outperforms TD largely in runtime and even can achieve better prediction quality."
            },
            "venue": {
                "fragments": [],
                "text": "WSDM '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1825333"
                        ],
                        "name": "C. Freudenthaler",
                        "slug": "C.-Freudenthaler",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Freudenthaler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Freudenthaler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388781075"
                        ],
                        "name": "L. Schmidt-Thieme",
                        "slug": "L.-Schmidt-Thieme",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Schmidt-Thieme",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Schmidt-Thieme"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 207178809,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "50d85cb114f7c5e779a6772f2931e77dddd54a5e",
            "isKey": false,
            "numCitedBy": 1340,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems are an important component of many websites. Two of the most popular approaches are based on matrix factorization (MF) and Markov chains (MC). MF methods learn the general taste of a user by factorizing the matrix over observed user-item preferences. On the other hand, MC methods model sequential behavior by learning a transition graph over items that is used to predict the next action based on the recent actions of a user. In this paper, we present a method bringing both approaches together. Our method is based on personalized transition graphs over underlying Markov chains. That means for each user an own transition matrix is learned - thus in total the method uses a transition cube. As the observations for estimating the transitions are usually very limited, our method factorizes the transition cube with a pairwise interaction model which is a special case of the Tucker Decomposition. We show that our factorized personalized MC (FPMC) model subsumes both a common Markov chain and the normal matrix factorization model. For learning the model parameters, we introduce an adaption of the Bayesian Personalized Ranking (BPR) framework for sequential basket data. Empirically, we show that our FPMC model outperforms both the common matrix factorization and the unpersonalized MC model both learned with and without factorization."
            },
            "slug": "Factorizing-personalized-Markov-chains-for-Rendle-Freudenthaler",
            "title": {
                "fragments": [],
                "text": "Factorizing personalized Markov chains for next-basket recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper introduces an adaption of the Bayesian Personalized Ranking (BPR) framework for sequential basket data and shows that the FPMC model outperforms both the common matrix factorization and the unpersonalized MC model both learned with and without factorization."
            },
            "venue": {
                "fragments": [],
                "text": "WWW '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2946343"
                        ],
                        "name": "Yew Jin Lim",
                        "slug": "Yew-Jin-Lim",
                        "structuredName": {
                            "firstName": "Yew",
                            "lastName": "Lim",
                            "middleNames": [
                                "Jin"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yew Jin Lim"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 214,
                                "start": 211
                            }
                        ],
                        "text": "For the basic matrix factorization model, many learning and inference approaches have been studied among \nthem, (stochastic) gradient descent, alternating least-squares (e.g., [Pil´ aszy et al. 2010]), variational \nBayes [Lim and Teh 2007], and Markov Chain Monto Carlo (MCMC) inference [Salakhutdinov and Mnih 2008a]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 154,
                                "start": 151
                            }
                        ],
                        "text": "This article summarizes the recent research on FMs, including learning algorithms \nbased on stochastic gradient descent, alternating least-squares, and Bayesian infer­ence using MCMC. \nFMs and all presented algorithms are available in the publicly available software tool LIBFM."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 46
                            }
                        ],
                        "text": "Markov Chain Monte Carlo (MCMC) Inference \nThe Bayesian model used so far can be seen in Figure 2."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 97
                            }
                        ],
                        "text": "Both ALS and SGD learn the best parameters 8 \nwhich are used for a point estimate of y. MCMC is a Bayesian inference technique that generates the distribution \nof y by sampling."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 23,
                                "start": 20
                            }
                        ],
                        "text": "AND MNIH, A. 2008a. Bayesian probabilistic matrix factorization \nusing Markov chain Monte Carlo."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "Bayesian Data Analysis 2nd Ed."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 5
                            }
                        ],
                        "text": "BPR: Bayesian person­alized ranking from implicit feedback."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 12
                            }
                        ],
                        "text": "Variational Bayesian approach \nto movie rating prediction."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 37
                            }
                        ],
                        "text": "Temporal collabora­tive .ltering with \nBayesian probabilistic tensor factorization."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 174,
                                "start": 171
                            }
                        ],
                        "text": "LIBFM is a software implementation for factorization machines that features \nstochastic gradient de­scent (SGD) and alternating least-squares (ALS) optimization, as well as Bayesian \ninference using Markov Chain Monto Carlo (MCMC)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 190,
                                "start": 174
                            }
                        ],
                        "text": "For MF, many different variations and learning approaches have been proposed, for exam­ple, ALS \n[Pil´ aszy et al. 2010], MCMC [Salakhutdinov and Mnih 2008a], Variational Bayes [Lim and Teh 2007; Stern \net al. 2009], but mostly SGD variants (e.g., [Koren 2008; Salakhutdinov and Mnih 2008b])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 29
                            }
                        ],
                        "text": "Matchbox: Large-scale \nonline Bayesian recommen­dations."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 214,
                                "start": 198
                            }
                        ],
                        "text": "…factorization model, many learning and inference approaches have been studied among \nthem, (stochastic) gradient descent, alternating least-squares (e.g., [Pil´ aszy et al. 2010]), variational \nBayes [Lim and Teh 2007], and Markov Chain Monto Carlo (MCMC) inference [Salakhutdinov and Mnih 2008a]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 31,
                                "start": 28
                            }
                        ],
                        "text": "For integration \nof 8H , the Bayesian FM model is extended (Figure 2) by placing distributions on the priors (hyperprior \ndistributions)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "Bayesian \nfactorization machines."
                    },
                    "intents": []
                }
            ],
            "corpusId": 11503152,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b2fcb1888472ff11980c7b47991eedc3ec07a181",
            "isKey": true,
            "numCitedBy": 137,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Singular value decomposition (SVD) is a matrix decomposition algorithm that returns the optimal (in the sense of squared error) low-rank decomposition of a matrix. SVD has found widespread use across a variety of machine learning applications, where its output is interpreted as compact and informative representations of data. The Netflix Prize challenge, and collaborative filtering in general, is an ideal application for SVD, since the data is a matrix of ratings given by users to movies. It is thus not surprising to observe that most currently successful teams use SVD, either with an extension, or to interpolate with results returned by other algorithms. Unfortunately SVD can easily overfit due to the extreme data sparsity of the matrix in the Netflix Prize challenge, and care must be taken to regularize properly. In this paper, we propose a Bayesian approach to alleviate overfitting in SVD, where priors are introduced and all parameters are integrated out using variational inference. We show experimentally that this gives significantly improved results over vanilla SVD. For truncated SVDs of rank 5, 10, 20, and 30, our proposed Bayesian approach achieves 2.2% improvement over a näıve approach, 1.6% improvement over a gradient descent approach dealing with unobserved entries properly, and 0.9% improvement over a maximum a posteriori (MAP) approach."
            },
            "slug": "Variational-Bayesian-Approach-to-Movie-Rating-Lim",
            "title": {
                "fragments": [],
                "text": "Variational Bayesian Approach to Movie Rating Prediction"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A Bayesian approach is proposed to alleviate overfitting in SVD, where priors are introduced and all parameters are integrated out using variational inference, and it is shown that this gives significantly improved results over vanilla SVD."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2382247"
                        ],
                        "name": "Zeno Gantner",
                        "slug": "Zeno-Gantner",
                        "structuredName": {
                            "firstName": "Zeno",
                            "lastName": "Gantner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zeno Gantner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1825333"
                        ],
                        "name": "C. Freudenthaler",
                        "slug": "C.-Freudenthaler",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Freudenthaler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Freudenthaler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388781075"
                        ],
                        "name": "L. Schmidt-Thieme",
                        "slug": "L.-Schmidt-Thieme",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Schmidt-Thieme",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Schmidt-Thieme"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 207189080,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1683ffc189d16b616131c300f45af87602d211f7",
            "isKey": false,
            "numCitedBy": 517,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "The situation in which a choice is made is an important information for recommender systems. Context-aware recommenders take this information into account to make predictions. So far, the best performing method for context-aware rating prediction in terms of predictive accuracy is Multiverse Recommendation based on the Tucker tensor factorization model. However this method has two drawbacks: (1) its model complexity is exponential in the number of context variables and polynomial in the size of the factorization and (2) it only works for categorical context variables. On the other hand there is a large variety of fast but specialized recommender methods which lack the generality of context-aware methods. We propose to apply Factorization Machines (FMs) to model contextual information and to provide context-aware rating predictions. This approach results in fast context-aware recommendations because the model equation of FMs can be computed in linear time both in the number of context variables and the factorization size. For learning FMs, we develop an iterative optimization method that analytically finds the least-square solution for one parameter given the other ones. Finally, we show empirically that our approach outperforms Multiverse Recommendation in prediction quality and runtime."
            },
            "slug": "Fast-context-aware-recommendations-with-machines-Rendle-Gantner",
            "title": {
                "fragments": [],
                "text": "Fast context-aware recommendations with factorization machines"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "This work proposes to apply Factorization Machines (FMs) to model contextual information and to provide context-aware rating predictions and shows empirically that this approach outperforms Multiverse Recommendation in prediction quality and runtime."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068236719"
                        ],
                        "name": "L. Xiong",
                        "slug": "L.-Xiong",
                        "structuredName": {
                            "firstName": "Liang",
                            "lastName": "Xiong",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Xiong"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1683647"
                        ],
                        "name": "X. Chen",
                        "slug": "X.-Chen",
                        "structuredName": {
                            "firstName": "X.",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1734755"
                        ],
                        "name": "Tzu-Kuo Huang",
                        "slug": "Tzu-Kuo-Huang",
                        "structuredName": {
                            "firstName": "Tzu-Kuo",
                            "lastName": "Huang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tzu-Kuo Huang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1753432"
                        ],
                        "name": "J. Schneider",
                        "slug": "J.-Schneider",
                        "structuredName": {
                            "firstName": "Jeff",
                            "lastName": "Schneider",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schneider"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143712374"
                        ],
                        "name": "J. Carbonell",
                        "slug": "J.-Carbonell",
                        "structuredName": {
                            "firstName": "Jaime",
                            "lastName": "Carbonell",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Carbonell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1173916,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ee4129e6187302b1d1fd1aa7604d9bee40a865cf",
            "isKey": false,
            "numCitedBy": 638,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "Real-world relational data are seldom stationary, yet traditional collaborative filtering algorithms generally rely on this assumption. Motivated by our sales prediction problem, we propose a factor-based algorithm that is able to take time into account. By introducing additional factors for time, we formalize this problem as a tensor factorization with a special constraint on the time dimension. Further, we provide a fully Bayesian treatment to avoid tuning parameters and achieve automatic model complexity control. To learn the model we develop an efficient sampling procedure that is capable of analyzing large-scale data sets. This new algorithm, called Bayesian Probabilistic Tensor Factorization (BPTF), is evaluated on several real-world problems including sales prediction and movie recommendation. Empirical results demonstrate the superiority of our temporal model."
            },
            "slug": "Temporal-Collaborative-Filtering-with-Bayesian-Xiong-Chen",
            "title": {
                "fragments": [],
                "text": "Temporal Collaborative Filtering with Bayesian Probabilistic Tensor Factorization"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work proposes a factor-based algorithm that is able to take time into account, and provides a fully Bayesian treatment to avoid tuning parameters and achieve automatic model complexity control."
            },
            "venue": {
                "fragments": [],
                "text": "SDM"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145421648"
                        ],
                        "name": "G. Takács",
                        "slug": "G.-Takács",
                        "structuredName": {
                            "firstName": "Gábor",
                            "lastName": "Takács",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Takács"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2425143"
                        ],
                        "name": "I. Pilászy",
                        "slug": "I.-Pilászy",
                        "structuredName": {
                            "firstName": "István",
                            "lastName": "Pilászy",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Pilászy"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2026153"
                        ],
                        "name": "B. Németh",
                        "slug": "B.-Németh",
                        "structuredName": {
                            "firstName": "Bottyán",
                            "lastName": "Németh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Németh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1754164"
                        ],
                        "name": "D. Tikk",
                        "slug": "D.-Tikk",
                        "structuredName": {
                            "firstName": "Domonkos",
                            "lastName": "Tikk",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Tikk"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 203,
                                "start": 185
                            }
                        ],
                        "text": "(45) mm m2 j=1 j=1 j=1 jp>j If implicit feedback is used as input \nfor {l1,...,lm}, the FM just sketched is almost the same as the SVD++ model [Koren 2008; Salakhutdinov \nand Mnih 2008b; Tak´ acs et al. 2009]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 134,
                                "start": 116
                            }
                        ],
                        "text": "The most successful approaches \non Net.ix are based on matrix factorization (e.g., [Jahrer et al. 2010; Koren 2009a; Tak´ acs et al. \n2009])."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 9238574,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "55830e7ad66bad06de9684ed44a48e50ae145c5a",
            "isKey": false,
            "numCitedBy": 502,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "The collaborative filtering (CF) using known user ratings of items has proved to be effective for predicting user preferences in item selection. This thriving subfield of machine learning became popular in the late 1990s with the spread of online services that use recommender systems, such as Amazon, Yahoo! Music, and Netflix. CF approaches are usually designed to work on very large data sets. Therefore the scalability of the methods is crucial. In this work, we propose various scalable solutions that are validated against the Netflix Prize data set, currently the largest publicly available collection. First, we propose various matrix factorization (MF) based techniques. Second, a neighbor correction method for MF is outlined, which alloys the global perspective of MF and the localized property of neighbor based approaches efficiently. In the experimentation section, we first report on some implementation issues, and we suggest on how parameter optimization can be performed efficiently for MFs. We then show that the proposed scalable approaches compare favorably with existing ones in terms of prediction accuracy and/or required training time. Finally, we report on some experiments performed on MovieLens and Jester data sets."
            },
            "slug": "Scalable-Collaborative-Filtering-Approaches-for-Takács-Pilászy",
            "title": {
                "fragments": [],
                "text": "Scalable Collaborative Filtering Approaches for Large Recommender Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "This work proposes various scalable solutions that are validated against the Netflix Prize data set, currently the largest publicly available collection of CF techniques, and proposes various matrix factorization (MF) based techniques."
            },
            "venue": {
                "fragments": [],
                "text": "J. Mach. Learn. Res."
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2382247"
                        ],
                        "name": "Zeno Gantner",
                        "slug": "Zeno-Gantner",
                        "structuredName": {
                            "firstName": "Zeno",
                            "lastName": "Gantner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zeno Gantner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2282727"
                        ],
                        "name": "Lucas Drumond",
                        "slug": "Lucas-Drumond",
                        "structuredName": {
                            "firstName": "Lucas",
                            "lastName": "Drumond",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lucas Drumond"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1825333"
                        ],
                        "name": "C. Freudenthaler",
                        "slug": "C.-Freudenthaler",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Freudenthaler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Freudenthaler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388781075"
                        ],
                        "name": "L. Schmidt-Thieme",
                        "slug": "L.-Schmidt-Thieme",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Schmidt-Thieme",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Schmidt-Thieme"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8955774,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f471df4f220b830657914106c88efd5132608288",
            "isKey": false,
            "numCitedBy": 281,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Cold-start scenarios in recommender systems are situations in which no prior events, like ratings or clicks, are known for certain users or items. To compute predictions in such cases, additional information about users (user attributes, e.g. gender, age, geographical location, occupation) and items (item attributes, e.g. genres, product categories, keywords) must be used. We describe a method that maps such entity (e.g. user or item) attributes to the latent features of a matrix (or higher-dimensional) factorization model. With such mappings, the factors of a MF model trained by standard techniques can be applied to the new-user and the new-item problem, while retaining its advantages, in particular speed and predictive accuracy. We use the mapping concept to construct an attribute-aware matrix factorization model for item recommendation from implicit, positive-only feedback. Experiments on the new-item problem show that this approach provides good predictive accuracy, while the prediction time only grows by a constant factor."
            },
            "slug": "Learning-Attribute-to-Feature-Mappings-for-Gantner-Drumond",
            "title": {
                "fragments": [],
                "text": "Learning Attribute-to-Feature Mappings for Cold-Start Recommendations"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This work uses the mapping concept to construct an attribute-aware matrix factorization model for item recommendation from implicit, positive-only feedback, and shows that this approach provides good predictive accuracy, while the prediction time only grows by a constant factor."
            },
            "venue": {
                "fragments": [],
                "text": "2010 IEEE International Conference on Data Mining"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "69968411"
                        ],
                        "name": "Arkadiusz Paterek",
                        "slug": "Arkadiusz-Paterek",
                        "structuredName": {
                            "firstName": "Arkadiusz",
                            "lastName": "Paterek",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Arkadiusz Paterek"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 4181849,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f732d0f69fe4e84a95c32706b28b9e4ef1753c61",
            "isKey": false,
            "numCitedBy": 785,
            "numCiting": 9,
            "paperAbstract": {
                "fragments": [],
                "text": "A key part of a recommender system is a collaborative filtering algorithm predicting users’ preferences for items. In this paper we describe different efficient collaborative filtering techniques and a framework for combining them to obtain a good prediction. The methods described in this paper are the most important parts of a solution predicting users’ preferences for movies with error rate 7.04% better on the Netflix Prize dataset than the reference algorithm Netflix Cinematch. The set of predictors used includes algorithms suggested by Netflix Prize contestants: regularized singular value decomposition of data with missing values, K-means, postprocessing SVD with KNN. We propose extending the set of predictors with the following methods: addition of biases to the regularized SVD, postprocessing SVD with kernel ridge regression, using a separate linear model for each movie, and using methods similar to the regularized SVD, but with fewer parameters. All predictors and selected 2-way interactions between them are combined using linear regression on a holdout set."
            },
            "slug": "Improving-regularized-singular-value-decomposition-Paterek",
            "title": {
                "fragments": [],
                "text": "Improving regularized singular value decomposition for collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "Different efficient collaborative filtering techniques and a framework for combining them to obtain a good prediction are described, predicting users’ preferences for movies with error rate 7.04% better on the Netflix Prize dataset than the reference algorithm Netflix Cinematch."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2596058"
                        ],
                        "name": "D. Agarwal",
                        "slug": "D.-Agarwal",
                        "structuredName": {
                            "firstName": "Deepak",
                            "lastName": "Agarwal",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Agarwal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34252531"
                        ],
                        "name": "Bee-Chung Chen",
                        "slug": "Bee-Chung-Chen",
                        "structuredName": {
                            "firstName": "Bee-Chung",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bee-Chung Chen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17484284,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "82a3074be5297bad6b279c006c7a5507f8c54555",
            "isKey": false,
            "numCitedBy": 534,
            "numCiting": 27,
            "paperAbstract": {
                "fragments": [],
                "text": "We propose a novel latent factor model to accurately predict response for large scale dyadic data in the presence of features. Our approach is based on a model that predicts response as a multiplicative function of row and column latent factors that are estimated through separate regressions on known row and column features. In fact, our model provides a single unified framework to address both cold and warm start scenarios that are commonplace in practical applications like recommender systems, online advertising, web search, etc. We provide scalable and accurate model fitting methods based on Iterated Conditional Mode and Monte Carlo EM algorithms. We show our model induces a stochastic process on the dyadic space with kernel (covariance) given by a polynomial function of features. Methods that generalize our procedure to estimate factors in an online fashion for dynamic applications are also considered. Our method is illustrated on benchmark datasets and a novel content recommendation application that arises in the context of Yahoo! Front Page. We report significant improvements over several commonly used methods on all datasets."
            },
            "slug": "Regression-based-latent-factor-models-Agarwal-Chen",
            "title": {
                "fragments": [],
                "text": "Regression-based latent factor models"
            },
            "tldr": {
                "abstractSimilarityScore": 71,
                "text": "A novel latent factor model to accurately predict response for large scale dyadic data in the presence of features is proposed and induces a stochastic process on the dyadic space with kernel given by a polynomial function of features."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1713164"
                        ],
                        "name": "Alexandros Karatzoglou",
                        "slug": "Alexandros-Karatzoglou",
                        "structuredName": {
                            "firstName": "Alexandros",
                            "lastName": "Karatzoglou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alexandros Karatzoglou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478897"
                        ],
                        "name": "X. Amatriain",
                        "slug": "X.-Amatriain",
                        "structuredName": {
                            "firstName": "X.",
                            "lastName": "Amatriain",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "X. Amatriain"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2666397"
                        ],
                        "name": "L. Baltrunas",
                        "slug": "L.-Baltrunas",
                        "structuredName": {
                            "firstName": "Linas",
                            "lastName": "Baltrunas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Baltrunas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145709776"
                        ],
                        "name": "Nuria Oliver",
                        "slug": "Nuria-Oliver",
                        "structuredName": {
                            "firstName": "Nuria",
                            "lastName": "Oliver",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nuria Oliver"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 5908065,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b1c56e4049dcafe6f6752cbbeb889e975ea8e94e",
            "isKey": false,
            "numCitedBy": 766,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Context has been recognized as an important factor to consider in personalized Recommender Systems. However, most model-based Collaborative Filtering approaches such as Matrix Factorization do not provide a straightforward way of integrating context information into the model. In this work, we introduce a Collaborative Filtering method based on Tensor Factorization, a generalization of Matrix Factorization that allows for a flexible and generic integration of contextual information by modeling the data as a User-Item-Context N-dimensional tensor instead of the traditional 2D User-Item matrix. In the proposed model, called Multiverse Recommendation, different types of context are considered as additional dimensions in the representation of the data as a tensor. The factorization of this tensor leads to a compact model of the data which can be used to provide context-aware recommendations.\n We provide an algorithm to address the N-dimensional factorization, and show that the Multiverse Recommendation improves upon non-contextual Matrix Factorization up to 30% in terms of the Mean Absolute Error (MAE). We also compare to two state-of-the-art context-aware methods and show that Tensor Factorization consistently outperforms them both in semi-synthetic and real-world data - improvements range from 2.5% to more than 12% depending on the data. Noticeably, our approach outperforms other methods by a wider margin whenever more contextual information is available."
            },
            "slug": "Multiverse-recommendation:-n-dimensional-tensor-for-Karatzoglou-Amatriain",
            "title": {
                "fragments": [],
                "text": "Multiverse recommendation: n-dimensional tensor factorization for context-aware collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "This work introduces a Collaborative Filtering method based on Tensor Factorization, a generalization of Matrix Factorization that allows for a flexible and generic integration of contextual information by modeling the data as a User-Item-Context N-dimensional tensor instead of the traditional 2D User- Item matrix."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1825333"
                        ],
                        "name": "C. Freudenthaler",
                        "slug": "C.-Freudenthaler",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Freudenthaler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Freudenthaler"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18707748,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a8b9ff1c5b8600ef63baa5de0999a0d986661d7d",
            "isKey": false,
            "numCitedBy": 34,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "This work presents simple and fast structured Bayesian learning for matrix and tensor factorization models. An unblocked Gibbs sampler is proposed for factorization machines (FM) which are a general class of latent variable models subsuming matrix, tensor and many other factorization models. We empirically show on the large Netflix challenge dataset that Bayesian FM are fast, scalable and more accurate than state-of-the-art factorization models."
            },
            "slug": "Bayesian-Factorization-Machines-Freudenthaler",
            "title": {
                "fragments": [],
                "text": "Bayesian Factorization Machines"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "It is empirically show on the large Netflix challenge dataset that Bayesian FM are fast, scalable and more accurate than state-of-the-art factorization models."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 207168823,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cf6f83fcce274606bf0264c59d1c78a30c9c9d18",
            "isKey": false,
            "numCitedBy": 3612,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems provide users with personalized suggestions for products or services. These systems often rely on Collaborating Filtering (CF), where past transactions are analyzed in order to establish connections between users and products. The two more successful approaches to CF are latent factor models, which directly profile both users and products, and neighborhood models, which analyze similarities between products or users. In this work we introduce some innovations to both approaches. The factor and neighborhood models can now be smoothly merged, thereby building a more accurate combined model. Further accuracy improvements are achieved by extending the models to exploit both explicit and implicit feedback by the users. The methods are tested on the Netflix data. Results are better than those previously published on that dataset. In addition, we suggest a new evaluation metric, which highlights the differences among methods, based on their performance at a top-K recommendation task."
            },
            "slug": "Factorization-meets-the-neighborhood:-a-filtering-Koren",
            "title": {
                "fragments": [],
                "text": "Factorization meets the neighborhood: a multifaceted collaborative filtering model"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "The factor and neighborhood models can now be smoothly merged, thereby building a more accurate combined model and a new evaluation metric is suggested, which highlights the differences among methods, based on their performance at a top-K recommendation task."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1950178"
                        ],
                        "name": "M. Jahrer",
                        "slug": "M.-Jahrer",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Jahrer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Jahrer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3295659"
                        ],
                        "name": "Andreas Töscher",
                        "slug": "Andreas-Töscher",
                        "structuredName": {
                            "firstName": "Andreas",
                            "lastName": "Töscher",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Andreas Töscher"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2073142"
                        ],
                        "name": "R. Legenstein",
                        "slug": "R.-Legenstein",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Legenstein",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Legenstein"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 11298650,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "282c1c7b2722e50150de9debe2d4916af4528fff",
            "isKey": false,
            "numCitedBy": 279,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "We analyze the application of ensemble learning to recommender systems on the Netflix Prize dataset. For our analysis we use a set of diverse state-of-the-art collaborative filtering (CF) algorithms, which include: SVD, Neighborhood Based Approaches, Restricted Boltzmann Machine, Asymmetric Factor Model and Global Effects. We show that linearly combining (blending) a set of CF algorithms increases the accuracy and outperforms any single CF algorithm. Furthermore, we show how to use ensemble methods for blending predictors in order to outperform a single blending algorithm. The dataset and the source code for the ensemble blending are available online."
            },
            "slug": "Combining-predictions-for-accurate-recommender-Jahrer-Töscher",
            "title": {
                "fragments": [],
                "text": "Combining predictions for accurate recommender systems"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is shown that linearly combining a set of CF algorithms increases the accuracy and outperforms any single CF algorithm, and how to use ensemble methods for blending predictors in order to outperform a single blending algorithm."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144988795"
                        ],
                        "name": "Hao Ma",
                        "slug": "Hao-Ma",
                        "structuredName": {
                            "firstName": "Hao",
                            "lastName": "Ma",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hao Ma"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145310663"
                        ],
                        "name": "Irwin King",
                        "slug": "Irwin-King",
                        "structuredName": {
                            "firstName": "Irwin",
                            "lastName": "King",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Irwin King"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1785083"
                        ],
                        "name": "Michael R. Lyu",
                        "slug": "Michael-R.-Lyu",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Lyu",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael R. Lyu"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 18801471,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "232c84bcdd6e92379825de06f73bdb506aeb895f",
            "isKey": false,
            "numCitedBy": 139,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems have been well studied and developed, both in academia and in industry recently. However, traditional recommender systems assume that all the users are independent and identically distributed; this assumption ignores the connections among users, which is not consistent with the real-world observations where we always turn to our trusted friends for recommendations. Aiming at modeling recommender systems more accurately and realistically, we propose a novel probabilistic factor analysis framework which naturally fuses the users' tastes and their trusted friends' favors together. The proposed framework is quite general, and it can also be applied to pure user-item rating matrix even if we do not have explicit social trust information among users. In this framework, we coin the term social trust ensemble to represent the formulation of the social trust restrictions on the recommender systems. The complexity analysis indicates that our approach can be applied to very large datasets since it scales linearly with the number of observations, while the experimental results show that our method outperforms state-of-the-art approaches."
            },
            "slug": "Learning-to-recommend-with-explicit-and-implicit-Ma-King",
            "title": {
                "fragments": [],
                "text": "Learning to recommend with explicit and implicit social relations"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A novel probabilistic factor analysis framework which naturally fuses the users' tastes and their trusted friends' favors together and outperforms state-of-the-art approaches at modeling recommender systems more accurately and realistically."
            },
            "venue": {
                "fragments": [],
                "text": "TIST"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47547090"
                        ],
                        "name": "David H. Stern",
                        "slug": "David-H.-Stern",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Stern",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David H. Stern"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3234984"
                        ],
                        "name": "R. Herbrich",
                        "slug": "R.-Herbrich",
                        "structuredName": {
                            "firstName": "Ralf",
                            "lastName": "Herbrich",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Herbrich"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1686971"
                        ],
                        "name": "T. Graepel",
                        "slug": "T.-Graepel",
                        "structuredName": {
                            "firstName": "Thore",
                            "lastName": "Graepel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Graepel"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 209,
                                "start": 192
                            }
                        ],
                        "text": "For MF, many different variations and learning approaches have been proposed, for exam­ple, ALS \n[Pil´ aszy et al. 2010], MCMC [Salakhutdinov and Mnih 2008a], Variational Bayes [Lim and Teh 2007; Stern \net al. 2009], but mostly SGD variants (e.g., [Koren 2008; Salakhutdinov and Mnih 2008b])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 15614767,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "abfb3352a188c7f3e7ad518dcf0dbcff480bcec4",
            "isKey": false,
            "numCitedBy": 274,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a probabilistic model for generating personalised recommendations of items to users of a web service. The Matchbox system makes use of content information in the form of user and item meta data in combination with collaborative filtering information from previous user behavior in order to predict the value of an item for a user. Users and items are represented by feature vectors which are mapped into a low-dimensional `trait space' in which similarity is measured in terms of inner products. The model can be trained from different types of feedback in order to learn user-item preferences. Here we present three alternatives: direct observation of an absolute rating each user gives to some items, observation of a binary preference (like/ don't like) and observation of a set of ordinal ratings on a user-specific scale. Efficient inference is achieved by approximate message passing involving a combination of Expectation Propagation (EP) and Variational Message Passing. We also include a dynamics model which allows an item's popularity, a user's taste or a user's personal rating scale to drift over time. By using Assumed-Density Filtering (ADF) for training, the model requires only a single pass through the training data. This is an on-line learning algorithm capable of incrementally taking account of new data so the system can immediately reflect the latest user preferences. We evaluate the performance of the algorithm on the MovieLens and Netflix data sets consisting of approximately 1,000,000 and 100,000,000 ratings respectively. This demonstrates that training the model using the on-line ADF approach yields state-of-the-art performance with the option of improving performance further if computational resources are available by performing multiple EP passes over the training data."
            },
            "slug": "Matchbox:-large-scale-online-bayesian-Stern-Herbrich",
            "title": {
                "fragments": [],
                "text": "Matchbox: large scale online bayesian recommendations"
            },
            "tldr": {
                "abstractSimilarityScore": 58,
                "text": "This work presents a probabilistic model for generating personalised recommendations of items to users of a web service capable of incrementally taking account of new data so the system can immediately reflect the latest user preferences and demonstrates that training the model using the on-line ADF approach yields state-of-the-art performance."
            },
            "venue": {
                "fragments": [],
                "text": "WWW '09"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 717520,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6a43d42e8fa276afbc68ecacbbbdf783837bf47e",
            "isKey": false,
            "numCitedBy": 679,
            "numCiting": 38,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems provide users with personalized suggestions for products or services. These systems often rely on collaborating filtering (CF), where past transactions are analyzed in order to establish connections between users and products. The most common approach to CF is based on neighborhood models, which originate from similarities between products or users. In this work we introduce a new neighborhood model with an improved prediction accuracy. Unlike previous approaches that are based on heuristic similarities, we model neighborhood relations by minimizing a global cost function. Further accuracy improvements are achieved by extending the model to exploit both explicit and implicit feedback by the users. Past models were limited by the need to compute all pairwise similarities between items or users, which grow quadratically with input size. In particular, this limitation vastly complicates adopting user similarity models, due to the typical large number of users. Our new model solves these limitations by factoring the neighborhood model, thus making both item-item and user-user implementations scale linearly with the size of the data. The methods are tested on the Netflix data, with encouraging results."
            },
            "slug": "Factor-in-the-neighbors:-Scalable-and-accurate-Koren",
            "title": {
                "fragments": [],
                "text": "Factor in the neighbors: Scalable and accurate collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A new neighborhood model with an improved prediction accuracy is introduced, which model neighborhood relations by minimizing a global cost function and makes both item-item and user-user implementations scale linearly with the size of the data."
            },
            "venue": {
                "fragments": [],
                "text": "TKDD"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2801698"
                        ],
                        "name": "A. Gunawardana",
                        "slug": "A.-Gunawardana",
                        "structuredName": {
                            "firstName": "Asela",
                            "lastName": "Gunawardana",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Gunawardana"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719532"
                        ],
                        "name": "Guy Shani",
                        "slug": "Guy-Shani",
                        "structuredName": {
                            "firstName": "Guy",
                            "lastName": "Shani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Guy Shani"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 699657,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "074468eae8b2bf4215ace0260fd0f37769003fab",
            "isKey": false,
            "numCitedBy": 568,
            "numCiting": 46,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems are now popular both commercially and in the research community, where many algorithms have been suggested for providing recommendations. These algorithms typically perform differently in various domains and tasks. Therefore, it is important from the research perspective, as well as from a practical view, to be able to decide on an algorithm that matches the domain and the task of interest. The standard way to make such decisions is by comparing a number of algorithms offline using some evaluation metric. Indeed, many evaluation metrics have been suggested for comparing recommendation algorithms. The decision on the proper evaluation metric is often critical, as each metric may favor a different algorithm. In this paper we review the proper construction of offline experiments for deciding on the most appropriate algorithm. We discuss three important tasks of recommender systems, and classify a set of appropriate well known evaluation metrics for each task. We demonstrate how using an improper evaluation metric can lead to the selection of an improper algorithm for the task of interest. We also discuss other important considerations when designing offline experiments."
            },
            "slug": "A-Survey-of-Accuracy-Evaluation-Metrics-of-Tasks-Gunawardana-Shani",
            "title": {
                "fragments": [],
                "text": "A Survey of Accuracy Evaluation Metrics of Recommendation Tasks"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper reviews the proper construction of offline experiments for deciding on the most appropriate algorithm, and discusses three important tasks of recommender systems, and classify a set of appropriate well known evaluation metrics for each task."
            },
            "venue": {
                "fragments": [],
                "text": "J. Mach. Learn. Res."
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2666397"
                        ],
                        "name": "L. Baltrunas",
                        "slug": "L.-Baltrunas",
                        "structuredName": {
                            "firstName": "Linas",
                            "lastName": "Baltrunas",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Baltrunas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40169260"
                        ],
                        "name": "F. Ricci",
                        "slug": "F.-Ricci",
                        "structuredName": {
                            "firstName": "Francesco",
                            "lastName": "Ricci",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Ricci"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 9240995,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bfe08ad63d46159e79547029e2ef3f20069677de",
            "isKey": false,
            "numCitedBy": 161,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Collaborative Filtering (CF) recommendations are computed by leveraging a historical data set of users' ratings for items. It assumes that the users' previously recorded ratings can help in predicting future ratings. This has been validated extensively, but in some domains item ratings can be influenced by contextual conditions, such as the time or the goal of the item consumption. This type of information is not exploited by standard CF models. This paper introduces and analyzes a novel pre-filtering technique for context-aware CF called item splitting. In this approach, the ratings of certain items are split, according to the value of an item-dependent contextual condition. Each split item generates two fictitious items that are used in the prediction algorithm instead of the original one. We evaluated this approach on real world and semi-synthetic data sets using matrix-factorization and nearest neighbor CF algorithms. We show that item splitting can be beneficial and its performance depends on the item selection method and on the influence of the contextual variables on the item ratings."
            },
            "slug": "Context-based-splitting-of-item-ratings-in-Baltrunas-Ricci",
            "title": {
                "fragments": [],
                "text": "Context-based splitting of item ratings in collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper introduces and analyzes a novel pre-filtering technique for context-aware CF called item splitting, in which the ratings of certain items are split, according to the value of an item-dependent contextual condition."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '09"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680188"
                        ],
                        "name": "T. Joachims",
                        "slug": "T.-Joachims",
                        "structuredName": {
                            "firstName": "Thorsten",
                            "lastName": "Joachims",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Joachims"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 60502770,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "bb99668d4df98a3f6ff0b9fa3402e09008f22e2c",
            "isKey": false,
            "numCitedBy": 1861,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "Training a support vector machine (SVM) leads to a quadratic optimization problem with bound constraints and one linear equality constraint. Despite the fact that this type of problem is well understood, there are many issues to be considered in designing an SVM learner. In particular, for large learning tasks with many training examples, oo-the-shelf optimization techniques for general quadratic programs quickly become intractable in their memory and time requirements. SV M light1 is an implementation of an SVM learner which addresses the problem of large tasks. This chapter presents algorithmic and computational results developed for SV M light V2.0, which make large-scale SVM training more practical. The results give guidelines for the application of SVMs to large domains."
            },
            "slug": "Making-large-scale-support-vector-machine-learning-Joachims",
            "title": {
                "fragments": [],
                "text": "Making large-scale support vector machine learning practical"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This chapter presents algorithmic and computational results developed for SV M light V2.0, which make large-scale SVM training more practical and give guidelines for the application of SVMs to large domains."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1768416"
                        ],
                        "name": "N. Liu",
                        "slug": "N.-Liu",
                        "structuredName": {
                            "firstName": "Nathan",
                            "lastName": "Liu",
                            "middleNames": [
                                "Nan"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Liu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152290618"
                        ],
                        "name": "Qiang Yang",
                        "slug": "Qiang-Yang",
                        "structuredName": {
                            "firstName": "Qiang",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiang Yang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1987174,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "b3b7e1002192ef68cafbe45c84895f9e3caa393f",
            "isKey": false,
            "numCitedBy": 308,
            "numCiting": 26,
            "paperAbstract": {
                "fragments": [],
                "text": "A recommender system must be able to suggest items that are likely to be preferred by the user. In most systems, the degree of preference is represented by a rating score. Given a database of users' past ratings on a set of items, traditional collaborative filtering algorithms are based on predicting the potential ratings that a user would assign to the unrated items so that they can be ranked by the predicted ratings to produce a list of recommended items. In this paper, we propose a collaborative filtering approach that addresses the item ranking problem directly by modeling user preferences derived from the ratings. We measure the similarity between users based on the correlation between their rankings of the items rather than the rating values and propose new collaborative filtering algorithms for ranking items based on the preferences of similar users. Experimental results on real world movie rating data sets show that the proposed approach outperforms traditional collaborative filtering algorithms significantly on the NDCG measure for evaluating ranked results."
            },
            "slug": "EigenRank:-a-ranking-oriented-approach-to-filtering-Liu-Yang",
            "title": {
                "fragments": [],
                "text": "EigenRank: a ranking-oriented approach to collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "This paper proposes a collaborative filtering approach that addresses the item ranking problem directly by modeling user preferences derived from the ratings and shows that the proposed approach outperforms traditional collaborative filtering algorithms significantly on the NDCG measure for evaluating ranked results."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR '08"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646084"
                        ],
                        "name": "B. Sarwar",
                        "slug": "B.-Sarwar",
                        "structuredName": {
                            "firstName": "Badrul",
                            "lastName": "Sarwar",
                            "middleNames": [
                                "Munir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Sarwar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50877490"
                        ],
                        "name": "G. Karypis",
                        "slug": "G.-Karypis",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Karypis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Karypis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 8047550,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f82c52452c7de8cd6472202c1be2cce9fbcb8dda",
            "isKey": false,
            "numCitedBy": 8423,
            "numCiting": 47,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems apply knowledge discovery techniques to the problem of making personalized recommendations for information, products or services during a live interaction. These systems, especially the k-nearest neighbor collaborative ltering based ones, are achieving widespread success on the Web. The tremendous growth in the amount of available information and the number of visitors to Web sites in recent years poses some key challenges for recommender systems. These are: producing high quality recommendations, performing many recommendations per second for millions of users and items and achieving high coverage in the face of data sparsity. In traditional collaborative ltering systems the amount of work increases with the number of participants in the system. New recommender system technologies are needed that can quickly produce high quality recommendations, even for very large-scale problems. To address these issues we have explored item-based collaborative ltering techniques. Item-based techniques rst analyze the user-item matrix to identify relationships between di erent items, and then use these relationships to indirectly compute recommendations for users. In this paper we analyze di erent item-based recommendation generation algorithms. We look into di erent techniques for computing item-item similarities (e.g., item-item correlation vs. cosine similarities between item vectors) and di erent techniques for obtaining recommendations from them (e.g., weighted sum vs. regression model). Finally, we experimentally evaluate our results and compare them to the basic k-nearest neighbor approach. Our experiments suggest that item-based algorithms provide dramatically better performance than user-based algorithms, while at the same time providing better quality than the best available userbased algorithms."
            },
            "slug": "Item-based-collaborative-filtering-recommendation-Sarwar-Karypis",
            "title": {
                "fragments": [],
                "text": "Item-based collaborative filtering recommendation algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper analyzes item-based collaborative ltering techniques and suggests that item- based algorithms provide dramatically better performance than user-based algorithms, while at the same time providing better quality than the best available userbased algorithms."
            },
            "venue": {
                "fragments": [],
                "text": "WWW '01"
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 6114578,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "8b52e5e421a531d8c6f272ce1063610f52f11411",
            "isKey": false,
            "numCitedBy": 487,
            "numCiting": 16,
            "paperAbstract": {
                "fragments": [],
                "text": "This article describes part of our contribution to the “BellKor’s Pragmatic Chaos” final solution, which won the Netflix Grand Prize. The other portion of the contribution was created while working at AT&T with Robert Bell and Chris Volinsky, as reported in our 2008 Progress Prize report [3]. The final solution includes all the predictors described there. In this article we describe only the newer predictors. So what is new over last year’s solution? First we further improved the baseline predictors (Sec. III). This in turn improves our other models, which incorporate those predictors, like the matrix factorization model (Sec. IV). In addition, an extension of the neighborhood model that addresses temporal dynamics was introduced (Sec. V). On the Restricted Boltzmann Machines (RBM) front, we use a new RBM model with superior accuracy by conditioning the visible units (Sec. VI). The final addition is the introduction of a new blending algorithm, which is based on gradient boosted decision trees (GBDT) (Sec. VII)."
            },
            "slug": "The-BellKor-Solution-to-the-Netflix-Grand-Prize-Koren",
            "title": {
                "fragments": [],
                "text": "The BellKor Solution to the Netflix Grand Prize"
            },
            "tldr": {
                "abstractSimilarityScore": 64,
                "text": "Part of the contribution to the “BellKor’s Pragmatic Chaos” final solution, which won the Netflix Grand Prize, is described, which improved the baseline predictors and introduced a new blending algorithm based on gradient boosted decision trees."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744007"
                        ],
                        "name": "Gediminas Adomavicius",
                        "slug": "Gediminas-Adomavicius",
                        "structuredName": {
                            "firstName": "Gediminas",
                            "lastName": "Adomavicius",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gediminas Adomavicius"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32377897"
                        ],
                        "name": "R. Sankaranarayanan",
                        "slug": "R.-Sankaranarayanan",
                        "structuredName": {
                            "firstName": "Ramesh",
                            "lastName": "Sankaranarayanan",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sankaranarayanan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47274391"
                        ],
                        "name": "S. Sen",
                        "slug": "S.-Sen",
                        "structuredName": {
                            "firstName": "Shahana",
                            "lastName": "Sen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Sen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680593"
                        ],
                        "name": "A. Tuzhilin",
                        "slug": "A.-Tuzhilin",
                        "structuredName": {
                            "firstName": "Alexander",
                            "lastName": "Tuzhilin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Tuzhilin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1914653,
            "fieldsOfStudy": [
                "Computer Science",
                "Business"
            ],
            "id": "95f05137fdd0928d73e715b1728f2476178619a4",
            "isKey": false,
            "numCitedBy": 1252,
            "numCiting": 98,
            "paperAbstract": {
                "fragments": [],
                "text": "The article presents a multidimensional (MD) approach to recommender systems that can provide recommendations based on additional contextual information besides the typical information on users and items used in most of the current recommender systems. This approach supports multiple dimensions, profiling information, and hierarchical aggregation of recommendations. The article also presents a multidimensional rating estimation method capable of selecting two-dimensional segments of ratings pertinent to the recommendation context and applying standard collaborative filtering or other traditional two-dimensional rating estimation techniques to these segments. A comparison of the multidimensional and two-dimensional rating estimation approaches is made, and the tradeoffs between the two are studied. Moreover, the article introduces a combined rating estimation method, which identifies the situations where the MD approach outperforms the standard two-dimensional approach and uses the MD approach in those situations and the standard two-dimensional approach elsewhere. Finally, the article presents a pilot empirical study of the combined approach, using a multidimensional movie recommender system that was developed for implementing this approach and testing its performance."
            },
            "slug": "Incorporating-contextual-information-in-recommender-Adomavicius-Sankaranarayanan",
            "title": {
                "fragments": [],
                "text": "Incorporating contextual information in recommender systems using a multidimensional approach"
            },
            "tldr": {
                "abstractSimilarityScore": 91,
                "text": "A multidimensional (MD) approach to recommender systems that can provide recommendations based on additional contextual information besides the typical information on users and items used in most of the currentRecommender systems is presented."
            },
            "venue": {
                "fragments": [],
                "text": "TOIS"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3022077,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c1aa28159e768b75d0f4637a71d20da02efe1ef2",
            "isKey": false,
            "numCitedBy": 1668,
            "numCiting": 45,
            "paperAbstract": {
                "fragments": [],
                "text": "Customer preferences for products are drifting over time. Product perception and popularity are constantly changing as new selection emerges. Similarly, customer inclinations are evolving, leading them to ever redefine their taste. Thus, modeling temporal dynamics should be a key when designing recommender systems or general customer preference models. However, this raises unique challenges. Within the eco-system intersecting multiple products and customers, many different characteristics are shifting simultaneously, while many of them influence each other and often those shifts are delicate and associated with a few data instances. This distinguishes the problem from concept drift explorations, where mostly a single concept is tracked. Classical time-window or instance-decay approaches cannot work, as they lose too much signal when discarding data instances. A more sensitive approach is required, which can make better distinctions between transient effects and long term patterns. The paradigm we offer is creating a model tracking the time changing behavior throughout the life span of the data. This allows us to exploit the relevant components of all data instances, while discarding only what is modeled as being irrelevant. Accordingly, we revamp two leading collaborative filtering recommendation approaches. Evaluation is made on a large movie rating dataset by Netflix. Results are encouraging and better than those previously reported on this dataset."
            },
            "slug": "Collaborative-filtering-with-temporal-dynamics-Koren",
            "title": {
                "fragments": [],
                "text": "Collaborative filtering with temporal dynamics"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "Two leading collaborative filtering recommendation approaches are revamp and a more sensitive approach is required, which can make better distinctions between transient effects and long term patterns."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "30182834"
                        ],
                        "name": "G. Linden",
                        "slug": "G.-Linden",
                        "structuredName": {
                            "firstName": "Greg",
                            "lastName": "Linden",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Linden"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2157122032"
                        ],
                        "name": "Brent Smith",
                        "slug": "Brent-Smith",
                        "structuredName": {
                            "firstName": "Brent",
                            "lastName": "Smith",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Brent Smith"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2073999382"
                        ],
                        "name": "J. York",
                        "slug": "J.-York",
                        "structuredName": {
                            "firstName": "Jeremy",
                            "lastName": "York",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. York"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 14604122,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "da8b0378174bc25ed174be36a1c725787b81854d",
            "isKey": false,
            "numCitedBy": 5536,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommendation algorithms are best known for their use on e-commerce Web sites, where they use input about a customer's interests to generate a list of recommended items. Many applications use only the items that customers purchase and explicitly rate to represent their interests, but they can also use other attributes, including items viewed, demographic data, subject interests, and favorite artists. At Amazon.com, we use recommendation algorithms to personalize the online store for each customer. The store radically changes based on customer interests, showing programming titles to a software engineer and baby toys to a new mother. There are three common approaches to solving the recommendation problem: traditional collaborative filtering, cluster models, and search-based methods. Here, we compare these methods with our algorithm, which we call item-to-item collaborative filtering. Unlike traditional collaborative filtering, our algorithm's online computation scales independently of the number of customers and number of items in the product catalog. Our algorithm produces recommendations in real-time, scales to massive data sets, and generates high quality recommendations."
            },
            "slug": "Amazon.com-Recommendations:-Item-to-Item-Filtering-Linden-Smith",
            "title": {
                "fragments": [],
                "text": "Amazon.com Recommendations: Item-to-Item Collaborative Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This work compares three common approaches to solving the recommendation problem: traditional collaborative filtering, cluster models, and search-based methods, and their algorithm, which is called item-to-item collaborative filtering."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Internet Comput."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1706280"
                        ],
                        "name": "Nathan Srebro",
                        "slug": "Nathan-Srebro",
                        "structuredName": {
                            "firstName": "Nathan",
                            "lastName": "Srebro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nathan Srebro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35211659"
                        ],
                        "name": "Jason D. M. Rennie",
                        "slug": "Jason-D.-M.-Rennie",
                        "structuredName": {
                            "firstName": "Jason",
                            "lastName": "Rennie",
                            "middleNames": [
                                "D.",
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jason D. M. Rennie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35132120"
                        ],
                        "name": "T. Jaakkola",
                        "slug": "T.-Jaakkola",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Jaakkola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Jaakkola"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 137,
                                "start": 119
                            }
                        ],
                        "text": "Using this data in an FM, the FM will be exactly the same as a (biased) matrix factorization \nmodel (FM) [Paterek 2007; Srebro et al. 2005]. k y (x)= y(u,i)= w0+ wu + wi + vu,f vi,f ."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 118,
                                "start": 100
                            }
                        ],
                        "text": "To overcome this, typically L2 regularization is applied, which can be motivated \nby maximum-margin [Srebro et al. 2005] or Tikhonov regularization."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 5048382,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cedf154c28178370d95510112413dc8cb48120a8",
            "isKey": false,
            "numCitedBy": 1128,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "We present a novel approach to collaborative prediction, using low-norm instead of low-rank factorizations. The approach is inspired by, and has strong connections to, large-margin linear discrimination. We show how to learn low-norm factorizations by solving a semi-definite program, and discuss generalization error bounds for them."
            },
            "slug": "Maximum-Margin-Matrix-Factorization-Srebro-Rennie",
            "title": {
                "fragments": [],
                "text": "Maximum-Margin Matrix Factorization"
            },
            "tldr": {
                "abstractSimilarityScore": 86,
                "text": "A novel approach to collaborative prediction is presented, using low-norm instead of low-rank factorizations, inspired by, and has strong connections to, large-margin linear discrimination."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 2004
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1795670"
                        ],
                        "name": "M. Lipczak",
                        "slug": "M.-Lipczak",
                        "structuredName": {
                            "firstName": "Marek",
                            "lastName": "Lipczak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Lipczak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736641"
                        ],
                        "name": "E. Milios",
                        "slug": "E.-Milios",
                        "structuredName": {
                            "firstName": "Evangelos",
                            "lastName": "Milios",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Milios"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9551273,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "5ba642c013054cadddf20f469124aae143635755",
            "isKey": false,
            "numCitedBy": 36,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "Despite all of the advantages of tags as an easy and flexible information management approach, tagging is a cumbersome task. A set of descriptive tags has to be manually entered by users whenever they post a resource. This process can be simplified by the use of tag recommendation systems. Their objective is to suggest potentially useful tags to the user. We present a hybrid tag recommendation system together with a scalable, highly efficient system architecture. The system is able to utilize user feedback to tune its parameters to specific characteristics of the underlying tagging system and adapt the recommendation models to newly added content. The evaluation of the system on six real-life datasets demonstrated the system’s ability to combine tags from various sources (e.g., resource content or tags previously used by the user) to achieve the best quality of recommended tags. It also confirmed the importance of parameter tuning and content adaptation. A series of additional experiments allowed us to better understand the characteristics of the system and tagging datasets and to determine the potential areas for further system development."
            },
            "slug": "Efficient-Tag-Recommendation-for-Real-Life-Data-Lipczak-Milios",
            "title": {
                "fragments": [],
                "text": "Efficient Tag Recommendation for Real-Life Data"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "A hybrid tag recommendation system together with a scalable, highly efficient system architecture that is able to utilize user feedback to tune its parameters to specific characteristics of the underlying tagging system and adapt the recommendation models to newly added content."
            },
            "venue": {
                "fragments": [],
                "text": "TIST"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1706280"
                        ],
                        "name": "Nathan Srebro",
                        "slug": "Nathan-Srebro",
                        "structuredName": {
                            "firstName": "Nathan",
                            "lastName": "Srebro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nathan Srebro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "35132120"
                        ],
                        "name": "T. Jaakkola",
                        "slug": "T.-Jaakkola",
                        "structuredName": {
                            "firstName": "T.",
                            "lastName": "Jaakkola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Jaakkola"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 91,
                                "start": 67
                            }
                        ],
                        "text": "The most well studied factorization model is \nmatrix factorization [Srebro and Jaakkola 2003], which allows us to predict the relation between two \ncategorical variables."
                    },
                    "intents": []
                }
            ],
            "corpusId": 5815325,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "755e566d3f10d057bc9e4908e4016ae6f7ca0753",
            "isKey": false,
            "numCitedBy": 787,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "We study the common problem of approximating a target matrix with a matrix of lower rank. We provide a simple and efficient (EM) algorithm for solving weighted low-rank approximation problems, which, unlike their unweighted version, do not admit a closed-form solution in general. We analyze, in addition, the nature of locally optimal solutions that arise in this context, demonstrate the utility of accommodating the weights in reconstructing the underlying low-rank representation, and extend the formulation to non-Gaussian noise models such as logistic models. Finally, we apply the methods developed to a collaborative filtering task."
            },
            "slug": "Weighted-Low-Rank-Approximations-Srebro-Jaakkola",
            "title": {
                "fragments": [],
                "text": "Weighted Low-Rank Approximations"
            },
            "tldr": {
                "abstractSimilarityScore": 57,
                "text": "This work provides a simple and efficient algorithm for solving weighted low-rank approximation problems, which, unlike their unweighted version, do not admit a closed-form solution in general."
            },
            "venue": {
                "fragments": [],
                "text": "ICML"
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1913774"
                        ],
                        "name": "Tianqi Chen",
                        "slug": "Tianqi-Chen",
                        "structuredName": {
                            "firstName": "Tianqi",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tianqi Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115548759"
                        ],
                        "name": "Zhao Zheng",
                        "slug": "Zhao-Zheng",
                        "structuredName": {
                            "firstName": "Zhao",
                            "lastName": "Zheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhao Zheng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2117522623"
                        ],
                        "name": "Qiuxia Lu",
                        "slug": "Qiuxia-Lu",
                        "structuredName": {
                            "firstName": "Qiuxia",
                            "lastName": "Lu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiuxia Lu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108309275"
                        ],
                        "name": "Weinan Zhang",
                        "slug": "Weinan-Zhang",
                        "structuredName": {
                            "firstName": "Weinan",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Weinan Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1811427"
                        ],
                        "name": "Yong Yu",
                        "slug": "Yong-Yu",
                        "structuredName": {
                            "firstName": "Yong",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yong Yu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16488900,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ca2f25844a30d894c12ca4b920a2f9c497da8afa",
            "isKey": false,
            "numCitedBy": 48,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender system has been more and more popular and widely used in many applications recently. The increasing information available, not only in quantities but also in types, leads to a big challenge for recommender system that how to leverage these rich information to get a better performance. Most traditional approaches try to design a specic"
            },
            "slug": "Feature-Based-Matrix-Factorization-Chen-Zheng",
            "title": {
                "fragments": [],
                "text": "Feature-Based Matrix Factorization"
            },
            "tldr": {
                "abstractSimilarityScore": 97,
                "text": "Recommender system has been more and more popular and widely used in many applications recently and the increasing information available, not only in quantities but also in types, leads to a big challenge for recommender system to leverage these rich information to get a better performance."
            },
            "venue": {
                "fragments": [],
                "text": "ArXiv"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739660"
                        ],
                        "name": "L. Marinho",
                        "slug": "L.-Marinho",
                        "structuredName": {
                            "firstName": "Leandro",
                            "lastName": "Marinho",
                            "middleNames": [
                                "Balby"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Marinho"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2598724"
                        ],
                        "name": "Christine Preisach",
                        "slug": "Christine-Preisach",
                        "structuredName": {
                            "firstName": "Christine",
                            "lastName": "Preisach",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Christine Preisach"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388781075"
                        ],
                        "name": "L. Schmidt-Thieme",
                        "slug": "L.-Schmidt-Thieme",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Schmidt-Thieme",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Schmidt-Thieme"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10841563,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "1121910035ac80a288b1cb802cae2bac661603ef",
            "isKey": false,
            "numCitedBy": 26,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Folksonomy data is relational by nature, and therefore methods that directly exploit these relations are prominent for the tag recommendation problem. Relational methods have been successfully applied to areas in which entities are linked in an explicit manner, like hypertext documents and scientific publications. For approaching the graph-based tag recommendation task of the ECML PKDD Discovery Challenge 2009, we propose to turn the folksonomy graph into a homogeneous post graph and use relational classification techniques for predicting tags. Our approach features adherence to multiple kinds of relations, semi-supervised learning and fast predictions."
            },
            "slug": "Relational-Classification-for-Personalized-Tag-Marinho-Preisach",
            "title": {
                "fragments": [],
                "text": "Relational Classification for Personalized Tag Recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work proposes to turn the folksonomy graph into a homogeneous post graph and use relational classification techniques for predicting tags and features adherence to multiple kinds of relations, semi-supervised learning and fast predictions."
            },
            "venue": {
                "fragments": [],
                "text": "DC@PKDD/ECML"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3154682"
                        ],
                        "name": "R. Harshman",
                        "slug": "R.-Harshman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Harshman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Harshman"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 205,
                                "start": 192
                            }
                        ],
                        "text": "…models are an extension for relations over several categorical \nvariables; among the proposed tensor factorization approaches are Tucker Decomposition [Tucker 1966], \nParallel Factor Analysis [Harshman 1970], or Pairwise Interaction Tensor factorization [Rendle and Schmidt-Thieme \n2010]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 78,
                                "start": 64
                            }
                        ],
                        "text": "This way, factorization machines combine the generality of feature \nengineering with the superiority of factorization models in estimating interactions between categorical \nvariables of large do­main."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 210,
                                "start": 186
                            }
                        ],
                        "text": "Tensor factorization models are an extension for relations over several categorical \nvariables; among the proposed tensor factorization approaches are Tucker Decomposition [Tucker 1966], \nParallel Factor Analysis [Harshman 1970], or Pairwise Interaction Tensor factorization [Rendle and Schmidt-Thieme \n2010]."
                    },
                    "intents": []
                }
            ],
            "corpusId": 6816804,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c5b28cae82b14417f1250e58bb241367248e827d",
            "isKey": true,
            "numCitedBy": 2975,
            "numCiting": 52,
            "paperAbstract": {
                "fragments": [],
                "text": "Simple structure and other common principles of factor rotation do not in general provide strong grounds for attributing explanatory significance to the factors which they select. In contrast, it is shown that an extension of Cattell's principle of rotation to Proportional Profiles (PP) offers a basis for determining explanatory factors for three-way or higher order multi-mode data. Conceptual models are developed for two basic patterns of multi-mode data variation, systemand object-variation, and PP analysis is found to apply in the system-variation case. Although PP was originally formulated as a principle of rotation to be used with classic two-way factor analysis, it is shown to embody a latent three-mode factor model, which is here made explicit and generalized frown two to N \"parallel occasions\". As originally formulated, PP rotation was restricted to orthogonal factors. The generalized PP model is demonstrated to give unique \"correct\" solutions with oblique, non-simple structure, and even non-linear factor structures. A series of tests, conducted with synthetic data of known factor composition, demonstrate the capabilities of linear and non-linear versions of the model, provide data on the minimal necessary conditions of uniqueness, and reveal the properties of the analysis procedures when these minimal conditions are not fulfilled. In addition, a mathematical proof is presented for the uniqueness of the solution given certain conditions on the data. Three-mode PP factor analysis is applied to a three-way set of real data consisting of the fundamental and first three formant frequencies of 11 persons saying 8 vowels. A unique solution is extracted, consisting of three factors which are highly meaningful and consistent with prior knowledge and theory concerning vowel quality. The relationships between the three-mode PP model and Tucker's multi-modal model, McDonald's non-linear model and Carroll and Chang's multi-dimensional scaling model are explored."
            },
            "slug": "Foundations-of-the-PARAFAC-procedure:-Models-and-an-Harshman",
            "title": {
                "fragments": [],
                "text": "Foundations of the PARAFAC procedure: Models and conditions for an \"explanatory\" multi-model factor analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "It is shown that an extension of Cattell's principle of rotation to Proportional Profiles (PP) offers a basis for determining explanatory factors for three-way or higher order multi-mode data."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1970
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2153009334"
                        ],
                        "name": "Ning Zhang",
                        "slug": "Ning-Zhang",
                        "structuredName": {
                            "firstName": "Ning",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ning Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [],
                        "name": "Yuan Zhang",
                        "slug": "Yuan-Zhang",
                        "structuredName": {
                            "firstName": "Yuan",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yuan Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46199760"
                        ],
                        "name": "Jie Tang",
                        "slug": "Jie-Tang",
                        "structuredName": {
                            "firstName": "Jie",
                            "lastName": "Tang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jie Tang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 271,
                                "start": 254
                            }
                        ],
                        "text": "Figure \n4(b) shows a comparison of the prediction quality of LIBFM to PITF and the second to fourth best models \nof the Discovery Challenge: relational classi.cation [Marinho et al. 2009] and the models of the third \n[Lipczak et al. 2009] and fourth place [Zhang et al. 2009]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14950459,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e69a431525efb7e3c435cd624aa6e88ea86f1147",
            "isKey": false,
            "numCitedBy": 12,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "Social bookmarking tools become more and more popular nowadays and tagging is used to organize information and allow users to recall or search the resources. Users need to type the tags whenever they post a resource, so that a good tag recommendation system can ease the process of finding some useful and relevant keywords for users. Researchers have made lots of relevant work for recommendation system, but those traditional collaborative systems do not fit to our tag recommendation. In this paper, we present two different methods: a simple language model and an adaption of topic model. We evaluate and compare these two approaches and show that a combination of these two methods will perform better results for the task one of PKDD Challenge 2009."
            },
            "slug": "A-Tag-Recommendation-System-Based-on-Contents-Zhang-Zhang",
            "title": {
                "fragments": [],
                "text": "A Tag Recommendation System Based on Contents"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This paper presents two different methods: a simple language model and an adaption of topic model and shows that a combination of these two methods will perform better results for the task one of PKDD Challenge 2009."
            },
            "venue": {
                "fragments": [],
                "text": "DC@PKDD/ECML"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145473095"
                        ],
                        "name": "Yu Zheng",
                        "slug": "Yu-Zheng",
                        "structuredName": {
                            "firstName": "Yu",
                            "lastName": "Zheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yu Zheng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144076239"
                        ],
                        "name": "Xing Xie",
                        "slug": "Xing-Xie",
                        "structuredName": {
                            "firstName": "Xing",
                            "lastName": "Xie",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Xing Xie"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 18166023,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a8138b5a6997747ce1432086da5fb7bb59d3fa05",
            "isKey": false,
            "numCitedBy": 398,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "The advance of GPS-enabled devices allows people to record their location histories with GPS traces, which imply human behaviors and preferences related to travel. In this article, we perform two types of travel recommendations by mining multiple users' GPS traces. The first is a generic one that recommends a user with top interesting locations and travel sequences in a given geospatial region. The second is a personalized recommendation that provides an individual with locations matching her travel preferences. To achieve the first recommendation, we model multiple users' location histories with a tree-based hierarchical graph (TBHG). Based on the TBHG, we propose a HITS (Hypertext Induced Topic Search)-based model to infer the interest level of a location and a user's travel experience (knowledge). In the personalized recommendation, we first understand the correlation between locations, and then incorporate this correlation into a collaborative filtering (CF)-based model, which predicts a user's interests in an unvisited location based on her locations histories and that of others. We evaluated our system based on a real-world GPS trace dataset collected by 107 users over a period of one year. As a result, our HITS-based inference model outperformed baseline approaches like rank-by-count and rank-by-frequency. Meanwhile, we achieved a better performance in recommending travel sequences beyond baselines like rank-by-count. Regarding the personalized recommendation, our approach is more effective than the weighted Slope One algorithm with a slightly additional computation, and is more efficient than the Pearson correlation-based CF model with the similar effectiveness."
            },
            "slug": "Learning-travel-recommendations-from-user-generated-Zheng-Xie",
            "title": {
                "fragments": [],
                "text": "Learning travel recommendations from user-generated GPS traces"
            },
            "tldr": {
                "abstractSimilarityScore": 47,
                "text": "This article performs two types of travel recommendations by mining multiple users' GPS traces, including a generic one that recommends a user with top interesting locations and travel sequences in a given geospatial region and a personalized recommendation that provides an individual with locations matching her travel preferences."
            },
            "venue": {
                "fragments": [],
                "text": "TIST"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [],
                        "name": "Chih-Chung Chang",
                        "slug": "Chih-Chung-Chang",
                        "structuredName": {
                            "firstName": "Chih-Chung",
                            "lastName": "Chang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chih-Chung Chang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1711460"
                        ],
                        "name": "Chih-Jen Lin",
                        "slug": "Chih-Jen-Lin",
                        "structuredName": {
                            "firstName": "Chih-Jen",
                            "lastName": "Lin",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chih-Jen Lin"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 961425,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "273dfbcb68080251f5e9ff38b4413d7bd84b10a1",
            "isKey": false,
            "numCitedBy": 40848,
            "numCiting": 60,
            "paperAbstract": {
                "fragments": [],
                "text": "LIBSVM is a library for Support Vector Machines (SVMs). We have been actively developing this package since the year 2000. The goal is to help users to easily apply SVM to their applications. LIBSVM has gained wide popularity in machine learning and many other areas. In this article, we present all implementation details of LIBSVM. Issues such as solving SVM optimization problems theoretical convergence multiclass classification probability estimates and parameter selection are discussed in detail."
            },
            "slug": "LIBSVM:-A-library-for-support-vector-machines-Chang-Lin",
            "title": {
                "fragments": [],
                "text": "LIBSVM: A library for support vector machines"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "Issues such as solving SVM optimization problems theoretical convergence multiclass classification probability estimates and parameter selection are discussed in detail."
            },
            "venue": {
                "fragments": [],
                "text": "TIST"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1795670"
                        ],
                        "name": "M. Lipczak",
                        "slug": "M.-Lipczak",
                        "structuredName": {
                            "firstName": "Marek",
                            "lastName": "Lipczak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Lipczak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1766387"
                        ],
                        "name": "Yeming Hu",
                        "slug": "Yeming-Hu",
                        "structuredName": {
                            "firstName": "Yeming",
                            "lastName": "Hu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yeming Hu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2315975"
                        ],
                        "name": "Yael Kollet",
                        "slug": "Yael-Kollet",
                        "structuredName": {
                            "firstName": "Yael",
                            "lastName": "Kollet",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yael Kollet"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1736641"
                        ],
                        "name": "E. Milios",
                        "slug": "E.-Milios",
                        "structuredName": {
                            "firstName": "Evangelos",
                            "lastName": "Milios",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Milios"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 234,
                                "start": 215
                            }
                        ],
                        "text": "Figure \n4(b) shows a comparison of the prediction quality of LIBFM to PITF and the second to fourth best models \nof the Discovery Challenge: relational classi.cation [Marinho et al. 2009] and the models of the third \n[Lipczak et al. 2009] and fourth place [Zhang et al. 2009]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 18639022,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "54a7a96c7aa1c087272b8ade781699fc4a8835b7",
            "isKey": false,
            "numCitedBy": 95,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "Collaborative tagging systems are social data repositories, in which users manage resources using descriptive keywords (tags). An important element of collaborative tagging systems is the tag recommender, which proposes a set of tags to each newly posted resource. In this paper we discuss the potential role of three tag sources: resource content as well as resource and user profiles in the tag recommendation system. Our system compiles a set of resource specific tags, which includes tags related to the title and tags previously used to describe the same resource (resource profile). These tags are checked against user profile tags - a rich, but imprecise source of information about user interests. The result is a set of tags related both to the resource and user. Depending on the character of processed posts this set can be an extension of the common tag recommendation sources, namely resource title and resource profile. The system was submitted to ECML PKDD Discovery Challenge 2009 for \"content-based\" and \"graph-based\" recommendation tasks, in which it took the first and third place respectively."
            },
            "slug": "Tag-Sources-for-Recommendation-in-Collaborative-Lipczak-Hu",
            "title": {
                "fragments": [],
                "text": "Tag Sources for Recommendation in Collaborative Tagging Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "The potential role of three tag sources are discussed: resource content as well as resource and user profiles in the tag recommendation system, which compiles a set of resource specific tags, which includes tags related to the title and tags previously used to describe the same resource (resource profile)."
            },
            "venue": {
                "fragments": [],
                "text": "DC@PKDD/ECML"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "118860642"
                        ],
                        "name": "M. Hall",
                        "slug": "M.-Hall",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Hall",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Hall"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143713826"
                        ],
                        "name": "Eibe Frank",
                        "slug": "Eibe-Frank",
                        "structuredName": {
                            "firstName": "Eibe",
                            "lastName": "Frank",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Eibe Frank"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144282963"
                        ],
                        "name": "G. Holmes",
                        "slug": "G.-Holmes",
                        "structuredName": {
                            "firstName": "Geoff",
                            "lastName": "Holmes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Holmes"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1737420"
                        ],
                        "name": "B. Pfahringer",
                        "slug": "B.-Pfahringer",
                        "structuredName": {
                            "firstName": "Bernhard",
                            "lastName": "Pfahringer",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Pfahringer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2840271"
                        ],
                        "name": "P. Reutemann",
                        "slug": "P.-Reutemann",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Reutemann",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Reutemann"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9419406"
                        ],
                        "name": "I. Witten",
                        "slug": "I.-Witten",
                        "structuredName": {
                            "firstName": "Ian",
                            "lastName": "Witten",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Witten"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 13861754,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6d8c9fcce8177d6f8d122d653c7d32d7624d6714",
            "isKey": false,
            "numCitedBy": 19968,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "More than twelve years have elapsed since the first public release of WEKA. In that time, the software has been rewritten entirely from scratch, evolved substantially and now accompanies a text on data mining [35]. These days, WEKA enjoys widespread acceptance in both academia and business, has an active community, and has been downloaded more than 1.4 million times since being placed on Source-Forge in April 2000. This paper provides an introduction to the WEKA workbench, reviews the history of the project, and, in light of the recent 3.6 stable release, briefly discusses what has been added since the last stable version (Weka 3.4) released in 2003."
            },
            "slug": "The-WEKA-data-mining-software:-an-update-Hall-Frank",
            "title": {
                "fragments": [],
                "text": "The WEKA data mining software: an update"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This paper provides an introduction to the WEKA workbench, reviews the history of the project, and, in light of the recent 3.6 stable release, briefly discusses what has been added since the last stable version (Weka 3.4) released in 2003."
            },
            "venue": {
                "fragments": [],
                "text": "SKDD"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32405080"
                        ],
                        "name": "W. Rey",
                        "slug": "W.-Rey",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Rey",
                            "middleNames": [
                                "J.",
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Rey"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 133,
                                "start": 123
                            }
                        ],
                        "text": "However, applying \nfactorization approaches to a new prediction problem is a nontrivial task and requires a lot of expert \nknowledge."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 88520968,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "9ee7f84cf1ad26de1c0cacf7a15834609a1e22d9",
            "isKey": false,
            "numCitedBy": 15,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "Our main interest is the low-rank approximation of a matrix in R^m.n under a weighted Frobenius norm. This norm associates a weight to each of the (m x n) matrix entries. We conjecture that the number of approximations is at most min(m, n). \nWe also investigate how the approximations depend on the weight-values."
            },
            "slug": "On-Weighted-Low-Rank-Approximation-Rey",
            "title": {
                "fragments": [],
                "text": "On Weighted Low-Rank Approximation"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2013
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50477565"
                        ],
                        "name": "L. Tucker",
                        "slug": "L.-Tucker",
                        "structuredName": {
                            "firstName": "Ledyard",
                            "lastName": "Tucker",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Tucker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 44301099,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "6661789de63b3cebe2eafdd7e9e7a316ad1f0b8f",
            "isKey": false,
            "numCitedBy": 3327,
            "numCiting": 7,
            "paperAbstract": {
                "fragments": [],
                "text": "The model for three-mode factor analysis is discussed in terms of newer applications of mathematical processes including a type of matrix process termed the Kronecker product and the definition of combination variables. Three methods of analysis to a type of extension of principal components analysis are discussed. Methods II and III are applicable to analysis of data collected for a large sample of individuals. An extension of the model is described in which allowance is made for unique variance for each combination variable when the data are collected for a large sample of individuals."
            },
            "slug": "Some-mathematical-notes-on-three-mode-factor-Tucker",
            "title": {
                "fragments": [],
                "text": "Some mathematical notes on three-mode factor analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The model for three-mode factor analysis is discussed in terms of newer applications of mathematical processes including a type of matrix process termed the Kronecker product and the definition of combination variables."
            },
            "venue": {
                "fragments": [],
                "text": "Psychometrika"
            },
            "year": 1966
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145155783"
                        ],
                        "name": "C. Robert",
                        "slug": "C.-Robert",
                        "structuredName": {
                            "firstName": "Christian",
                            "lastName": "Robert",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Robert"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 15943491,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "88b51eb03f1b0a3449136bbb16b8aa40ed0c1307",
            "isKey": false,
            "numCitedBy": 509,
            "numCiting": 20,
            "paperAbstract": {
                "fragments": [],
                "text": "We provide simulation algorithms for one-sided and two-sided truncated normal distributions. These algorithms are then used to simulate multivariate normal variables with convex restricted parameter space for any covariance structure."
            },
            "slug": "Simulation-of-truncated-normal-variables-Robert",
            "title": {
                "fragments": [],
                "text": "Simulation of truncated normal variables"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46253186"
                        ],
                        "name": "A. Brix",
                        "slug": "A.-Brix",
                        "structuredName": {
                            "firstName": "Anders",
                            "lastName": "Brix",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Brix"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 121938653,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "48d287c7d01ee987f19e4738ba148bb8a4b297ee",
            "isKey": false,
            "numCitedBy": 2076,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Bayesian-Data-Analysis,-2nd-edn-Brix",
            "title": {
                "fragments": [],
                "text": "Bayesian Data Analysis, 2nd edn"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145473095"
                        ],
                        "name": "Yu Zheng",
                        "slug": "Yu-Zheng",
                        "structuredName": {
                            "firstName": "Yu",
                            "lastName": "Zheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yu Zheng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47809306"
                        ],
                        "name": "L. Capra",
                        "slug": "L.-Capra",
                        "structuredName": {
                            "firstName": "Licia",
                            "lastName": "Capra",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Capra"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1741601"
                        ],
                        "name": "O. Wolfson",
                        "slug": "O.-Wolfson",
                        "structuredName": {
                            "firstName": "Ouri",
                            "lastName": "Wolfson",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "O. Wolfson"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "97598838"
                        ],
                        "name": "Hai Yang",
                        "slug": "Hai-Yang",
                        "structuredName": {
                            "firstName": "Hai",
                            "lastName": "Yang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hai Yang"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 62095404,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "7149d3943d36bace017a6cfd96d3664c45c5c7ff",
            "isKey": false,
            "numCitedBy": 391,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "ACM-Transactions-on-Intelligent-Systems-and-Special-Zheng-Capra",
            "title": {
                "fragments": [],
                "text": "ACM Transactions on Intelligent Systems and Technology - Special Section on Urban Computing"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2014
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Received January"
            },
            "venue": {
                "fragments": [],
                "text": "Received January"
            },
            "year": 2012
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "S. Rendle"
            },
            "venue": {
                "fragments": [],
                "text": "S. Rendle"
            }
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 3,
            "methodology": 7
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 49,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Factorization-Machines-with-libFM-Rendle/e50f4d3316d13841c287dcdf5479d7820d593571?sort=total-citations"
}