{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48603437"
                        ],
                        "name": "A. Newell",
                        "slug": "A.-Newell",
                        "structuredName": {
                            "firstName": "Allen",
                            "lastName": "Newell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Newell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144774845"
                        ],
                        "name": "J. Shaw",
                        "slug": "J.-Shaw",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Shaw",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Shaw"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "94059053"
                        ],
                        "name": "H. Simon",
                        "slug": "H.-Simon",
                        "structuredName": {
                            "firstName": "Herbert",
                            "lastName": "Simon",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Simon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 16650779,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f8117e2fa9be7f65d0c0cd19d1473ef0bdf2de69",
            "isKey": false,
            "numCitedBy": 336,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "In 1956 a group at Los Alamos programmed maniac-I to play chess (Kister et al, 1957). The Los Alamos program is an almost perfect example of the type of system specified by Shannon. As shown in the Table, all alternatives were considered: all continuations were explored to a depth of two moves (i. e., two moves for Black and two for White): the static evaluation function consisted of a sum of material and mobility measures; the values were integrated by a minimax procedure,* and the best alternative in terms of the effective value was chosen for the move."
            },
            "slug": "Chess-Playing-Programs-and-the-Problem-of-Newell-Shaw",
            "title": {
                "fragments": [],
                "text": "Chess-Playing Programs and the Problem of Complexity"
            },
            "tldr": {
                "abstractSimilarityScore": 55,
                "text": "The Los Alamos program is an almost perfect example of the type of system specified by Shannon, and the static evaluation function consisted of a sum of material and mobility measures."
            },
            "venue": {
                "fragments": [],
                "text": "IBM J. Res. Dev."
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144936685"
                        ],
                        "name": "J. Kister",
                        "slug": "J.-Kister",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Kister",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Kister"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "31230516"
                        ],
                        "name": "P. Stein",
                        "slug": "P.-Stein",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Stein",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Stein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32619911"
                        ],
                        "name": "S. Ulam",
                        "slug": "S.-Ulam",
                        "structuredName": {
                            "firstName": "S.",
                            "lastName": "Ulam",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ulam"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "148368545"
                        ],
                        "name": "W. Walden",
                        "slug": "W.-Walden",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Walden",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Walden"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145900242"
                        ],
                        "name": "M. Wells",
                        "slug": "M.-Wells",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Wells",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Wells"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 38004983,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6d78c6511920787be48300b97bfec03cb607796c",
            "isKey": false,
            "numCitedBy": 41,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The aim of this article is to report briefly on some experiments performed on a fast computing machine (M~.nIAC I -Los Alamos) on the coding of computers to play the game of chess. The idea that machines could be made to play this game is very old and there is considerable li terature devoted to this problem which has a long and amusing history, including the well known specious machines which were operated by humans hidden inside the alleged machinery. We shall mention merely an article by C. Shannon on the problem of coding for machines which could play chess. There is an account by Turing of a computing machine which actually played a game of chess. One game played by his computer is given in the book Faster than Thought by Bowden. Recently, an article in the Russian newspaper Pravda mentioned the fact tha t a computing machine in Moscow had been coded to play the game of chess. No detailed account was given either of the method by which this game was coded nor of the results of such play beyond a s tatement that a fair chess player is able to beat the machine. In Los Alamos recently an a t tempt was made to t ry out the ideas which some of us had advanced during the course of the last few years by putting them to test on one of the Los Alamos computing machines. The problem of coding the rules of chess, i.e., of making individual moves, is of course very simple. The problem of finding methods of play which would enable the machine to produce anything even faintly comparable with the result of human planning is extremely difficult. This difficulty is evident at every step of the game. Before a decision can be made to make a move, an enormous number of positions has to be surveyed if one wants to look \"ahead\" for even a moderate number of moves. If we assume that the average number of legal moves at any given stage is of order 20, then to look 3 moves ahead, i.e., 3 by white and 3 by black, would involve consideration of 206 chains of moves. At the end of each of such chains, an evaluation must be made according to some prescribed rule which eventually singles out one move in preference to others. The game which was played on the machine is not really chess but rather, so to speak, a miniature of it; we play on a 6 x 6 board, omitting the bishops; and with 6 pawns on each side. (For the first move we allow the pawn to move only one square ahead.) The game retains much of the flavor of real chess but is very much simpler. Castling is not permitted; promotion of a pawn was allowed to take place as usual. The reason for the reduction of chess to this mutilated version was in order to allow the machine to look two moves ahead, i.e., 2 by white and 2 by black. The time taken to consider all chains came out on the average to about 12 minutes per nmve; thus it was possible to play a game in the course of"
            },
            "slug": "Experiments-in-Chess-Kister-Stein",
            "title": {
                "fragments": [],
                "text": "Experiments in Chess"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "Some experiments performed on a fast computing machine (M~.nIAC I -Los Alamos) on the coding of computers to play the game of chess are reported on."
            },
            "venue": {
                "fragments": [],
                "text": "JACM"
            },
            "year": 1957
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144461837"
                        ],
                        "name": "C. Shannon",
                        "slug": "C.-Shannon",
                        "structuredName": {
                            "firstName": "Claude",
                            "lastName": "Shannon",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Shannon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 37094858,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "1a6eacdbf4e881a91cf6b76a9f70f53ccc290ae1",
            "isKey": false,
            "numCitedBy": 951,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper is concerned with the problem of constructing a computing routine or “program” for a modern general purpose computer which will enable it to play chess. Although perhaps of no practical importance, the question is of theoretical interest, and it is hoped that a satisfactory solution of this problem will act as a wedge in attacking other problems of a similar nature and of greater significance. Some possibilities in this direction are:- \n \n(1) \n \nMachines for designing filters, equalizers, etc. \n \n \n \n \n(2) \n \nMachines for designing relay and switching circuits. \n \n \n \n \n(3) \n \nMachines which will handle routing of telephone calls based on the individual circumstances rather than by fixed patterns. \n \n \n \n \n(4) \n \nMachines for performing symbolic (non-numerical) mathematical operations. \n \n \n \n \n(5) \n \nMachines capable of translating from one language to another. \n \n \n \n \n(6) \n \nMachines for making strategic decisions in simplified military operations. \n \n \n \n \n(7) \n \nMachines capable of orchestrating a melody. \n \n \n \n \n(8) \n \nMachines capable of logical deduction."
            },
            "slug": "Programming-a-computer-for-playing-chess-Shannon",
            "title": {
                "fragments": [],
                "text": "Programming a computer for playing chess"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "This paper is concerned with the problem of constructing a computing routine or “program” for a modern general purpose computer which will enable it to play chess."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1950
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1910392"
                        ],
                        "name": "C. Strachey",
                        "slug": "C.-Strachey",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Strachey",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Strachey"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 9399108,
            "fieldsOfStudy": [
                "Mathematics"
            ],
            "id": "70f925bc4ca4a17e7ec58be920634c4db1e40ae2",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "A large part of any mathematical programme is concerned with operations which are not strictly mathematical at all. Examples of this are the input and output routines, the arrangements for calling in various sub-routines when required and, above all, the general organization of the problem as a whole. It is an interesting fact that these non-mathematical parts of the programme often take many more instructions than the mathematics proper. As an example, in a problem which involved the step by step integration of a simple non-linear differential equation, the actual integration cycle used 70 instructions, the arrangements to print out the results and to stop the integration at the required point used a further 48 instructions and a printing sub-routine of 64 instructions - a total of 112 instructions. The problem required this integration to be performed a large number of times with different parameters; the organization involved in doing this, and in arranging that the parameters should be fed into the machine in the simplest possible form used no fewer than 250 instructions and sub-routines totalling about 150 instructions. This may be a rather extreme case. but it is generally true to say, I think, that the non-mathematical parts of the programme use far more instructions than one would at first sight expect, and that a relatively large part of effort in preparing the programme is spent dealing with these non-mathematical operations."
            },
            "slug": "Logical-or-non-mathematical-programmes-Strachey",
            "title": {
                "fragments": [],
                "text": "Logical or non-mathematical programmes"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "It is generally true to say, I think, that the non-mathematical parts of the programme use far more instructions than one would at first sight expect, and that a relatively large part of effort in preparing the programme is spent dealing with these non-Mathematical operations."
            },
            "venue": {
                "fragments": [],
                "text": "ACM '52"
            },
            "year": 1952
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143635905"
                        ],
                        "name": "N. Rochester",
                        "slug": "N.-Rochester",
                        "structuredName": {
                            "firstName": "Nathaniel",
                            "lastName": "Rochester",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Rochester"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144404817"
                        ],
                        "name": "J. Holland",
                        "slug": "J.-Holland",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Holland",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Holland"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29386434"
                        ],
                        "name": "L. Haibt",
                        "slug": "L.-Haibt",
                        "structuredName": {
                            "firstName": "L.",
                            "lastName": "Haibt",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Haibt"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34594658"
                        ],
                        "name": "W. Duda",
                        "slug": "W.-Duda",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Duda",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Duda"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 3045897,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "878d615b84cf779e162f62c4a9192d6bddeefbf9",
            "isKey": false,
            "numCitedBy": 307,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Theories by D.O. Hebb and P.M. Milner on how the brain works were tested by simulating neuron nets on the IBM Type 704 Electronic Calculator. The formation of cell assemblies from an unorganized net of neurons was demonstrated, as well as a plausible mechanism for short-term memory and the phenomena of growth and fractionation of cell assemblies. The cell assemblies do not yet act just as the theory requires, but changes in the theory and the simulation offer promise for further experimentation."
            },
            "slug": "Tests-on-a-cell-assembly-theory-of-the-action-of-a-Rochester-Holland",
            "title": {
                "fragments": [],
                "text": "Tests on a cell assembly theory of the action of the brain, using a large digital computer"
            },
            "venue": {
                "fragments": [],
                "text": "IRE Trans. Inf. Theory"
            },
            "year": 1956
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "51083130"
                        ],
                        "name": "F. Rosenblatt",
                        "slug": "F.-Rosenblatt",
                        "structuredName": {
                            "firstName": "Frank",
                            "lastName": "Rosenblatt",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Rosenblatt"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12781225,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "5d11aad09f65431b5d3cb1d85328743c9e53ba96",
            "isKey": false,
            "numCitedBy": 9125,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The first of these questions is in the province of sensory physiology, and is the only one for which appreciable understanding has been achieved. This article will be concerned primarily with the second and third questions, which are still subject to a vast amount of speculation, and where the few relevant facts currently supplied by neurophysiology have not yet been integrated into an acceptable theory. With regard to the second question, two alternative positions have been maintained. The first suggests that storage of sensory information is in the form of coded representations or images, with some sort of one-to-one mapping between the sensory stimulus"
            },
            "slug": "The-perceptron:-a-probabilistic-model-for-storage-Rosenblatt",
            "title": {
                "fragments": [],
                "text": "The perceptron: a probabilistic model for information storage and organization in the brain."
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This article will be concerned primarily with the second and third questions, which are still subject to a vast amount of speculation, and where the few relevant facts currently supplied by neurophysiology have not yet been integrated into an acceptable theory."
            },
            "venue": {
                "fragments": [],
                "text": "Psychological review"
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "4605464"
                        ],
                        "name": "W. McCulloch",
                        "slug": "W.-McCulloch",
                        "structuredName": {
                            "firstName": "Warren",
                            "lastName": "McCulloch",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. McCulloch"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 51672981,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0d2e78331aa931f082a48b8175d60f15e8b19dfb",
            "isKey": false,
            "numCitedBy": 39,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The author, a medical doctor, employs electrical engineering terminology to show how the brain may be likened to a digital computing machine consisting of ten billion relays called neurons. To carry the analogy further, the performance of the brain is governed by inverse feedback, subsidiary networks secure invariants, or ideas, predictive filters enable us to move toward the place where the object will be when we get there, and complicated servo-mechanisms enable us to act with facility and precision. Disorders of function are explained in terms of damage to the structure, improper voltage of the relays, and parasitic oscillations."
            },
            "slug": "The-brain-computing-machine-McCulloch",
            "title": {
                "fragments": [],
                "text": "The brain computing machine"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "The author, a medical doctor, employs electrical engineering terminology to show how the brain may be likened to a digital computing machine consisting of ten billion relays called neurons."
            },
            "venue": {
                "fragments": [],
                "text": "Electrical Engineering"
            },
            "year": 1949
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144052502"
                        ],
                        "name": "A. Bernstein",
                        "slug": "A.-Bernstein",
                        "structuredName": {
                            "firstName": "A.",
                            "lastName": "Bernstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Bernstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "102710714"
                        ],
                        "name": "M. D. Roberts",
                        "slug": "M.-D.-Roberts",
                        "structuredName": {
                            "firstName": "M.",
                            "lastName": "Roberts",
                            "middleNames": [
                                "de",
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. D. Roberts"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 119542862,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "a7bc5286cfc786735a004caaa59cd3b7313ef6d7",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Computer-v.-Chess-Player-Bernstein-Roberts",
            "title": {
                "fragments": [],
                "text": "Computer v. Chess-Player"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1958
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66740476"
                        ],
                        "name": "B. Bowden",
                        "slug": "B.-Bowden",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Bowden",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Bowden"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "66740476"
                        ],
                        "name": "B. Bowden",
                        "slug": "B.-Bowden",
                        "structuredName": {
                            "firstName": "B.",
                            "lastName": "Bowden",
                            "middleNames": [
                                "V."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Bowden"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 57338595,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "881ff74753a53f17bfd534a1217c2fe17ed11f5e",
            "isKey": false,
            "numCitedBy": 222,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Faster-than-thought-Bowden-Bowden",
            "title": {
                "fragments": [],
                "text": "Faster than thought"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1953
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {},
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 9,
        "totalPages": 1
    },
    "page_url": "https://www.semanticscholar.org/paper/Some-Studies-in-Machine-Learning-Using-the-Game-of-Samuel/e9e6bb5f2a04ae30d8ecc9287f8b702eedd7b772?sort=total-citations"
}