{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50819900"
                        ],
                        "name": "Yifan Hu",
                        "slug": "Yifan-Hu",
                        "structuredName": {
                            "firstName": "Yifan",
                            "lastName": "Hu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yifan Hu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3146362"
                        ],
                        "name": "C. Volinsky",
                        "slug": "C.-Volinsky",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Volinsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Volinsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 78
                            }
                        ],
                        "text": ", explicit feedback data of ratings [4] and implicit feedback data of actions [11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 116
                            }
                        ],
                        "text": "Being aware that there are many different algorithms proposed for modeling both explicit and implicit feedback data [11, 16, 21, 22], we chose the classical ones for better controlling the differences of algorithms while focusing on studying the differences that are inherent in the two types of feedback data."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 10537313,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "184b7281a87ee16228b24716ca02b29519d52eb5",
            "isKey": false,
            "numCitedBy": 2749,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "A common task of recommender systems is to improve customer experience through personalized recommendations based on prior implicit feedback. These systems passively track different sorts of user behavior, such as purchase history, watching habits and browsing activity, in order to model user preferences. Unlike the much more extensively researched explicit feedback, we do not have any direct input from the users regarding their preferences. In particular, we lack substantial evidence on which products consumer dislike. In this work we identify unique properties of implicit feedback datasets. We propose treating the data as indication of positive and negative preference associated with vastly varying confidence levels. This leads to a factor model which is especially tailored for implicit feedback recommenders. We also suggest a scalable optimization procedure, which scales linearly with the data size. The algorithm is used successfully within a recommender system for television shows. It compares favorably with well tuned implementations of other known methods. In addition, we offer a novel way to give explanations to recommendations given by this factor model."
            },
            "slug": "Collaborative-Filtering-for-Implicit-Feedback-Hu-Koren",
            "title": {
                "fragments": [],
                "text": "Collaborative Filtering for Implicit Feedback Datasets"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "This work identifies unique properties of implicit feedback datasets and proposes treating the data as indication of positive and negative preference associated with vastly varying confidence levels, which leads to a factor model which is especially tailored for implicit feedback recommenders."
            },
            "venue": {
                "fragments": [],
                "text": "2008 Eighth IEEE International Conference on Data Mining"
            },
            "year": 2008
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2477993"
                        ],
                        "name": "Bart P. Knijnenburg",
                        "slug": "Bart-P.-Knijnenburg",
                        "structuredName": {
                            "firstName": "Bart",
                            "lastName": "Knijnenburg",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bart P. Knijnenburg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1918235"
                        ],
                        "name": "M. Willemsen",
                        "slug": "M.-Willemsen",
                        "structuredName": {
                            "firstName": "Martijn",
                            "lastName": "Willemsen",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Willemsen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2382247"
                        ],
                        "name": "Zeno Gantner",
                        "slug": "Zeno-Gantner",
                        "structuredName": {
                            "firstName": "Zeno",
                            "lastName": "Gantner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zeno Gantner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1881130"
                        ],
                        "name": "Hakan Soncu",
                        "slug": "Hakan-Soncu",
                        "structuredName": {
                            "firstName": "Hakan",
                            "lastName": "Soncu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Hakan Soncu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "33552777"
                        ],
                        "name": "Chris Newell",
                        "slug": "Chris-Newell",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Newell",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chris Newell"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[14] proposed a comprehensive framework taking into account both objective system measurements and subjective user perceptions to explain user experience."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2944283,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "cfa3144fac24dfd25950fa9393c76a8df014943f",
            "isKey": false,
            "numCitedBy": 624,
            "numCiting": 136,
            "paperAbstract": {
                "fragments": [],
                "text": "Research on recommender systems typically focuses on the accuracy of prediction algorithms. Because accuracy only partially constitutes the user experience of a recommender system, this paper proposes a framework that takes a user-centric approach to recommender system evaluation. The framework links objective system aspects to objective user behavior through a series of perceptual and evaluative constructs (called subjective system aspects and experience, respectively). Furthermore, it incorporates the influence of personal and situational characteristics on the user experience. This paper reviews how current literature maps to the framework and identifies several gaps in existing work. Consequently, the framework is validated with four field trials and two controlled experiments and analyzed using Structural Equation Modeling. The results of these studies show that subjective system aspects and experience variables are invaluable in explaining why and how the user experience of recommender systems comes about. In all studies we observe that perceptions of recommendation quality and/or variety are important mediators in predicting the effects of objective system aspects on the three components of user experience: process (e.g. perceived effort, difficulty), system (e.g. perceived system effectiveness) and outcome (e.g. choice satisfaction). Furthermore, we find that these subjective aspects have strong and sometimes interesting behavioral correlates (e.g. reduced browsing indicates higher system effectiveness). They also show several tradeoffs between system aspects and personal and situational characteristics (e.g. the amount of preference feedback users provide is a tradeoff between perceived system usefulness and privacy concerns). These results, as well as the validated framework itself, provide a platform for future research on the user-centric evaluation of recommender systems."
            },
            "slug": "Explaining-the-user-experience-of-recommender-Knijnenburg-Willemsen",
            "title": {
                "fragments": [],
                "text": "Explaining the user experience of recommender systems"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "This paper proposes a framework that takes a user-centric approach to recommender system evaluation that links objective system aspects to objective user behavior through a series of perceptual and evaluative constructs (called subjective system aspects and experience, respectively)."
            },
            "venue": {
                "fragments": [],
                "text": "User Modeling and User-Adapted Interaction"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "29241448"
                        ],
                        "name": "S. Ahrens",
                        "slug": "S.-Ahrens",
                        "structuredName": {
                            "firstName": "Sophie",
                            "lastName": "Ahrens",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Ahrens"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 510077,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9f51a9f05e9a295262999a37278f8b07dd4f4a91",
            "isKey": false,
            "numCitedBy": 2179,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Beyond NDCG: behavioral testing of recommender systems Collaborative Knowledge Base Embedding for Recommender ...Recommender Systems Based On Personality Traits: Could GitHub microsoft/recommenders: Best Practices on Classifying Different Types of Recommender Systems | BluePi5 Problems of Recommender Systems ReadWriteBuilding recommender systems with Azure Machine Learning Building Recommender Systems with Machine Learning and AI Research paper recommender systems a random-walk based In-Depth Guide: How Recommender Systems Work | Built InRecSys – ACM Recommender SystemsR Pubsure Check Research Manuscript Online To Avoid Desk Matrix factorization (recommender systems) WikipediaIntroduction to Recommender Systems | Tryolabs[1606.07792] Wide & Deep Learning for Recommender Systems13 The Net?ix Recommender System: Algorithms, Business 10 Datasets One Must Know To Build Recommender SystemsRecommender Systems in Keras | Movie Recommendations using Deep Matrix Factorization Models for Recommender Systems(PDF) Recommender Systems Handbook ResearchGateIntroduction to recommender systems | by Baptiste Rocca An Easy Introduction to Machine Learning Recommender SystemsRecommender Systems Datasets Computer ScienceDeep Learning Based Recommender Systems | by Sciforce Towards the Next Generation of Recommender Systems: A Cold-Start Problem in Recommender Systems and its Recommender System Application Developments: A SurveyRUCAIBox · GitHub16. Recommender Systems — Dive into Deep Learning 0.17.1 Recommendation Systems Stanford UniversityRecommender system WikipediaMachine Learning for Recommender systems — Part 1 Five Types of Recommender Systems and The APP SolutionsRecSys 2020 (Online) ACM Recommender Systems\"A Theory-Driven Design Framework for Social Recommender Evaluation Metrics for Recommender Systems | by Claire Jun 03, 2018 · Recommender systems are one of the most successful and widespread application of machine learning technologies in business. There were many people on waiting list that could not attend our MLMU Essay about racial inequality essay on earthquake of nepal 2015 history essay graphic organizer, essay on man alexander pope anemia case study nursing systems based a paper recommender random-walk approach Research, violence essay romeo and juliet, soccer essay scholarships media and culture essay topics. Dystopian argumentative essay.Avoid desk rejection and make sure your research manuscript is submission ready with R Pubsure. Journal submission was never easier. Get your personalized manuscript check report online and revise your manuscript to make it perfect. Explore new features like plagiarism check, journal recommender and downloadable word file with R Pubsure Pro Plan.Apr 30, 2021 · Recommender systems are lifesavers in the infinite seething sea of ecommerce, improving customer experience. Recommender engines are eliminating the tyranny of choice, smoothing the way for Jun 02, 2019 · Recommender systems are really critical in some industries as they can generate a huge amount of income when they are efficient or also be a way to stand out significantly from competitors. As a proof of the importance of recommender systems, we can mention that, a few years ago, Netflix organised a challenges (the “Netflix prize”) where Recommender systems can be defined as programs which attempt to recommend the most suitable items (products or services) to particular users (individuals or businesses) by predicting a user’s interest in an item based on related information about the items, the users and the interactions between items and users [1]. TheRecommender Systems Based On Personality Traits: Could Human Psychological Aspects Influence The Computer Decision Making Process?|Maria Augusta Silveira Netto Nunes, Aiaa/Asme Adaptive Structures Forum: April 18-19, 1996/Salt Lake City, Ut|AIAA (American Institute Of Aeronautics, Alzheimers Disease (Encyclopedia Of Health)|William A. Check, ...Sep 27, 2010 · Social recommender systems utilize data regarding users’ social relationships in filtering relevant information to users. To date, results show that incorporating social relationship data – beyond consumption profile similarity – is beneficial only in a very limited set of cases. The main conjecture of this study is that the inconclusive results are, at least to some extent, due ...Nov 14, 2015 · Recommender systems are defined as recommendation inputs given by the people, which the system then aggregates and directs to appropriate recipients. It can be further defined as a system that produces individualized recommendations as output or has the effect of guiding the user in a personalized way to interesting objects in a larger space of Jun 24, 2016 · In this paper, we present Wide & Deep learning---jointly trained wide linear models and deep neural networks---to combine the benefits of memorization and generalization for recommender systems. We productionized and evaluated the system on Google Play, a commercial mobile app store with over one billion active users and over one million apps.Jan 28, 2009 · On the topic of user preferences, recommender systems may also incorrectly label users – a la this classic Wall St Journal story from 2002, If TiVo Thinks You Are Gay, The 16th ACM Recommender Systems Conference will take place in Seattle from Sept. 18 23, 2022. Latest News Sept 30, 2021: RecSys 2022 will come back to the United States.Sep 26, 2021 · The recommender systems face a problem in recommending items to users in case there is very little data available related to the user or item. This is called the cold-start problem. Here in this article, we will discuss the cold-start problems faced by the recommender system with their causes and approaches to overcome this issue.The Net?ix Recommender System: Algorithms, Business Value, and Innovation CARLOS A. GOMEZ-URIBE and NEIL HUNT, Net?ix, Inc. This article discusses the various algorithms that make up the Net?ix recommender system, and describes its business purpose. We also describe the role of search and related algorithms, which for us turns into a16. Recommender Systems¶. Shuai Zhang (Amazon), Aston Zhang (Amazon), and Yi Tay (Google). Recommender systems are widely employed in industry and are ubiquitous in our daily lives. These systems are utilized in a number of areas such as online shopping sites (e.g., amazon.com), music/movie services site (e.g., Netflix and Spotify), mobile application stores ...Recommender Systems (RSs) are software tools and techniques providing suggestions for items to be of use to a user. In this introductory chapter we ...The ACM Recommender Systems conference (RecSys) is the premier international forum for the presentation of new research results, systems and techniques in the broad field of recommender systems. Recommendation is a particular form of information filtering, that exploits past behaviors and user similarities to generate a list of information May 09, 2018 · Recommender systems have different ways of being evaluated and the answer which evaluation method to choose depends on your goal. If you're solely interested in recommending the top 5 items (i.e. the most probable items the user will interact with), you don’t need to consider the predictions regarding the rest of the items when conducting the Nov 27, 2021 · Building Recommender Systems with Machine Learning and AI: Help people discover new products and content with deep learning, neural networks, and machine learning recommendations, 2nd Edition. Learn how to build recommender systems from one of Amazon’s pioneers in the field.Recommender systems usually make personalized recommendation with user-item interaction ratings, implicit feedback and auxiliary information. Matrix factorization is the basic idea to predict a per-sonalized ranking over a set of items for an indi-vidual user with the similarities among users and items. In this paper, we propose a novel matrixrecommender systems are attracting increasing attention. For ex-ample, Yu et al. [30] uses a heterogeneous information network to represent users, items, item attributes, and the interlinked relation-ships in a knowledge base. They extract meta-path based latentMay 01, 2019 · Recommender systems keep customers on a businesses’ site longer, they interact with more products/content, and it suggests products or content a customer is likely to purchase or engage with as a store sales associate might. Below, we’ll show you what this repository is, and how it eases pain points for data scientists building and Recommender Systems and Personalization Datasets. Julian McAuley, UCSD. Description. This page contains a collection of datasets that have been collected for research by our lab. Datasets contain the following features: user/item interactions; star ratings; timestamps; product reviews; social networks; item-to-item relationships (e.g May 02, 2021 · This article was published as a part of the Data Science Blogathon.. Introduction. With the ever-increasing data on the web over years, Recommender Systems (RS) have come in to the picture ranging from e-commerce to e-resource. Today, big giants like Netflix, Amazon, YouTube, etc. use RS to help users find information of use to improve their experience and ...recommender systems."
            },
            "slug": "Recommender-Systems-Ahrens",
            "title": {
                "fragments": [],
                "text": "Recommender Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Recommender systems can be defined as programs which attempt to recommend the most suitable items (products or services) to particular users (individuals or businesses) by predicting a user’s interest in an item based on related information about the items, the users and the interactions between items and users."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2012
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2110999732"
                        ],
                        "name": "Qian Zhao",
                        "slug": "Qian-Zhao",
                        "structuredName": {
                            "firstName": "Qian",
                            "lastName": "Zhao",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qian Zhao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744007"
                        ],
                        "name": "Gediminas Adomavicius",
                        "slug": "Gediminas-Adomavicius",
                        "structuredName": {
                            "firstName": "Gediminas",
                            "lastName": "Adomavicius",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gediminas Adomavicius"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145192090"
                        ],
                        "name": "F. M. Harper",
                        "slug": "F.-M.-Harper",
                        "structuredName": {
                            "firstName": "F.",
                            "lastName": "Harper",
                            "middleNames": [
                                "Maxwell"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. M. Harper"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1918235"
                        ],
                        "name": "M. Willemsen",
                        "slug": "M.-Willemsen",
                        "structuredName": {
                            "firstName": "Martijn",
                            "lastName": "Willemsen",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Willemsen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 0
                            }
                        ],
                        "text": "[9, 15, 20, 33, 34] have all been studied in prior literature."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                }
            ],
            "corpusId": 6339339,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "676f4f2d6c01e2fb99e802f97fe8a774b66cdf4b",
            "isKey": false,
            "numCitedBy": 18,
            "numCiting": 34,
            "paperAbstract": {
                "fragments": [],
                "text": "Current recommender systems often show the same most-highly recommended items again and again ignoring the feedback that users neither rate nor click on those items. We conduct an online field experiment to test two ways of manipulating top-N recommendations with the goal of improving user experience: cycling the top-N recommendation based on their past presentation and serpentining the top-N list mixing the best items into later recommendation requests. We find interesting tensions between opt-outs and activities, user perceived accuracy and freshness. Cycling within the same session might be a \"love it or hate it\" recommender property because users in it have a higher opt-out rate but engage in more activities. Cycling across sessions and serpentining increase user activities without significantly affecting opt-out rates. Users perceive more change and freshness but less accuracy and familiarity. Combining cycling and serpentining does not work as well as each individual manipulation separately. These two ways of manipulations on top-N list demonstrate some attractive properties but also call for innovative approaches to overcome their potential costs."
            },
            "slug": "Toward-Better-Interactions-in-Recommender-Systems:-Zhao-Adomavicius",
            "title": {
                "fragments": [],
                "text": "Toward Better Interactions in Recommender Systems: Cycling and Serpentining Approaches for Top-N Item Lists"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "An online field experiment is conducted to test two ways of manipulating top-N recommendations with the goal of improving user experience: cycling theTop-N recommendation based on their past presentation and serpentining the top- N list mixing the best items into later recommendation requests."
            },
            "venue": {
                "fragments": [],
                "text": "CSCW"
            },
            "year": 2017
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[15] elaborates the evolution of recommender system research from being concentrated purely on algorithms to research focused on the rich set of questions around the user experience with the recommender."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 0
                            }
                        ],
                        "text": "[9, 15, 20, 33, 34] have all been studied in prior literature."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 49,
                                "start": 45
                            }
                        ],
                        "text": "User-centric research in recommender systems [15] tends to focus on a broad set of factors and metrics that contribute to the success of recommender systems with the theoretic goal of supporting user decision making processes in front of a large amount of choices."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 8996665,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "058e1c94d68da04fa839022c1b48c8caf15c93ab",
            "isKey": false,
            "numCitedBy": 689,
            "numCiting": 101,
            "paperAbstract": {
                "fragments": [],
                "text": "Since their introduction in the early 1990’s, automated recommender systems have revolutionized the marketing and delivery of commerce and content by providing personalized recommendations and predictions over a variety of large and complex product offerings. In this article, we review the key advances in collaborative filtering recommender systems, focusing on the evolution from research concentrated purely on algorithms to research concentrated on the rich set of questions around the user experience with the recommender. We show through examples that the embedding of the algorithm in the user experience dramatically affects the value to the user of the recommender. We argue that evaluating the user experience of a recommender requires a broader set of measures than have been commonly used, and suggest additional measures that have proven effective. Based on our analysis of the state of the field, we identify the most important open research problems, and outline key challenges slowing the advance of the state of the art, and in some cases limiting the relevance of research to real-world applications."
            },
            "slug": "Recommender-systems:-from-algorithms-to-user-Konstan-Riedl",
            "title": {
                "fragments": [],
                "text": "Recommender systems: from algorithms to user experience"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "It is argued that evaluating the user experience of a recommender requires a broader set of measures than have been commonly used, and additional measures that have proven effective are suggested."
            },
            "venue": {
                "fragments": [],
                "text": "User Modeling and User-Adapted Interaction"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1825333"
                        ],
                        "name": "C. Freudenthaler",
                        "slug": "C.-Freudenthaler",
                        "structuredName": {
                            "firstName": "Christoph",
                            "lastName": "Freudenthaler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Freudenthaler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2382247"
                        ],
                        "name": "Zeno Gantner",
                        "slug": "Zeno-Gantner",
                        "structuredName": {
                            "firstName": "Zeno",
                            "lastName": "Gantner",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zeno Gantner"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1388781075"
                        ],
                        "name": "L. Schmidt-Thieme",
                        "slug": "L.-Schmidt-Thieme",
                        "structuredName": {
                            "firstName": "Lars",
                            "lastName": "Schmidt-Thieme",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Schmidt-Thieme"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 10795036,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "db16e908246f32b60a6e0a8e27093aa145fbb1ed",
            "isKey": false,
            "numCitedBy": 3865,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "Item recommendation is the task of predicting a personalized ranking on a set of items (e.g. websites, movies, products). In this paper, we investigate the most common scenario with implicit feedback (e.g. clicks, purchases). There are many methods for item recommendation from implicit feedback like matrix factorization (MF) or adaptive k-nearest-neighbor (kNN). Even though these methods are designed for the item prediction task of personalized ranking, none of them is directly optimized for ranking. In this paper we present a generic optimization criterion BPR-Opt for personalized ranking that is the maximum posterior estimator derived from a Bayesian analysis of the problem. We also provide a generic learning algorithm for optimizing models with respect to BPR-Opt. The learning method is based on stochastic gradient descent with bootstrap sampling. We show how to apply our method to two state-of-the-art recommender models: matrix factorization and adaptive kNN. Our experiments indicate that for the task of personalized ranking our optimization method outperforms the standard learning techniques for MF and kNN. The results show the importance of optimizing models for the right criterion."
            },
            "slug": "BPR:-Bayesian-Personalized-Ranking-from-Implicit-Rendle-Freudenthaler",
            "title": {
                "fragments": [],
                "text": "BPR: Bayesian Personalized Ranking from Implicit Feedback"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This paper presents a generic optimization criterion BPR-Opt for personalized ranking that is the maximum posterior estimator derived from a Bayesian analysis of the problem and provides a generic learning algorithm for optimizing models with respect to B PR-Opt."
            },
            "venue": {
                "fragments": [],
                "text": "UAI"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144544965"
                        ],
                        "name": "Mario Rodríguez",
                        "slug": "Mario-Rodríguez",
                        "structuredName": {
                            "firstName": "Mario",
                            "lastName": "Rodríguez",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mario Rodríguez"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3171708"
                        ],
                        "name": "C. Posse",
                        "slug": "C.-Posse",
                        "structuredName": {
                            "firstName": "Christian",
                            "lastName": "Posse",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Posse"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3270238"
                        ],
                        "name": "Ethan Zhang",
                        "slug": "Ethan-Zhang",
                        "structuredName": {
                            "firstName": "Ethan",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Ethan Zhang"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 176,
                                "start": 172
                            }
                        ],
                        "text": "Correspondingly in machine-learning-based recommender systems, it is typically modeled as a multi-objective optimization problem to take into account the multiple criteria [24]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2462496,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e2bc78ff7330753bcda871706cc1ff59fe7df2f9",
            "isKey": false,
            "numCitedBy": 85,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "We address the problem of optimizing recommender systems for multiple relevance objectives that are not necessarily aligned. Specifically, given a recommender system that optimizes for one aspect of relevance, semantic matching (as defined by any notion of similarity between source and target of recommendation; usually trained on CTR), we want to enhance the system with additional relevance signals that will increase the utility of the recommender system, but that may simultaneously sacrifice the quality of the semantic match. The issue is that semantic matching is only one relevance aspect of the utility function that drives the recommender system, albeit a significant aspect. In talent recommendation systems, job posters want candidates who are a good match to the job posted, but also prefer those candidates to be open to new opportunities. Recommender systems that recommend discussion groups must ensure that the groups are relevant to the users' interests, but also need to favor active groups over inactive ones. We refer to these additional relevance signals (job-seeking intent and group activity) as extraneous features, and they account for aspects of the utility function that are not captured by the semantic match (i.e. post-CTR down-stream utilities that reflect engagement: time spent reading, sharing, commenting, etc). We want to include these extraneous features into the recommendations, but we want to do so while satisfying the following requirements: 1) we do not want to drastically sacrifice the quality of the semantic match, and 2) we want to quantify exactly how the semantic match would be affected as we control the different aspects of the utility function. In this paper, we present an approach that satisfies these requirements.\n We frame our approach as a general constrained optimization problem and suggest ways in which it can be solved efficiently by drawing from recent research on optimizing non-smooth rank metrics for information retrieval. Our approach features the following characteristics: 1) it is model and feature agnostic, 2) it does not require additional labeled training data to be collected, and 3) it can be easily incorporated into an existing model as an additional stage in the computation pipeline. We validate our approach in a revenue-generating recommender system that ranks billions of candidate recommendations on a daily basis and show that a significant improvement in the utility of the recommender system can be achieved with an acceptable and predictable degradation in the semantic match quality of the recommendations."
            },
            "slug": "Multiple-objective-optimization-in-recommender-Rodríguez-Posse",
            "title": {
                "fragments": [],
                "text": "Multiple objective optimization in recommender systems"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "The problem of optimizing recommender systems for multiple relevance objectives that are not necessarily aligned is addressed as a general constrained optimization problem and ways in which it can be solved efficiently are suggested by drawing from recent research on optimizing non-smooth rank metrics for information retrieval."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '12"
            },
            "year": 2012
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1744007"
                        ],
                        "name": "Gediminas Adomavicius",
                        "slug": "Gediminas-Adomavicius",
                        "structuredName": {
                            "firstName": "Gediminas",
                            "lastName": "Adomavicius",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Gediminas Adomavicius"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1904759"
                        ],
                        "name": "N. Manouselis",
                        "slug": "N.-Manouselis",
                        "structuredName": {
                            "firstName": "Nikos",
                            "lastName": "Manouselis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Manouselis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "37834098"
                        ],
                        "name": "YoungOk Kwon",
                        "slug": "YoungOk-Kwon",
                        "structuredName": {
                            "firstName": "YoungOk",
                            "lastName": "Kwon",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "YoungOk Kwon"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 3,
                                "start": 0
                            }
                        ],
                        "text": "[1] define the recommendation problem as a multi-criteria decision making problem (MCDM) and argue that the suitability of a recommendation for a particular user may depend on more than one utility-related aspect that the user takes into consideration when making the choice."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16701132,
            "fieldsOfStudy": [
                "Economics"
            ],
            "id": "dd0d6972e710ce96671a1cede6e6c4e6c3a3996c",
            "isKey": false,
            "numCitedBy": 283,
            "numCiting": 190,
            "paperAbstract": {
                "fragments": [],
                "text": "This chapter aims to provide an overview of the class of multi-criteria recommender systems, i.e., the category of recommender systems that use multi-criteria preference ratings. Traditionally, the vast majority of recommender systems literature has focused on providing recommendations by modelling a user’s utility (or preference) for an item as a single preference rating. However, where possible, capturing richer user preferences along several dimensions—for example, capturing not only the user’s overall preference for a given movie but also her preferences for specific movie aspects (such as acting, story, or visual effects)—can provide opportunities for further improvements in recommendation quality. As a result, a number of recommendation techniques that attempt to take advantage of such multi-criteria preference information have been developed in recent years. A review of current algorithms that use multi-criteria ratings for calculating predictions and generating recommendations is provided. The chapter concludes with a discussion on open issues and future challenges for the class of multi-criteria rating recommenders."
            },
            "slug": "Multi-Criteria-Recommender-Systems-Adomavicius-Manouselis",
            "title": {
                "fragments": [],
                "text": "Multi-Criteria Recommender Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 83,
                "text": "This chapter aims to provide an overview of the class of multi-criteria recommender systems, i.e., the category ofRecommender systems that use multi-Criteria preference ratings, with a discussion on open issues and future challenges for the class."
            },
            "venue": {
                "fragments": [],
                "text": "Recommender Systems Handbook"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1682418"
                        ],
                        "name": "C. Aggarwal",
                        "slug": "C.-Aggarwal",
                        "structuredName": {
                            "firstName": "Charu",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Aggarwal"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 196070511,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "df0bbfe04af68a4a746e92aae386c0e8d1301451",
            "isKey": false,
            "numCitedBy": 378,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "This book comprehensively covers the topic of recommender systems, which provide personalized recommendations of products or services to users based on their previous searches or purchases. Recommender system methods have been adapted to diverse applications including query log mining, social networking, news recommendations, and computational advertising. This book synthesizes both fundamental and advanced topics of a research area that has now reached maturity. The chapters of this book are organized into three categories: - Algorithms and evaluation: These chapters discuss the fundamental algorithms in recommender systems, including collaborative filtering methods, content-based methods, knowledge-based methods, ensemble-based methods, and evaluation. - Recommendations in specific domains and contexts: the context of a recommendation can be viewed as important side information that affects the recommendation goals. Different types of context such as temporal data, spatial data, social data, tagging data, and trustworthiness are explored. - Advanced topics and applications: Various robustness aspects of recommender systems, such as shilling systems, attack models, and their defenses are discussed. In addition, recent topics, such as learning to rank, multi-armed bandits, group systems, multi-criteria systems, and active learning systems, are introduced together with applications. Although this book primarily serves as a textbook, it will also appeal to industrial practitioners and researchers due to its focus on applications and references. Numerous examples and exercises have been provided, and a solution manual is available for instructors."
            },
            "slug": "Recommender-Systems:-The-Textbook-Aggarwal",
            "title": {
                "fragments": [],
                "text": "Recommender Systems: The Textbook"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "This book comprehensively covering the topic of recommender systems, which provide personalized recommendations of products or services to users based on their previous searches or purchases, synthesizes both fundamental and advanced topics of a research area that has now reached maturity."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2016
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3039934"
                        ],
                        "name": "S. McNee",
                        "slug": "S.-McNee",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "McNee",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. McNee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[19] proposed an analytical process model called Human Recommender Interaction that acts as a bridge between user information seeking tasks and recommendation algorithms to help with the design and structure of recommender systems."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 3058450,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "704bedc4bdd74f5f35a4852157ff44dc6e5be79a",
            "isKey": false,
            "numCitedBy": 152,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems do not always generate good recommendations for users. In order to improve recommender quality, we argue that recommenders need a deeper understanding of users and their information seeking tasks. Human-Recommender Interaction (HRI) provides a framework and a methodology for understanding users, their tasks, and recommender algorithms using a common language. Further, by using an analytic process model, HRI becomes not only descriptive, but also constructive. It can help with the design and structure of a recommender system, and it can act as a bridge between user information seeking tasks and recommender algorithms."
            },
            "slug": "Making-recommendations-better:-an-analytic-model-McNee-Riedl",
            "title": {
                "fragments": [],
                "text": "Making recommendations better: an analytic model for human-recommender interaction"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "It is argued that recommenders need a deeper understanding of users and their information seeking tasks and recommender algorithms using a common language and an analytic process model."
            },
            "venue": {
                "fragments": [],
                "text": "CHI Extended Abstracts"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144741762"
                        ],
                        "name": "P. Resnick",
                        "slug": "P.-Resnick",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Resnick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Resnick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070970"
                        ],
                        "name": "H. Varian",
                        "slug": "H.-Varian",
                        "structuredName": {
                            "firstName": "Hal",
                            "lastName": "Varian",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Varian"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1381259,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dbdabdf9e653e11eb4d44f69f645a564622220b3",
            "isKey": false,
            "numCitedBy": 2816,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems assist and augment this natural social process. In a typical recommender system people provide recommendations as inputs, which the system then aggregates and directs to appropriate recipients. In some cases the primary transformation is in the aggregation; in others the system’s value lies in its ability to make good matches between the recommenders and those seeking recommendations. The developers of the first recommender system, Tapestry [1], coined the phrase “collaborative filtering” and several others have adopted it. We prefer the more general term “recommender system” for two reasons. First, recommenders may not explictly collaborate with recipients, who may be unknown to each other. Second, recommendations may suggest particularly interesting items, in addition to indicating those that should be filtered out. This special section includes descriptions of five recommender systems. A sixth article analyzes incentives for provision of recommendations. Figure 1 places the systems in a technical design space defined by five dimensions. First, the contents of an evaluation can be anything from a single bit (recommended or not) to unstructured textual annotations. Second, recommendations may be entered explicitly, but several systems gather implicit evaluations: GroupLens monitors users’ reading times; PHOAKS mines Usenet articles for mentions of URLs; and Siteseer mines personal bookmark lists. Third, recommendations may be anonymous, tagged with the source’s identity, or tagged with a pseudonym. The fourth dimension, and one of the richest areas for exploration, is how to aggregate evaluations. GroupLens, PHOAKS, and Siteseer employ variants on weighted voting. Fab takes that one step further to combine evaluations with content analysis. ReferralWeb combines suggested links between people to form longer referral chains. Finally, the (perhaps aggregated) evaluations may be used in several ways: negative recommendations may be filtered out, the items may be sorted according to numeric evaluations, or evaluations may accompany items in a display. Figures 2 and 3 identify dimensions of the domain space: The kinds of items being recommended and the people among whom evaluations are shared. Consider, first, the domain of items. The sheer volume is an important variable: Detailed textual reviews of restaurants or movies may be practical, but applying the same approach to thousands of daily Netnews messages would not. Ephemeral media such as netnews (most news servers throw away articles after one or two weeks) place a premium on gathering and distributing evaluations quickly, while evaluations for 19th century books can be gathered at a more leisurely pace. The last dimension describes the cost structure of choices people make about the items. Is it very costly to miss IT IS OFTEN NECESSARY TO MAKE CHOICES WITHOUT SUFFICIENT personal experience of the alternatives. In everyday life, we rely on"
            },
            "slug": "Recommender-systems-Resnick-Varian",
            "title": {
                "fragments": [],
                "text": "Recommender systems"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "This special section includes descriptions of five recommender systems, which provide recommendations as inputs, which the system then aggregates and directs to appropriate recipients, and which combine evaluations with content analysis."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145192090"
                        ],
                        "name": "F. M. Harper",
                        "slug": "F.-M.-Harper",
                        "structuredName": {
                            "firstName": "F.",
                            "lastName": "Harper",
                            "middleNames": [
                                "Maxwell"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. M. Harper"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3347842"
                        ],
                        "name": "F. Xu",
                        "slug": "F.-Xu",
                        "structuredName": {
                            "firstName": "Funing",
                            "lastName": "Xu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Xu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48712213"
                        ],
                        "name": "Harmanpreet Kaur",
                        "slug": "Harmanpreet-Kaur",
                        "structuredName": {
                            "firstName": "Harmanpreet",
                            "lastName": "Kaur",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Harmanpreet Kaur"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2582216"
                        ],
                        "name": "Kyle Condiff",
                        "slug": "Kyle-Condiff",
                        "structuredName": {
                            "firstName": "Kyle",
                            "lastName": "Condiff",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kyle Condiff"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "103888220"
                        ],
                        "name": "Shuo Chang",
                        "slug": "Shuo-Chang",
                        "structuredName": {
                            "firstName": "Shuo",
                            "lastName": "Chang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Shuo Chang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739628"
                        ],
                        "name": "L. Terveen",
                        "slug": "L.-Terveen",
                        "structuredName": {
                            "firstName": "Loren",
                            "lastName": "Terveen",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Terveen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 71
                            }
                        ],
                        "text": ", quadratic) because different users prefer different kinds of balance [9] and hence going beyond linear models here might be necessary as well."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 0
                            }
                        ],
                        "text": "[9, 15, 20, 33, 34] have all been studied in prior literature."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 66
                            }
                        ],
                        "text": "on top of predictions help improve user engagement and experience [9, 34]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6354549,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "604eaa4febe0df273ad021b4d9244e3dde2575e7",
            "isKey": false,
            "numCitedBy": 66,
            "numCiting": 25,
            "paperAbstract": {
                "fragments": [],
                "text": "The essence of a recommender system is that it can recommend items personalized to the preferences of an individual user. But typically users are given no explicit control over this personalization, and are instead left guessing about how their actions affect the resulting recommendations. We hypothesize that any recommender algorithm will better fit some users' expectations than others, leaving opportunities for improvement. To address this challenge, we study a recommender that puts some control in the hands of users. Specifically, we build and evaluate a system that incorporates user-tuned popularity and recency modifiers, allowing users to express concepts like \"show more popular items\". We find that users who are given these controls evaluate the resulting recommendations much more positively. Further, we find that users diverge in their preferred settings, confirming the importance of giving control to users."
            },
            "slug": "Putting-Users-in-Control-of-their-Recommendations-Harper-Xu",
            "title": {
                "fragments": [],
                "text": "Putting Users in Control of their Recommendations"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This work builds and evaluates a system that incorporates user-tuned popularity and recency modifiers, allowing users to express concepts like \"show more popular items\" and finds that users who are given these controls evaluate the resulting recommendations much more positively."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "9194382"
                        ],
                        "name": "Chaoxia Wu",
                        "slug": "Chaoxia-Wu",
                        "structuredName": {
                            "firstName": "Chaoxia",
                            "lastName": "Wu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chaoxia Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143629707"
                        ],
                        "name": "Amr Ahmed",
                        "slug": "Amr-Ahmed",
                        "structuredName": {
                            "firstName": "Amr",
                            "lastName": "Ahmed",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Amr Ahmed"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2638246"
                        ],
                        "name": "Alex Beutel",
                        "slug": "Alex-Beutel",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Beutel",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alex Beutel"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "46234526"
                        ],
                        "name": "Alex Smola",
                        "slug": "Alex-Smola",
                        "structuredName": {
                            "firstName": "Alex",
                            "lastName": "Smola",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Alex Smola"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3004697"
                        ],
                        "name": "How Jing",
                        "slug": "How-Jing",
                        "structuredName": {
                            "firstName": "How",
                            "lastName": "Jing",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "How Jing"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[31] proposed to use recurrent neural networks for the state transition model and demonstrated some benefits, which we think is a promising direction to try."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5362246,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "119868d3a5862c514e64d7855b41ff9927c311d4",
            "isKey": false,
            "numCitedBy": 520,
            "numCiting": 44,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems traditionally assume that user profiles and movie attributes are static. Temporal dynamics are purely reactive, that is, they are inferred after they are observed, e.g. after a user's taste has changed or based on hand-engineered temporal bias corrections for movies. We propose Recurrent Recommender Networks (RRN) that are able to predict future behavioral trajectories. This is achieved by endowing both users and movies with a Long Short-Term Memory (LSTM) autoregressive model that captures dynamics, in addition to a more traditional low-rank factorization. On multiple real-world datasets, our model offers excellent prediction accuracy and it is very compact, since we need not learn latent state but rather just the state transition function."
            },
            "slug": "Recurrent-Recommender-Networks-Wu-Ahmed",
            "title": {
                "fragments": [],
                "text": "Recurrent Recommender Networks"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Recurrent Recommender Networks (RRN) are proposed that are able to predict future behavioral trajectories by endowing both users and movies with a Long Short-Term Memory (LSTM) autoregressive model that captures dynamics, in addition to a more traditional low-rank factorization."
            },
            "venue": {
                "fragments": [],
                "text": "WSDM"
            },
            "year": 2017
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3039934"
                        ],
                        "name": "S. McNee",
                        "slug": "S.-McNee",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "McNee",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. McNee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1386980,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e84e9f82f49eb5a21cdf2306e42478773ff9e82a",
            "isKey": false,
            "numCitedBy": 1041,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems have shown great potential to help users find interesting and relevant items from within a large information space. Most research up to this point has focused on improving the accuracy of recommender systems. We believe that not only has this narrow focus been misguided, but has even been detrimental to the field. The recommendations that are most accurate according to the standard metrics are sometimes not the recommendations that are most useful to users. In this paper, we propose informal arguments that the recommender community should move beyond the conventional accuracy metrics and their associated experimental methodologies. We propose new user-centric directions for evaluating recommender systems."
            },
            "slug": "Being-accurate-is-not-enough:-how-accuracy-metrics-McNee-Riedl",
            "title": {
                "fragments": [],
                "text": "Being accurate is not enough: how accuracy metrics have hurt recommender systems"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper proposes informal arguments that the recommender community should move beyond the conventional accuracy metrics and their associated experimental methodologies, and proposes new user-centric directions for evaluating recommender systems."
            },
            "venue": {
                "fragments": [],
                "text": "CHI Extended Abstracts"
            },
            "year": 2006
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1719532"
                        ],
                        "name": "Guy Shani",
                        "slug": "Guy-Shani",
                        "structuredName": {
                            "firstName": "Guy",
                            "lastName": "Shani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Guy Shani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48099028"
                        ],
                        "name": "D. Heckerman",
                        "slug": "D.-Heckerman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heckerman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heckerman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680506"
                        ],
                        "name": "R. Brafman",
                        "slug": "R.-Brafman",
                        "structuredName": {
                            "firstName": "Ronen",
                            "lastName": "Brafman",
                            "middleNames": [
                                "I."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brafman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 11
                            }
                        ],
                        "text": "The PO-MDP [26] model is designed for this case, but to have better experimental control, tractability and model interpretation, we use a deterministic state transition model."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 875571,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9b739b106b585c963cca70a10f38e564cc9d98cc",
            "isKey": false,
            "numCitedBy": 748,
            "numCiting": 39,
            "paperAbstract": {
                "fragments": [],
                "text": "Typical Recommender systems adopt a static view of the recommendation process and treat it as a prediction problem. We argue that it is more appropriate to view the problem of generating recommendations as a sequential decision problem and, consequently, that Markov decision processes (MDP) provide a more appropriate model for Recommender systems. MDPs introduce two benefits: they take into account the long-term effects of each recommendation, and they take into account the expected value of each recommendation. To succeed in practice, an MDP-based Recommender system must employ a strong initial model; and the bulk of this paper is concerned with the generation of such a model. In particular, we suggest the use of an n-gram predictive model for generating the initial MDP. Our n-gram model induces a Markovchain model of user behavior whose predictive accuracy is greater than that of existing predictive models. We describe our predictive model in detail and evaluate its performance on real data. In addition, we show how the model can be used in an MDP-based Recommender system."
            },
            "slug": "An-MDP-Based-Recommender-System-Shani-Heckerman",
            "title": {
                "fragments": [],
                "text": "An MDP-Based Recommender System"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The use of an n-gram predictive model is suggested for generating the initial MDP, which induces a Markovchain model of user behavior whose predictive accuracy is greater than that of existing predictive models."
            },
            "venue": {
                "fragments": [],
                "text": "J. Mach. Learn. Res."
            },
            "year": 2002
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762969"
                        ],
                        "name": "Bracha Shapira",
                        "slug": "Bracha-Shapira",
                        "structuredName": {
                            "firstName": "Bracha",
                            "lastName": "Shapira",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bracha Shapira"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 130,
                                "start": 123
                            }
                        ],
                        "text": "Note that this section is not meant to give an overview on how machine learning can be applied in recommender systems (See [2, 23] for a better review)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 11569603,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9916eef828b461051d4c0b090e82aef8d4855485",
            "isKey": false,
            "numCitedBy": 2657,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "The explosive growth of e-commerce and online environments has made the issue of information search and selection increasingly serious; users are overloaded by options to consider and they may not have the time or knowledge to personally evaluate these options. Recommender systems have proven to be a valuable way for online users to cope with the information overload and have become one of the most powerful and popular tools in electronic commerce. Correspondingly, various techniques for recommendation generation have been proposed. During the last decade, many of them have also been successfully deployed in commercial environments. Recommender Systems Handbook, an edited volume, is a multi-disciplinary effort that involves world-wide experts from diverse fields, such as artificial intelligence, human computer interaction, information technology, data mining, statistics, adaptive user interfaces, decision support systems, marketing, and consumer behavior. Theoreticians and practitioners from these fields continually seek techniques for more efficient, cost-effective and accurate recommender systems. This handbook aims to impose a degree of order on this diversity, by presenting a coherent and unified repository of recommender systems major concepts, theories, methodologies, trends, challenges and applications. Extensive artificial applications, a variety of real-world applications, and detailed case studies are included. Recommender Systems Handbook illustrates how this technology can support the user in decision-making, planning and purchasing processes. It works for well known corporations such as Amazon, Google, Microsoft and AT&T. This handbook is suitable for researchers and advanced-level students in computer science as a reference."
            },
            "slug": "Recommender-Systems-Handbook-Shapira",
            "title": {
                "fragments": [],
                "text": "Recommender Systems Handbook"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This handbook illustrates how recommender systems can support the user in decision-making, planning and purchasing processes, and works for well known corporations such as Amazon, Google, Microsoft and AT&T."
            },
            "venue": {
                "fragments": [],
                "text": "Springer US"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1781996"
                        ],
                        "name": "P. Pu",
                        "slug": "P.-Pu",
                        "structuredName": {
                            "firstName": "Pearl",
                            "lastName": "Pu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Pu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1725490"
                        ],
                        "name": "Li Chen",
                        "slug": "Li-Chen",
                        "structuredName": {
                            "firstName": "Li",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Li Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2067785566"
                        ],
                        "name": "Rong Hu",
                        "slug": "Rong-Hu",
                        "structuredName": {
                            "firstName": "Rong",
                            "lastName": "Hu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Rong Hu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 100,
                                "start": 96
                            }
                        ],
                        "text": "We studied several new perceptional metrics for recommendations different from prior literature [20]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 0
                            }
                        ],
                        "text": "[9, 15, 20, 33, 34] have all been studied in prior literature."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[20] proposed a user centric evaluation framework by employing state-of-the-art survey designs structured and derived based on theories of human behavioral intention and reasoned action."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 7687260,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "a96898490180c86b63eee2e801de6e25de5aa71d",
            "isKey": false,
            "numCitedBy": 678,
            "numCiting": 43,
            "paperAbstract": {
                "fragments": [],
                "text": "This research was motivated by our interest in understanding the criteria for measuring the success of a recommender system from users' point view. Even though existing work has suggested a wide range of criteria, the consistency and validity of the combined criteria have not been tested. In this paper, we describe a unifying evaluation framework, called ResQue (Recommender systems' Quality of user experience), which aimed at measuring the qualities of the recommended items, the system's usability, usefulness, interface and interaction qualities, users' satisfaction with the systems, and the influence of these qualities on users' behavioral intentions, including their intention to purchase the products recommended to them and return to the system. We also show the results of applying psychometric methods to validate the combined criteria using data collected from a large user survey. The outcomes of the validation are able to 1) support the consistency, validity and reliability of the selected criteria; and 2) explain the quality of user experience and the key determinants motivating users to adopt the recommender technology. The final model consists of thirty two questions and fifteen constructs, defining the essential qualities of an effective and satisfying recommender system, as well as providing practitioners and scholars with a cost-effective way to evaluate the success of a recommender system and identify important areas in which to invest development resources."
            },
            "slug": "A-user-centric-evaluation-framework-for-recommender-Pu-Chen",
            "title": {
                "fragments": [],
                "text": "A user-centric evaluation framework for recommender systems"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "A unifying evaluation framework, called ResQue (Recommender systems' Quality of user experience), which aimed at measuring the qualities of the recommended items, the system's usability, usefulness, interface and interaction qualities, users' satisfaction with the systems, and the influence of these qualities on users' behavioral intentions."
            },
            "venue": {
                "fragments": [],
                "text": "RecSys '11"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47681372"
                        ],
                        "name": "Lihong Li",
                        "slug": "Lihong-Li",
                        "structuredName": {
                            "firstName": "Lihong",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lihong Li"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48980295"
                        ],
                        "name": "Wei Chu",
                        "slug": "Wei-Chu",
                        "structuredName": {
                            "firstName": "Wei",
                            "lastName": "Chu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Wei Chu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144162125"
                        ],
                        "name": "J. Langford",
                        "slug": "J.-Langford",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Langford",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Langford"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1716301"
                        ],
                        "name": "R. Schapire",
                        "slug": "R.-Schapire",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Schapire",
                            "middleNames": [
                                "E."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Schapire"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 17
                            }
                        ],
                        "text": "Algorithm 1: The LinearUCB algorithm Data: A sequence of s = (u; c) while the algorithm is running\nin the system."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 9,
                                "start": 0
                            }
                        ],
                        "text": "LinearUCB makes further assumptions about r (s,a) to simplify the problem in Equation 9."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 72,
                                "start": 63
                            }
                        ],
                        "text": "For the purpose of explaining the method of this research, the LinearUCB algorithm is elaborated as follows in Algorithm 1 with the notations in this paper."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 175,
                                "start": 166
                            }
                        ],
                        "text": "The used techniques of this work span from classical matrix factorization (together with stochastic gradient descent) to contextual bandit learning (particularly the LinearUCB algorithm) and the Q-learning algorithm."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 154
                            }
                        ],
                        "text": "In our notation, s = (u; c) is considered as the context and both s and a are represented as feature vectors (contrary to the discrete value space in the MultiArmed Bandit [17] problem), e.g., the vectors of user profile or item attributes."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 108
                            }
                        ],
                        "text": "A well-studied algorithm for the contextual bandit problem which is also used in this research is LinearUCB [17]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 8,
                                "start": 4
                            }
                        ],
                        "text": "See [17] for a theoretical bound of the regret of this algorithm."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 447,
                                "start": 438
                            }
                        ],
                        "text": "The accuracies on\nTable 1: The six recommenders studied in this work\nRecommender Input Output Model Algorithm MF-Rating u: user ID a: item ID y: rating Equation 3 for f Equation 4 for L SGD in Equation 7 MF-Action u: user ID a: item ID y: positive action or not Equation 3 for f Equation 5 for L Same as MF-Rating Bandit-Two a = (a1;a2) a1: predicted rating a2: predicted action r : positive action or not on-policy θ = (θ1;θ2) E(r (a)) = aT θ LinearUCB in Algorithm 1\nBandit-Four\na = (a1; ...;a4) a1, a2: Same as Bandit-Two a3: recency of item ID a4: popularity of item ID Same as Bandit-Two θ = (θ1; ...;θ4) E(r (a)) = aT θ Same as Bandit-Two\nBandit-State\nx = (s;a) a: Same as Bandit-Four s = (s1; ...; s4) si =\n1 Nu ∑Nu j=1 ai, j ,\nfor i = 1, ..., 4\nSame as Bandit-Four θ = (θ (a);θ (s)) E(r (s,a)) = ∑4i=1 ai · θ (a)i +ai · si · θ (s)i Same as Bandit-Four\nReinforce-State Same as Bandit-State\nrt = 1 if the user returns in a week and t is the end of a session rt = 0 otherwise\nθ = (θ (a);θ (s)) Q(s,a) is in Equation 10 Q-learning in Algorithm 2\naverage are 0.957 in testing RMSE (Root Mean Squared Error), 0.735 in testing MAE (Mean Average Error) for the rating prediction model, and 0.703 in testing AUC (Area Under the ROC) for the action prediction model."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 57,
                                "start": 48
                            }
                        ],
                        "text": "In the algorithm, Steps 8-9 are equivalent to a LinearUCB update step with exploration parameter α = 0, i.e., using the LinearUCB algorithm as an online algorithm to estimate the linear Q function."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 22
                            }
                        ],
                        "text": "The Contextual Bandit [17] has the same objective as the regret minimization problem in Equation 9."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 24,
                                "start": 15
                            }
                        ],
                        "text": "For all of the LinearUCB algorithms, we set the exploration parameter α = 0 and prior β = 1 (since there is natural exploration because we make a page of recommendations at once, we leave the study of the exploration effect as future work)."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 176,
                                "start": 172
                            }
                        ],
                        "text": "In our notation, s = (u; c) is considered as the context and both s and a are represented as feature vectors (contrary to the discrete value space in the MultiArmed Bandit [17] problem), e."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 207178795,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "ec0072bc37f83f1a81459df43289613e04cc61e1",
            "isKey": true,
            "numCitedBy": 2180,
            "numCiting": 96,
            "paperAbstract": {
                "fragments": [],
                "text": "Personalized web services strive to adapt their services (advertisements, news articles, etc.) to individual users by making use of both content and user information. Despite a few recent advances, this problem remains challenging for at least two reasons. First, web service is featured with dynamically changing pools of content, rendering traditional collaborative filtering methods inapplicable. Second, the scale of most web services of practical interest calls for solutions that are both fast in learning and computation.\n In this work, we model personalized recommendation of news articles as a contextual bandit problem, a principled approach in which a learning algorithm sequentially selects articles to serve users based on contextual information about the users and articles, while simultaneously adapting its article-selection strategy based on user-click feedback to maximize total user clicks.\n The contributions of this work are three-fold. First, we propose a new, general contextual bandit algorithm that is computationally efficient and well motivated from learning theory. Second, we argue that any bandit algorithm can be reliably evaluated offline using previously recorded random traffic. Finally, using this offline evaluation method, we successfully applied our new algorithm to a Yahoo! Front Page Today Module dataset containing over 33 million events. Results showed a 12.5% click lift compared to a standard context-free bandit algorithm, and the advantage becomes even greater when data gets more scarce."
            },
            "slug": "A-contextual-bandit-approach-to-personalized-news-Li-Chu",
            "title": {
                "fragments": [],
                "text": "A contextual-bandit approach to personalized news article recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This work model personalized recommendation of news articles as a contextual bandit problem, a principled approach in which a learning algorithm sequentially selects articles to serve users based on contextual information about the users and articles, while simultaneously adapting its article-selection strategy based on user-click feedback to maximize total user clicks."
            },
            "venue": {
                "fragments": [],
                "text": "WWW '10"
            },
            "year": 2010
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3247247"
                        ],
                        "name": "Cai-Nicolas Ziegler",
                        "slug": "Cai-Nicolas-Ziegler",
                        "structuredName": {
                            "firstName": "Cai-Nicolas",
                            "lastName": "Ziegler",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Cai-Nicolas Ziegler"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3039934"
                        ],
                        "name": "S. McNee",
                        "slug": "S.-McNee",
                        "structuredName": {
                            "firstName": "Sean",
                            "lastName": "McNee",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. McNee"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1809410"
                        ],
                        "name": "G. Lausen",
                        "slug": "G.-Lausen",
                        "structuredName": {
                            "firstName": "Georg",
                            "lastName": "Lausen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Lausen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 19,
                                "start": 0
                            }
                        ],
                        "text": "[9, 15, 20, 33, 34] have all been studied in prior literature."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 73,
                                "start": 66
                            }
                        ],
                        "text": "on top of predictions help improve user engagement and experience [9, 34]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 655375,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d782965d6c4c64f5ef1fd795ac64d969a16d01e9",
            "isKey": false,
            "numCitedBy": 1740,
            "numCiting": 37,
            "paperAbstract": {
                "fragments": [],
                "text": "In this work we present topic diversification, a novel method designed to balance and diversify personalized recommendation lists in order to reflect the user's complete spectrum of interests. Though being detrimental to average accuracy, we show that our method improves user satisfaction with recommendation lists, in particular for lists generated using the common item-based collaborative filtering algorithm.Our work builds upon prior research on recommender systems, looking at properties of recommendation lists as entities in their own right rather than specifically focusing on the accuracy of individual recommendations. We introduce the intra-list similarity metric to assess the topical diversity of recommendation lists and the topic diversification approach for decreasing the intra-list similarity. We evaluate our method using book recommendation data, including offline analysis on 361, !, 349 ratings and an online study involving more than 2, !, 100 subjects."
            },
            "slug": "Improving-recommendation-lists-through-topic-Ziegler-McNee",
            "title": {
                "fragments": [],
                "text": "Improving recommendation lists through topic diversification"
            },
            "tldr": {
                "abstractSimilarityScore": 79,
                "text": "This work presents topic diversification, a novel method designed to balance and diversify personalized recommendation lists in order to reflect the user's complete spectrum of interests, and introduces the intra-list similarity metric to assess the topical diversity of recommendation lists."
            },
            "venue": {
                "fragments": [],
                "text": "WWW '05"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2843982"
                        ],
                        "name": "Steffen Rendle",
                        "slug": "Steffen-Rendle",
                        "structuredName": {
                            "firstName": "Steffen",
                            "lastName": "Rendle",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Steffen Rendle"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 33,
                                "start": 29
                            }
                        ],
                        "text": "See SVDFeature [6] and libFM [21] for generalized versions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 116
                            }
                        ],
                        "text": "Being aware that there are many different algorithms proposed for modeling both explicit and implicit feedback data [11, 16, 21, 22], we chose the classical ones for better controlling the differences of algorithms while focusing on studying the differences that are inherent in the two types of feedback data."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5499886,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "e50f4d3316d13841c287dcdf5479d7820d593571",
            "isKey": false,
            "numCitedBy": 1084,
            "numCiting": 49,
            "paperAbstract": {
                "fragments": [],
                "text": "Factorization approaches provide high accuracy in several important prediction problems, for example, recommender systems. However, applying factorization approaches to a new prediction problem is a nontrivial task and requires a lot of expert knowledge. Typically, a new model is developed, a learning algorithm is derived, and the approach has to be implemented.\n Factorization machines (FM) are a generic approach since they can mimic most factorization models just by feature engineering. This way, factorization machines combine the generality of feature engineering with the superiority of factorization models in estimating interactions between categorical variables of large domain. libFM is a software implementation for factorization machines that features stochastic gradient descent (SGD) and alternating least-squares (ALS) optimization, as well as Bayesian inference using Markov Chain Monto Carlo (MCMC). This article summarizes the recent research on factorization machines both in terms of modeling and learning, provides extensions for the ALS and MCMC algorithms, and describes the software tool libFM."
            },
            "slug": "Factorization-Machines-with-libFM-Rendle",
            "title": {
                "fragments": [],
                "text": "Factorization Machines with libFM"
            },
            "venue": {
                "fragments": [],
                "text": "TIST"
            },
            "year": 2012
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "41183260"
                        ],
                        "name": "B. Xiao",
                        "slug": "B.-Xiao",
                        "structuredName": {
                            "firstName": "Bo",
                            "lastName": "Xiao",
                            "middleNames": [
                                "Sophia"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Xiao"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732947"
                        ],
                        "name": "I. Benbasat",
                        "slug": "I.-Benbasat",
                        "structuredName": {
                            "firstName": "Izak",
                            "lastName": "Benbasat",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "I. Benbasat"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[32] is a direct application and further development of this theory in the domain of e-commerce recommender agents, e."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 16669289,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "31ad02e222986c09fc7b5e4b8147d25877a8a45b",
            "isKey": false,
            "numCitedBy": 943,
            "numCiting": 189,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommendation agents (RAs) are software agents that elicit the interests or preferences of individual consumers for products, either explicitly or implicitly, and make recommendations accordingly. RAs have the potential to support and improve the quality of the decisions consumers make when searching for and selecting products online. They can reduce the information overload facing consumers, as well as the complexity of online searches. Prior research on RAs has focused mostly on developing and evaluating different underlying algorithms that generate recommendations. This paper instead identifies other important aspects of RAs, namely RA use, RA characteristics, provider credi'r, and user-RA interaction, which influence users' decision-making processes and outcomes, as well as their evaluation of RAs. It goes beyond generalized models, such as TAM, and identifies the RA-specific features, such as RA input, process, and output design characteristics, that affect users' evaluations, including their assessments of the usefulness and ease-of-use of RA applications. \n \nBased on a review of existing literature on e-commerce RAs, this paper develops a conceptual model with 28 propositions derived from five theoretical perspectives. The propositions help answer the two research questions: (1) How do RA use, RA characteristics, and other factors influence consumer decision making processes and outcomes? (2) How do RA use, RA characteristics, and other factors influence users' evaluations of RAs? By identifying the critical gaps between what we know and what we need to know, this paper identifies potential areas of future research for scholars. It also provides advice to information systems practitioners concerning the effective design and development of RAs."
            },
            "slug": "E-Commerce-Product-Recommendation-Agents:-Use,-and-Xiao-Benbasat",
            "title": {
                "fragments": [],
                "text": "E-Commerce Product Recommendation Agents: Use, Characteristics, and Impact"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "A conceptual model with 28 propositions derived from five theoretical perspectives is developed that identifies other important aspects of RAs, namely RA use, RA characteristics, provider credi'r, and user-RA interaction, which influence users' decision-making processes and outcomes, as well as their evaluation of RA."
            },
            "venue": {
                "fragments": [],
                "text": "MIS Q."
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1709005"
                        ],
                        "name": "Georgios Theocharous",
                        "slug": "Georgios-Theocharous",
                        "structuredName": {
                            "firstName": "Georgios",
                            "lastName": "Theocharous",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Georgios Theocharous"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143640165"
                        ],
                        "name": "P. Thomas",
                        "slug": "P.-Thomas",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Thomas",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Thomas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678622"
                        ],
                        "name": "M. Ghavamzadeh",
                        "slug": "M.-Ghavamzadeh",
                        "structuredName": {
                            "firstName": "Mohammad",
                            "lastName": "Ghavamzadeh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Ghavamzadeh"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 9,
                                "start": 5
                            }
                        ],
                        "text": ", in [28], an ensemble of trees are used."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8081523,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0c11db37dd24ca3a866481303bebfc37a93a37d0",
            "isKey": false,
            "numCitedBy": 93,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper, we propose a framework for using reinforcement learning (RL) algorithms to learn good policies for personalized ad recommendation (PAR) systems. The RL algorithms take into account the long-term effect of an action, and thus, could be more suitable than myopic techniques like supervised learning and contextual bandit, for modern PAR systems in which the number of returning visitors is rapidly growing. However, while myopic techniques have been well-studied in PAR systems, the RL approach is still in its infancy, mainly due to two fundamental challenges: how to compute a good RL strategy and how to evaluate a solution using historical data to ensure its \"safety\" before deployment. In this paper, we propose to use a family of off-policy evaluation techniques with statistical guarantees to tackle both these challenges. We apply these methods to a real PAR problem, both for evaluating the final performance and for optimizing the parameters of the RL algorithm. Our results show that a RL algorithm equipped with these off-policy evaluation techniques outperforms the myopic approaches. Our results also give fundamental insights on the difference between the click through rate (CTR) and life-time value (LTV) metrics for evaluating the performance of a PAR algorithm."
            },
            "slug": "Personalized-Ad-Recommendation-Systems-for-Value-Theocharous-Thomas",
            "title": {
                "fragments": [],
                "text": "Personalized Ad Recommendation Systems for Life-Time Value Optimization with Guarantees"
            },
            "tldr": {
                "abstractSimilarityScore": 38,
                "text": "Results show that a RL algorithm equipped with these off-policy evaluation techniques outperforms the myopic approaches and give fundamental insights on the difference between the click through rate (CTR) and life-time value (LTV) metrics for evaluating the performance of a PAR algorithm."
            },
            "venue": {
                "fragments": [],
                "text": "IJCAI"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1709005"
                        ],
                        "name": "Georgios Theocharous",
                        "slug": "Georgios-Theocharous",
                        "structuredName": {
                            "firstName": "Georgios",
                            "lastName": "Theocharous",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Georgios Theocharous"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "143640165"
                        ],
                        "name": "P. Thomas",
                        "slug": "P.-Thomas",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Thomas",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Thomas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1678622"
                        ],
                        "name": "M. Ghavamzadeh",
                        "slug": "M.-Ghavamzadeh",
                        "structuredName": {
                            "firstName": "Mohammad",
                            "lastName": "Ghavamzadeh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Ghavamzadeh"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 12118631,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9497d951c90d9f3c052e29e8ef83cff283129897",
            "isKey": false,
            "numCitedBy": 32,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "The main objective in the ad recommendation problem is to find a strategy that, for each visitor of the website, selects the ad that has the highest probability of being clicked. This strategy could be computed using supervised learning or contextual bandit algorithms, which treat two visits of the same user as two separate independent visitors, and thus, optimize greedily for a single step into the future. Another approach would be to use reinforcement learning (RL) methods, which differentiate between two visits of the same user and two different visitors, and thus, optimizes for multiple steps into the future or the life-time value (LTV) of a customer. While greedy methods have been well-studied, the LTV approach is still in its infancy, mainly due to two fundamental challenges: how to compute a good LTV strategy and how to evaluate a solution using historical data to ensure its \"safety\" before deployment. In this paper, we tackle both of these challenges by proposing to use a family of off-policy evaluation techniques with statistical guarantees about the performance of a new strategy. We apply these methods to a real ad recommendation problem, both for evaluating the final performance and for optimizing the parameters of the RL algorithm. Our results show that our LTV optimization algorithm equipped with these off-policy evaluation techniques outperforms the greedy approaches. They also give fundamental insights on the difference between the click through rate (CTR) and LTV metrics for performance evaluation in the ad recommendation problem."
            },
            "slug": "Ad-Recommendation-Systems-for-Life-Time-Value-Theocharous-Thomas",
            "title": {
                "fragments": [],
                "text": "Ad Recommendation Systems for Life-Time Value Optimization"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The results show that the LTV optimization algorithm equipped with these off-policy evaluation techniques outperforms the greedy approaches, and fundamental insights on the difference between the click through rate (CTR) and LTV metrics for performance evaluation in the ad recommendation problem are given."
            },
            "venue": {
                "fragments": [],
                "text": "WWW"
            },
            "year": 2015
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1389955537"
                        ],
                        "name": "S. Shalev-Shwartz",
                        "slug": "S.-Shalev-Shwartz",
                        "structuredName": {
                            "firstName": "Shai",
                            "lastName": "Shalev-Shwartz",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Shalev-Shwartz"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 40,
                                "start": 36
                            }
                        ],
                        "text": ", the following Regret Minimization [25] problem:"
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 337,
                                "start": 318
                            }
                        ],
                        "text": "If we make the assumption that a does not have an effect on the state s , i.e., st is I.I.D samples of an unknown distribution P(s), the reward maximization problem can be converted to the problem of minimizing the regret of a policy compared with the best policy π ′ in an assumed family of policies, i.e., the following Regret Minimization [25] problem:\nπ∗ = arдminπ T∑ t=1 (r (st ,aπ ′,t ) − r (st ,aπ ,t )) (9)\nFollowing is a list of the key theoretical differences between the Regret Minimization problem (shortened as RM) in Equation 9 and the Empirical Risk Minimization (shortened as ERM) problem in Equation 2."
                    },
                    "intents": []
                }
            ],
            "corpusId": 123001221,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fb54e7be71c825295dd8489c0b47cd43932cb817",
            "isKey": false,
            "numCitedBy": 330,
            "numCiting": 126,
            "paperAbstract": {
                "fragments": [],
                "text": "Online learning is the process of answering a sequence of questions given knowledge of the correct answers to previous questions and possibly additional available information. Answering questions in an intelligent fashion and being able to make rational decisions as a result is a basic feature of everyday life. Will it rain today (so should I take an umbrella)? Should I fight the wild animal that is after me, or should I run away? Should I open an attachment in an email message or is it a virus? The study of online learning algorithms is thus an important domain in machine learning, and one that has interesting theoretical properties and practical applications. This dissertation describes a novel framework for the design and analysis of online learning algorithms. We show that various online learning algorithms can all be derived as special cases of our algorithmic framework. This unified view explains the properties of existing algorithms and also enables us to derive several new interesting algorithms. Online learning is performed in a sequence of consecutive rounds, where at each round the learner is given a question and is required to provide an answer to this question. After predicting an answer, the correct answer is revealed and the learner suffers a loss if there is a discrepancy between his answer and the correct one. The algorithmic framework for online learning we propose in this dissertation stems from a connection that we make between the notions of regret in online learning and weak duality in convex optimization. Regret bounds are the common thread in the analysis of online learning algorithms. A regret bound measures the performance of an online algorithm relative to the performance of a competing prediction mechanism, called a competing hypothesis. The competing hypothesis can be chosen in hindsight from a class of hypotheses, after observing the entire sequence of question- answer pairs. Over the years, competitive analysis techniques have been refined and extended to numerous prediction problems by employing complex and varied notions of progress toward a good competing hypothesis. We propose a new perspective on regret bounds which is based on the notion of duality in convex optimization. Regret bounds are universal in the sense that they hold for any possible fixed hypothesis in a given hypothesis class. We therefore cast the universal bound as a lower bound"
            },
            "slug": "Online-Learning:-Theory,-Algorithms,-and-Shalev-Shwartz",
            "title": {
                "fragments": [],
                "text": "Online Learning: Theory, Algorithms, and Applications"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "This dissertation describes a novel framework for the design and analysis of online learning algorithms and proposes a new perspective on regret bounds which is based on the notion of duality in convex optimization."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "40169260"
                        ],
                        "name": "F. Ricci",
                        "slug": "F.-Ricci",
                        "structuredName": {
                            "firstName": "Francesco",
                            "lastName": "Ricci",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Ricci"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1732091"
                        ],
                        "name": "L. Rokach",
                        "slug": "L.-Rokach",
                        "structuredName": {
                            "firstName": "Lior",
                            "lastName": "Rokach",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Rokach"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1762969"
                        ],
                        "name": "Bracha Shapira",
                        "slug": "Bracha-Shapira",
                        "structuredName": {
                            "firstName": "Bracha",
                            "lastName": "Shapira",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bracha Shapira"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 35569873,
            "fieldsOfStudy": [
                "Art"
            ],
            "id": "24f1a3ec9d02abcd3b5ed7f511b9d8017213954a",
            "isKey": false,
            "numCitedBy": 2226,
            "numCiting": 128,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender Systems (RSs) are software tools and techniques providing suggestions for items to be of use to a user. In this introductory chapter we briefly discuss basic RS ideas and concepts. Our main goal is to delineate, in a coherent and structured way, the chapters included in this handbook and to help the reader navigate the extremely rich and detailed content that the handbook offers."
            },
            "slug": "Introduction-to-Recommender-Systems-Handbook-Ricci-Rokach",
            "title": {
                "fragments": [],
                "text": "Introduction to Recommender Systems Handbook"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "The main goal is to delineate, in a coherent and structured way, the chapters included in this handbook and to help the reader navigate the extremely rich and detailed content that the handbook offers."
            },
            "venue": {
                "fragments": [],
                "text": "Recommender Systems Handbook"
            },
            "year": 2011
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701121"
                        ],
                        "name": "Y. Koren",
                        "slug": "Y.-Koren",
                        "structuredName": {
                            "firstName": "Yehuda",
                            "lastName": "Koren",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Koren"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113591957"
                        ],
                        "name": "Robert M. Bell",
                        "slug": "Robert-M.-Bell",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Bell",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Robert M. Bell"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3146362"
                        ],
                        "name": "C. Volinsky",
                        "slug": "C.-Volinsky",
                        "structuredName": {
                            "firstName": "Chris",
                            "lastName": "Volinsky",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Volinsky"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 60,
                                "start": 57
                            }
                        ],
                        "text": "Then we further update the trained models by running the SGD steps in Equation 7 over the validation data once to make sure the models are up to date."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 205,
                                "start": 202
                            }
                        ],
                        "text": "That is, learning as t goes from t = 1 to T (effectively reading data once) while the algorithm to solve the ERM problem is iterative typically by reading the observation data multiple times, e.g., the SGD algorithm."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 91,
                                "start": 88
                            }
                        ],
                        "text": "That\nis,\nд(w) = λ1 |b |22 + λ2 |U | 2 2 + λ3 |v | 2 2) (6)\nThe Stochastic Gradient Descent (SGD) [16] algorithm (shown in Equation 7) is widely used to solve the optimization problem in Equation 2 when f is a matrix factorization model."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 189,
                                "start": 186
                            }
                        ],
                        "text": "The accuracies on\nTable 1: The six recommenders studied in this work\nRecommender Input Output Model Algorithm MF-Rating u: user ID a: item ID y: rating Equation 3 for f Equation 4 for L SGD in Equation 7 MF-Action u: user ID a: item ID y: positive action or not Equation 3 for f Equation 5 for L Same as MF-Rating Bandit-Two a = (a1;a2) a1: predicted rating a2: predicted action r : positive action or not on-policy θ = (θ1;θ2) E(r (a)) = aT θ LinearUCB in Algorithm 1\nBandit-Four\na = (a1; ...;a4) a1, a2: Same as Bandit-Two a3: recency of item ID a4: popularity of item ID Same as Bandit-Two θ = (θ1; ...;θ4) E(r (a)) = aT θ Same as Bandit-Two\nBandit-State\nx = (s;a) a: Same as Bandit-Four s = (s1; ...; s4) si =\n1 Nu ∑Nu j=1 ai, j ,\nfor i = 1, ..., 4\nSame as Bandit-Four θ = (θ (a);θ (s)) E(r (s,a)) = ∑4i=1 ai · θ (a)i +ai · si · θ (s)i Same as Bandit-Four\nReinforce-State Same as Bandit-State\nrt = 1 if the user returns in a week and t is the end of a session rt = 0 otherwise\nθ = (θ (a);θ (s)) Q(s,a) is in Equation 10 Q-learning in Algorithm 2\naverage are 0.957 in testing RMSE (Root Mean Squared Error), 0.735 in testing MAE (Mean Average Error) for the rating prediction model, and 0.703 in testing AUC (Area Under the ROC) for the action prediction model."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 15,
                                "start": 8
                            }
                        ],
                        "text": "FunkSVD [8, 16] is a basic version of the family of matrix factorization models used in this work."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 7,
                                "start": 4
                            }
                        ],
                        "text": "The SGD algorithm follows the following updating rules."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 104
                            }
                        ],
                        "text": "During the week before the next batch training, the models are updated in real-time by running the same SGD steps once whenever the users rate or browse movies in the site."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 225,
                                "start": 221
                            }
                        ],
                        "text": "With access to a movie information site that has thousands of real active users every month, we set out to compare the two types of recommenders in a live experiment based on the classical matrix factorization algorithms [16]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 42,
                                "start": 38
                            }
                        ],
                        "text": "The Stochastic Gradient Descent (SGD) [16] algorithm (shown in Equation 7) is widely used to solve the optimization problem in Equation 2 when f is a matrix factorization model."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 55,
                                "start": 51
                            }
                        ],
                        "text": ", the widely used and studied matrix factorization [16], we denote f with f (W ,x) where x = (s;a) andW are all model parameters without loss of generality."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 116
                            }
                        ],
                        "text": "Being aware that there are many different algorithms proposed for modeling both explicit and implicit feedback data [11, 16, 21, 22], we chose the classical ones for better controlling the differences of algorithms while focusing on studying the differences that are inherent in the two types of feedback data."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 58370896,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d4bbcc842f22547eaf5884251eaa68251895dccb",
            "isKey": true,
            "numCitedBy": 7016,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "As the Netflix Prize competition has demonstrated, matrix factorization models are superior to classic nearest neighbor techniques for producing product recommendations, allowing the incorporation of additional information such as implicit feedback, temporal effects, and confidence levels."
            },
            "slug": "Matrix-Factorization-Techniques-for-Recommender-Koren-Bell",
            "title": {
                "fragments": [],
                "text": "Matrix Factorization Techniques for Recommender Systems"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "As the Netflix Prize competition has demonstrated, matrix factorization models are superior to classic nearest neighbor techniques for producing product recommendations, allowing the incorporation of additional information such as implicit feedback, temporal effects, and confidence levels."
            },
            "venue": {
                "fragments": [],
                "text": "Computer"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1709512"
                        ],
                        "name": "L. Kaelbling",
                        "slug": "L.-Kaelbling",
                        "structuredName": {
                            "firstName": "Leslie",
                            "lastName": "Kaelbling",
                            "middleNames": [
                                "Pack"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Kaelbling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144885169"
                        ],
                        "name": "M. Littman",
                        "slug": "M.-Littman",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Littman",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Littman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1760402"
                        ],
                        "name": "A. Moore",
                        "slug": "A.-Moore",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Moore",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Moore"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 62,
                                "start": 58
                            }
                        ],
                        "text": ", we employ a model-based Qlearning instead of model-free [13])."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 91,
                                "start": 83
                            }
                        ],
                        "text": "Different from supervised learning, when applying the theory of reinforce learning [13, 27] in recommender systems, the recommendation problem is modeled as a sequential decision-making problem."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 295,
                                "start": 291
                            }
                        ],
                        "text": "In this research, we tried two new approaches in a live experiment to combine multiple factors in a principled way (also using machine learning techniques) inspired by the social theory of technology acceptance [30] and the reinforcement learning theory on decision making under uncertainty [13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1708582,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "12d1d070a53d4084d88a77b8b143bad51c40c38f",
            "isKey": true,
            "numCitedBy": 7567,
            "numCiting": 136,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper surveys the field of reinforcement learning from a computer-science perspective. It is written to be accessible to researchers familiar with machine learning. Both the historical basis of the field and a broad selection of current work are summarized. Reinforcement learning is the problem faced by an agent that learns behavior through trial-and-error interactions with a dynamic environment. The work described here has a resemblance to work in psychology, but differs considerably in the details and in the use of the word \"reinforcement.\" The paper discusses central issues of reinforcement learning, including trading off exploration and exploitation, establishing the foundations of the field via Markov decision theory, learning from delayed reinforcement, constructing empirical models to accelerate learning, making use of generalization and hierarchy, and coping with hidden state. It concludes with a survey of some implemented systems and an assessment of the practical utility of current methods for reinforcement learning."
            },
            "slug": "Reinforcement-Learning:-A-Survey-Kaelbling-Littman",
            "title": {
                "fragments": [],
                "text": "Reinforcement Learning: A Survey"
            },
            "tldr": {
                "abstractSimilarityScore": 48,
                "text": "Central issues of reinforcement learning are discussed, including trading off exploration and exploitation, establishing the foundations of the field via Markov decision theory, learning from delayed reinforcement, constructing empirical models to accelerate learning, making use of generalization and hierarchy, and coping with hidden state."
            },
            "venue": {
                "fragments": [],
                "text": "J. Artif. Intell. Res."
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699645"
                        ],
                        "name": "R. Sutton",
                        "slug": "R.-Sutton",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Sutton",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sutton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1730590"
                        ],
                        "name": "A. Barto",
                        "slug": "A.-Barto",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Barto",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Barto"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 91,
                                "start": 83
                            }
                        ],
                        "text": "Different from supervised learning, when applying the theory of reinforce learning [13, 27] in recommender systems, the recommendation problem is modeled as a sequential decision-making problem."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9166388,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "97efafdb4a3942ab3efba53ded7413199f79c054",
            "isKey": false,
            "numCitedBy": 34571,
            "numCiting": 574,
            "paperAbstract": {
                "fragments": [],
                "text": "Reinforcement learning, one of the most active research areas in artificial intelligence, is a computational approach to learning whereby an agent tries to maximize the total amount of reward it receives when interacting with a complex, uncertain environment. In Reinforcement Learning, Richard Sutton and Andrew Barto provide a clear and simple account of the key ideas and algorithms of reinforcement learning. Their discussion ranges from the history of the field's intellectual foundations to the most recent developments and applications. The only necessary mathematical background is familiarity with elementary concepts of probability. The book is divided into three parts. Part I defines the reinforcement learning problem in terms of Markov decision processes. Part II provides basic solution methods: dynamic programming, Monte Carlo methods, and temporal-difference learning. Part III presents a unified view of the solution methods and incorporates artificial neural networks, eligibility traces, and planning; the two final chapters present case studies and consider the future of reinforcement learning."
            },
            "slug": "Reinforcement-Learning:-An-Introduction-Sutton-Barto",
            "title": {
                "fragments": [],
                "text": "Reinforcement Learning: An Introduction"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "This book provides a clear and simple account of the key ideas and algorithms of reinforcement learning, which ranges from the history of the field's intellectual foundations to the most recent developments and applications."
            },
            "venue": {
                "fragments": [],
                "text": "IEEE Transactions on Neural Networks"
            },
            "year": 2005
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113543585"
                        ],
                        "name": "J. Bennett",
                        "slug": "J.-Bennett",
                        "structuredName": {
                            "firstName": "James",
                            "lastName": "Bennett",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Bennett"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47511653"
                        ],
                        "name": "S. Lanning",
                        "slug": "S.-Lanning",
                        "structuredName": {
                            "firstName": "Stan",
                            "lastName": "Lanning",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Lanning"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 44,
                                "start": 41
                            }
                        ],
                        "text": "The earlier pursuit of the Netflix Prize [4] was a (explicit-feedback) rating prediction problem."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 39,
                                "start": 36
                            }
                        ],
                        "text": ", explicit feedback data of ratings [4] and implicit feedback data of actions [11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 9528522,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "31af4b8793e93fd35e89569ccd663ae8777f0072",
            "isKey": false,
            "numCitedBy": 2030,
            "numCiting": 6,
            "paperAbstract": {
                "fragments": [],
                "text": "Netflix released a dataset containing 100 million anonymous movie ratings and challenged the data mining, machine learning and computer science communities to develop systems that could beat the accuracy of its recommendation system, Cinematch. We briefly describe the challenge itself, review related work and efforts, and summarize visible progress to date. Other potential uses of the data are outlined, including its application to the KDD Cup 2007."
            },
            "slug": "The-Netflix-Prize-Bennett-Lanning",
            "title": {
                "fragments": [],
                "text": "The Netflix Prize"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Netflix released a dataset containing 100 million anonymous movie ratings and challenged the data mining, machine learning and computer science communities to develop systems that could beat the accuracy of its recommendation system, Cinematch."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3444394"
                        ],
                        "name": "E. Ziegel",
                        "slug": "E.-Ziegel",
                        "structuredName": {
                            "firstName": "Eric",
                            "lastName": "Ziegel",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "E. Ziegel"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 46701966,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "e41ba5dc12c79a64dfa905c0328f95976252ffe0",
            "isKey": false,
            "numCitedBy": 14736,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "Chapter 11 includes more case studies in other areas, ranging from manufacturing to marketing research. Chapter 12 concludes the book with some commentary about the scienti\u008e c contributions of MTS. The Taguchi method for design of experiment has generated considerable controversy in the statistical community over the past few decades. The MTS/MTGS method seems to lead another source of discussions on the methodology it advocates (Montgomery 2003). As pointed out by Woodall et al. (2003), the MTS/MTGS methods are considered ad hoc in the sense that they have not been developed using any underlying statistical theory. Because the “normal” and “abnormal” groups form the basis of the theory, some sampling restrictions are fundamental to the applications. First, it is essential that the “normal” sample be uniform, unbiased, and/or complete so that a reliable measurement scale is obtained. Second, the selection of “abnormal” samples is crucial to the success of dimensionality reduction when OAs are used. For example, if each abnormal item is really unique in the medical example, then it is unclear how the statistical distance MD can be guaranteed to give a consistent diagnosis measure of severity on a continuous scale when the larger-the-better type S/N ratio is used. Multivariate diagnosis is not new to Technometrics readers and is now becoming increasingly more popular in statistical analysis and data mining for knowledge discovery. As a promising alternative that assumes no underlying data model, The Mahalanobis–Taguchi Strategy does not provide suf\u008e cient evidence of gains achieved by using the proposed method over existing tools. Readers may be very interested in a detailed comparison with other diagnostic tools, such as logistic regression and tree-based methods. Overall, although the idea of MTS/MTGS is intriguing, this book would be more valuable had it been written in a rigorous fashion as a technical reference. There is some lack of precision even in several mathematical notations. Perhaps a follow-up with additional theoretical justi\u008e cation and careful case studies would answer some of the lingering questions."
            },
            "slug": "The-Elements-of-Statistical-Learning-Ziegel",
            "title": {
                "fragments": [],
                "text": "The Elements of Statistical Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 69,
                "text": "Chapter 11 includes more case studies in other areas, ranging from manufacturing to marketing research, and a detailed comparison with other diagnostic tools, such as logistic regression and tree-based methods."
            },
            "venue": {
                "fragments": [],
                "text": "Technometrics"
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48272707"
                        ],
                        "name": "Nan Jiang",
                        "slug": "Nan-Jiang",
                        "structuredName": {
                            "firstName": "Nan",
                            "lastName": "Jiang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nan Jiang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "47681372"
                        ],
                        "name": "Lihong Li",
                        "slug": "Lihong-Li",
                        "structuredName": {
                            "firstName": "Lihong",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lihong Li"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 198,
                                "start": 194
                            }
                        ],
                        "text": "This makes the evaluation of the algorithm for the RM problem hard because the ideal evaluation (many off-policy evaluation methods have been proposed in the literature with certain limitations [12]) takes actual running of the algorithm or policy in the system, e."
                    },
                    "intents": []
                }
            ],
            "corpusId": 5806691,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "2fdb536da39a014c598ea67b0db88431fcd852a8",
            "isKey": false,
            "numCitedBy": 415,
            "numCiting": 41,
            "paperAbstract": {
                "fragments": [],
                "text": "We study the problem of off-policy value evaluation in reinforcement learning (RL), where one aims to estimate the value of a new policy based on data collected by a different policy. This problem is often a critical step when applying RL in real-world problems. Despite its importance, existing general methods either have uncontrolled bias or suffer high variance. In this work, we extend the doubly robust estimator for bandits to sequential decision-making problems, which gets the best of both worlds: it is guaranteed to be unbiased and can have a much lower variance than the popular importance sampling estimators. We demonstrate the estimator's accuracy in several benchmark problems, and illustrate its use as a subroutine in safe policy improvement. We also provide theoretical results on the hardness of the problem, and show that our estimator can match the lower bound in certain scenarios."
            },
            "slug": "Doubly-Robust-Off-policy-Value-Evaluation-for-Jiang-Li",
            "title": {
                "fragments": [],
                "text": "Doubly Robust Off-policy Value Evaluation for Reinforcement Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work extends the doubly robust estimator for bandits to sequential decision-making problems, which gets the best of both worlds: it is guaranteed to be unbiased and can have a much lower variance than the popular importance sampling estimators."
            },
            "venue": {
                "fragments": [],
                "text": "ICML"
            },
            "year": 2016
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50560492"
                        ],
                        "name": "V. Vapnik",
                        "slug": "V.-Vapnik",
                        "structuredName": {
                            "firstName": "Vladimir",
                            "lastName": "Vapnik",
                            "middleNames": [
                                "Naumovich"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Vapnik"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 116,
                                "start": 112
                            }
                        ],
                        "text": "Therefore, the problem in Equation 1 is further simplified to the following Empirical Risk Minimization problem [29] (Equation 2), where N is the number of observations (x ,y pairs) from user feedback data."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 119,
                                "start": 115
                            }
                        ],
                        "text": ", in terms of L1 or L2 norms and is the key ofW ∗ having theoretical guarantees when generalizing to the unknown P [29]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 171,
                                "start": 167
                            }
                        ],
                        "text": "Typically, supervised learning models to predict rating values or action probabilities are trained in these systems based on the theory of empirical risk minimization [29], i."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15348764,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "9642a175637a400b425f0ac0cb6a2b067cc8fe6b",
            "isKey": true,
            "numCitedBy": 662,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Learning is posed as a problem of function estimation, for which two principles of solution are considered: empirical risk minimization and structural risk minimization. These two principles are applied to two different statements of the function estimation problem: global and local. Systematic improvements in prediction power are illustrated in application to zip-code recognition."
            },
            "slug": "Principles-of-Risk-Minimization-for-Learning-Theory-Vapnik",
            "title": {
                "fragments": [],
                "text": "Principles of Risk Minimization for Learning Theory"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "Systematic improvements in prediction power and empirical risk minimization are illustrated in application to zip-code recognition."
            },
            "venue": {
                "fragments": [],
                "text": "NIPS"
            },
            "year": 1991
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1764325"
                        ],
                        "name": "Radford M. Neal",
                        "slug": "Radford-M.-Neal",
                        "structuredName": {
                            "firstName": "Radford",
                            "lastName": "Neal",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Radford M. Neal"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 31993898,
            "fieldsOfStudy": [
                "Mathematics",
                "Art"
            ],
            "id": "3bb5a439a0d610a7eac68f73068cdd278b8c9775",
            "isKey": false,
            "numCitedBy": 22025,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "the selection of symmetric factorial designs, that is, a design where all factors have the same number of levels. Chapter 3 focuses on selection of two-level factorial designs and discusses complementary design theory and related topics in the selection of designs. Chapter 4 covers the selection of three level designs followed by the general case of s-levels. Chapter 5 discusses estimation capacity, presenting the connections with complementary designs followed by the estimation capacity for two-level and s-level designs. Chapter 6 discusses and presents results for the construction of mixed-level designs. Giving many examples of the use of mixed two and four-level designs. The final unit of the book discusses designs where there are two-different groups of factors. Chapters 7 and 8 discuss factorial designs with restricted randomization. Focusing first on blocked designs for full factorials as well as blocked fractional factorial designs. Chapter 8 focuses on split-plot designs. The booked is concluded with a chapter on robust parameter designs. This book covers a broad range of topics for regular factorial designs and presents all of the material in very mathematical fashion. However, the authors do a wonderful job of keeping the statistical methodology at the forefront of the book and the mathematical detail is presented as the necessary tool to study these designs. The book will serve as a great text for an advanced graduate level course in design theory for students with the necessary mathematical background. The book will surely become an invaluable resource for researchers and graduate students doing research in the design of factorial experiments. In addition, practitioners will also find the book useful for the comprehensive collection of optimal designs presented at the end of many chapters. Overall, this is a very well written book and a necessary addition to the existing literature on the design of factorial experiments."
            },
            "slug": "Pattern-Recognition-and-Machine-Learning-Neal",
            "title": {
                "fragments": [],
                "text": "Pattern Recognition and Machine Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "This book covers a broad range of topics for regular factorial designs and presents all of the material in very mathematical fashion and will surely become an invaluable resource for researchers and graduate students doing research in the design of factorial experiments."
            },
            "venue": {
                "fragments": [],
                "text": "Technometrics"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2113861474"
                        ],
                        "name": "C. Bishop",
                        "slug": "C.-Bishop",
                        "structuredName": {
                            "firstName": "Christopher",
                            "lastName": "Bishop",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Bishop"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8147588"
                        ],
                        "name": "N. Nasrabadi",
                        "slug": "N.-Nasrabadi",
                        "structuredName": {
                            "firstName": "Nasser",
                            "lastName": "Nasrabadi",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Nasrabadi"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 63317738,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "668b1277fbece28c4841eeab1c97e4ebd0079700",
            "isKey": false,
            "numCitedBy": 10185,
            "numCiting": 368,
            "paperAbstract": {
                "fragments": [],
                "text": "Probability Distributions.- Linear Models for Regression.- Linear Models for Classification.- Neural Networks.- Kernel Methods.- Sparse Kernel Machines.- Graphical Models.- Mixture Models and EM.- Approximate Inference.- Sampling Methods.- Continuous Latent Variables.- Sequential Data.- Combining Models."
            },
            "slug": "Pattern-Recognition-and-Machine-Learning-Bishop-Nasrabadi",
            "title": {
                "fragments": [],
                "text": "Pattern Recognition and Machine Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 74,
                "text": "Probability Distributions, linear models for Regression, Linear Models for Classification, Neural Networks, Graphical Models, Mixture Models and EM, Sampling Methods, Continuous Latent Variables, Sequential Data are studied."
            },
            "venue": {
                "fragments": [],
                "text": "J. Electronic Imaging"
            },
            "year": 2007
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1699645"
                        ],
                        "name": "R. Sutton",
                        "slug": "R.-Sutton",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Sutton",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Sutton"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1730590"
                        ],
                        "name": "A. Barto",
                        "slug": "A.-Barto",
                        "structuredName": {
                            "firstName": "Andrew",
                            "lastName": "Barto",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "A. Barto"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 61032464,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "b1362879e77efef96ab552f5cb1198c2a67204d6",
            "isKey": false,
            "numCitedBy": 5197,
            "numCiting": 4,
            "paperAbstract": {
                "fragments": [],
                "text": "From the Publisher: \nIn Reinforcement Learning, Richard Sutton and Andrew Barto provide a clear and simple account of the key ideas and algorithms of reinforcement learning. Their discussion ranges from the history of the field's intellectual foundations to the most recent developments and applications. The only necessary mathematical background is familiarity with elementary concepts of probability."
            },
            "slug": "Introduction-to-Reinforcement-Learning-Sutton-Barto",
            "title": {
                "fragments": [],
                "text": "Introduction to Reinforcement Learning"
            },
            "tldr": {
                "abstractSimilarityScore": 88,
                "text": "In Reinforcement Learning, Richard Sutton and Andrew Barto provide a clear and simple account of the key ideas and algorithms of reinforcement learning."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48775815"
                        ],
                        "name": "Y. Hochberg",
                        "slug": "Y.-Hochberg",
                        "structuredName": {
                            "firstName": "Yosef",
                            "lastName": "Hochberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Hochberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1808156"
                        ],
                        "name": "Y. Benjamini",
                        "slug": "Y.-Benjamini",
                        "structuredName": {
                            "firstName": "Yoav",
                            "lastName": "Benjamini",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Y. Benjamini"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 74,
                                "start": 70
                            }
                        ],
                        "text": "In addition, we performed the Benjamini-Hochberg correction procedure [10] to control the False Discovery Rate of the analysis (effectively using around p<=0."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1322434,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "bca451df3cdfd544611cf6186e99ca991c61712b",
            "isKey": false,
            "numCitedBy": 2385,
            "numCiting": 8,
            "paperAbstract": {
                "fragments": [],
                "text": "The problem of multiple comparisons is discussed in the context of medical research. The need for more powerful procedures than classical multiple comparison procedures is indicated. To this end some new, general and simple procedures are discussed and demonstrated by two examples from the medical literature: the neuropsychologic effects of unidentified childhood exposure to lead, and the sleep patterns of sober chronic alcoholics."
            },
            "slug": "More-powerful-procedures-for-multiple-significance-Hochberg-Benjamini",
            "title": {
                "fragments": [],
                "text": "More powerful procedures for multiple significance testing."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Some new, general and simple procedures are discussed and demonstrated by two examples from the medical literature: the neuropsychologic effects of unidentified childhood exposure to lead, and the sleep patterns of sober chronic alcoholics."
            },
            "venue": {
                "fragments": [],
                "text": "Statistics in medicine"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144887187"
                        ],
                        "name": "V. Venkatesh",
                        "slug": "V.-Venkatesh",
                        "structuredName": {
                            "firstName": "V.",
                            "lastName": "Venkatesh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "V. Venkatesh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070127295"
                        ],
                        "name": "Michael G. Morris",
                        "slug": "Michael-G.-Morris",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Morris",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Michael G. Morris"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2647822"
                        ],
                        "name": "G. Davis",
                        "slug": "G.-Davis",
                        "structuredName": {
                            "firstName": "Gordon",
                            "lastName": "Davis",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Davis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1682201"
                        ],
                        "name": "Fred D. Davis",
                        "slug": "Fred-D.-Davis",
                        "structuredName": {
                            "firstName": "Fred",
                            "lastName": "Davis",
                            "middleNames": [
                                "D."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Fred D. Davis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 27,
                                "start": 23
                            }
                        ],
                        "text": "From the theory UT-AUT [30], important psychological metrics characterize the user state, which however is unobservable."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 357,
                                "start": 352
                            }
                        ],
                        "text": "• predicted rating: the predicted rating of MF-Rating for a user ID on an item ID. • predicted action: the predicted positive action probability of MF-Action for a user ID on an item ID. • recency: the release year of the movie item • popularity: the total number of ratings on the movie in the system\nReinforce-State recommender is inspired by the theory of UTAUT [30] in which the ultimate goal of a technology could be optimizing for user adoption or acceptance."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 215,
                                "start": 211
                            }
                        ],
                        "text": "In this research, we tried two new approaches in a live experiment to combine multiple factors in a principled way (also using machine learning techniques) inspired by the social theory of technology acceptance [30] and the reinforcement learning theory on decision making under uncertainty [13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 4,
                                "start": 0
                            }
                        ],
                        "text": "[30] postulates important social user factors that cause people to develop behavioral intention towards technologies and actual behavior of accepting or abandoning of the technologies."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 59,
                                "start": 53
                            }
                        ],
                        "text": "Particularly relevant to our research, the theory of UT-AUT developed by Venkatesh et al. [30] postulates important social user factors that cause people to develop behavioral intention towards technologies and actual behavior of accepting or abandoning of the technologies."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 182,
                                "start": 178
                            }
                        ],
                        "text": "• recency: the release year of the movie item • popularity: the total number of ratings on the movie in the system Reinforce-State recommender is inspired by the theory of UTAUT [30] in which the ultimate goal of a technology could be optimizing for user adoption or acceptance."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 14435677,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "f444aecb9a6cc1219d6baf81c55f23dfce3d9788",
            "isKey": true,
            "numCitedBy": 27773,
            "numCiting": 98,
            "paperAbstract": {
                "fragments": [],
                "text": "Information technology (IT) acceptance research has yielded many competing models, each with different sets of acceptance determinants. In this paper, we (1) review user acceptance literature and discuss eight prominent models, (2) empirically compare the eight models and their extensions, (3) formulate a unified model that integrates elements across the eight models, and (4) empirically validate the unified model. The eight models reviewed are the theory of reasoned action, the technology acceptance model, the motivational model, the theory of planned behavior, a model combining the technology acceptance model and the theory of planned behavior, the model of PC utilization, the innovation diffusion theory, and the social cognitive theory. Using data from four organizations over a six-month period with three points of measurement, the eight models explained between 17 percent and 53 percent of the variance in user intentions to use information technology. Next, a unified model, called the Unified Theory of Acceptance and Use of Technology (UTAUT), was formulated, with four core determinants of intention and usage, and up to four moderators of key relationships. UTAUT was then tested using the original data and found to outperform the eight individual models (adjusted R2 of 69 percent). UTAUT was then confirmed with data from two new organizations with similar results (adjusted R2 of 70 percent). UTAUT thus provides a useful tool for managers needing to assess the likelihood of success for new technology introductions and helps them understand the drivers of acceptance in order to proactively design interventions (including training, marketing, etc.) targeted at populations of users that may be less inclined to adopt and use new systems. The paper also makes several recommendations for future research including developing a deeper understanding of the dynamic influences studied here, refining measurement of the core constructs used in UTAUT, and understanding the organizational outcomes associated with new technology use."
            },
            "slug": "User-Acceptance-of-Information-Technology:-Toward-a-Venkatesh-Morris",
            "title": {
                "fragments": [],
                "text": "User Acceptance of Information Technology: Toward a Unified View"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "TAUT provides a useful tool for managers needing to assess the likelihood of success for new technology introductions and helps them understand the drivers of acceptance in order to proactively design interventions targeted at populations of users that may be less inclined to adopt and use new systems."
            },
            "venue": {
                "fragments": [],
                "text": "MIS Q."
            },
            "year": 2003
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145689002"
                        ],
                        "name": "David A. McAllester",
                        "slug": "David-A.-McAllester",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "McAllester",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David A. McAllester"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 132,
                                "start": 116
                            }
                        ],
                        "text": "Being aware that there are many different algorithms proposed for modeling both explicit and implicit feedback data [11, 16, 21, 22], we chose the classical ones for better controlling the differences of algorithms while focusing on studying the differences that are inherent in the two types of feedback data."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 64762820,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "021f6ee86cfeebaf3ee02f52b43288c225d59631",
            "isKey": false,
            "numCitedBy": 236,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "Proceedings-of-the-Twenty-Fifth-Conference-on-in-McAllester",
            "title": {
                "fragments": [],
                "text": "Proceedings of the Twenty-Fifth Conference on Uncertainty in Artificial Intelligence"
            },
            "venue": {
                "fragments": [],
                "text": "UAI 2009"
            },
            "year": 2009
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1784682"
                        ],
                        "name": "T. Hastie",
                        "slug": "T.-Hastie",
                        "structuredName": {
                            "firstName": "Trevor",
                            "lastName": "Hastie",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Hastie"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1761784"
                        ],
                        "name": "R. Tibshirani",
                        "slug": "R.-Tibshirani",
                        "structuredName": {
                            "firstName": "Robert",
                            "lastName": "Tibshirani",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Tibshirani"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3056361"
                        ],
                        "name": "J. Friedman",
                        "slug": "J.-Friedman",
                        "structuredName": {
                            "firstName": "Jerome",
                            "lastName": "Friedman",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Friedman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 58068920,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "44d71e0ec9f68d8eb802b9ab1dde8368efeac42e",
            "isKey": false,
            "numCitedBy": 11584,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "The-Elements-of-Statistical-Learning-Hastie-Tibshirani",
            "title": {
                "fragments": [],
                "text": "The Elements of Statistical Learning"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1913774"
                        ],
                        "name": "Tianqi Chen",
                        "slug": "Tianqi-Chen",
                        "structuredName": {
                            "firstName": "Tianqi",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Tianqi Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2108309275"
                        ],
                        "name": "Weinan Zhang",
                        "slug": "Weinan-Zhang",
                        "structuredName": {
                            "firstName": "Weinan",
                            "lastName": "Zhang",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Weinan Zhang"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2117522623"
                        ],
                        "name": "Qiuxia Lu",
                        "slug": "Qiuxia-Lu",
                        "structuredName": {
                            "firstName": "Qiuxia",
                            "lastName": "Lu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Qiuxia Lu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1995670"
                        ],
                        "name": "Kailong Chen",
                        "slug": "Kailong-Chen",
                        "structuredName": {
                            "firstName": "Kailong",
                            "lastName": "Chen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kailong Chen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2115548759"
                        ],
                        "name": "Zhao Zheng",
                        "slug": "Zhao-Zheng",
                        "structuredName": {
                            "firstName": "Zhao",
                            "lastName": "Zheng",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Zhao Zheng"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1811427"
                        ],
                        "name": "Yong Yu",
                        "slug": "Yong-Yu",
                        "structuredName": {
                            "firstName": "Yong",
                            "lastName": "Yu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Yong Yu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 18,
                                "start": 15
                            }
                        ],
                        "text": "See SVDFeature [6] and libFM [21] for generalized versions."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1834490,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "6338670193f9fdcfd3b6e7cec414f15ca906a85f",
            "isKey": false,
            "numCitedBy": 227,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "In this paper we introduce SVDFeature, a machine learning toolkit for feature-based collaborative filtering. SVDFeature is designed to efficiently solve the feature-based matrix factorization. The feature-based setting allows us to build factorization models incorporating side information such as temporal dynamics, neighborhood relationship, and hierarchical information. The toolkit is capable of both rate prediction and collaborative ranking, and is carefully designed for efficient training on large-scale data set. Using this toolkit, we built solutions to win KDD Cup for two consecutive years."
            },
            "slug": "SVDFeature:-a-toolkit-for-feature-based-filtering-Chen-Zhang",
            "title": {
                "fragments": [],
                "text": "SVDFeature: a toolkit for feature-based collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "SVDFeature is designed to efficiently solve the feature-based matrix factorization and is capable of both rate prediction and collaborative ranking, and is carefully designed for efficient training on large-scale data set."
            },
            "venue": {
                "fragments": [],
                "text": "J. Mach. Learn. Res."
            },
            "year": 2012
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 467,
                                "start": 464
                            }
                        ],
                        "text": ", sufficient observations are made) and fix our decision policy of making recommendations to always pick a with the largest E(y), then the recommendation problem becomes the following stochastic optimization problem, where L an objective function measuring the loss or error of estimating y with a model (or function) f and EP (x) denotes the expectation of x with respect to the distribution P (also called the Statistical Decision Theory for supervised learning [7])."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "The elements of statistical learning. Vol. 1. Springer series in statistics New York"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 87,
                                "start": 84
                            }
                        ],
                        "text": ", we focus on determinant statistical models here instead of generative models; see [5] for the difference)."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Pattern recognition and machine learning. springer"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2006
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 26,
                                "start": 23
                            }
                        ],
                        "text": "Amatriain and Basilico [3] in Netflix Blog later pushed back on researcher’s focus on rating prediction, arguing that \"accurate prediction of a movie’s rating is just one of the many components of an effective recommendation system\" and \"using predicted ratings on their own as a ranking function can exclude items that the member would want to watch even though they may not rate them highly\"."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Netflix recommendations: beyond the 5 stars (part 1)"
            },
            "venue": {
                "fragments": [],
                "text": "Netflix Tech Blog"
            },
            "year": 2012
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Netflix update: Try this at home"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2006
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 23,
            "methodology": 11,
            "result": 5
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 44,
        "totalPages": 5
    },
    "page_url": "https://www.semanticscholar.org/paper/Explicit-or-implicit-feedback-engagement-or-a-field-Zhao-Harper/f7ed7580fdddf0eaacb6610d84de1451ab7a552e?sort=total-citations"
}