{
    "links": [
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646084"
                        ],
                        "name": "B. Sarwar",
                        "slug": "B.-Sarwar",
                        "structuredName": {
                            "firstName": "Badrul",
                            "lastName": "Sarwar",
                            "middleNames": [
                                "Munir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Sarwar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50877490"
                        ],
                        "name": "G. Karypis",
                        "slug": "G.-Karypis",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Karypis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Karypis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 177,
                                "start": 169
                            }
                        ],
                        "text": "To explore that we took an algorithmic approach and used Latent Semantic Indexing (LSI) to capture the similarity between users and items in a reduced dimensional space [24, 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 208,
                                "start": 204
                            }
                        ],
                        "text": "The problems associated with high dimensionality in recommender systems have been discussed in [4], and application of dimensionality reduction techniques to address these issues has been investigated in [24]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 17065558,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "c3eddc356634d8c0d6db385567deffe1cf7cb3f6",
            "isKey": false,
            "numCitedBy": 1449,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Abstract : We investigate the use of dimensionality reduction to improve performance for a new class of data analysis software called \"recommender systems\" Recommender systems apply knowledge discovery techniques to the problem of making product recommendations during a live customer interaction. These systems are achieving widespread success in E-commerce nowadays, especially with the advent of the Internet. The tremendous growth of customers and products poses three key challenges for recommender systems in the E-commerce domain. These are: producing high quality recommendations, performing many recommendations per second for millions of customers and products, and achieving high coverage in the face of data sparsity. One successful recommender system technology is collaborative filtering, which works by matching customer preferences to other customers in making recommendations. Collaborative filtering has been shown to produce high quality recommendations, but the performance degrades with the number of customers and products. New recommender system technologies are needed that can quickly produce high quality recommendations, even for very largescale problems. This paper presents two different experiments where we have explored one technology called Singular Value Decomposition (SVD) to reduce the dimensionality of recommender system databases. Each experiment compares the quality of a recommender system using SVD with the quality of a recommender system using collaborative filtering. The first experiment compares the effectiveness of the two recommender systems at predicting consumer preferences based on a database of explicit ratings of products. The second experiment compares the effectiveness of the two recommender systems at producing Top-N lists based on a real-life customer purchase database from an E-Commerce site. Our experience suggests that SVD has the potential to meet many of the challenges of recommender systems, under certain conditions."
            },
            "slug": "Application-of-Dimensionality-Reduction-in-System-A-Sarwar-Karypis",
            "title": {
                "fragments": [],
                "text": "Application of Dimensionality Reduction in Recommender System - A Case Study"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper presents two different experiments where one technology called Singular Value Decomposition (SVD) is explored to reduce the dimensionality of recommender system databases and suggests that SVD has the potential to meet many of the challenges ofRecommender systems, under certain conditions."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144741762"
                        ],
                        "name": "P. Resnick",
                        "slug": "P.-Resnick",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Resnick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Resnick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2070970"
                        ],
                        "name": "H. Varian",
                        "slug": "H.-Varian",
                        "structuredName": {
                            "firstName": "Hal",
                            "lastName": "Varian",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Varian"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 1381259,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "dbdabdf9e653e11eb4d44f69f645a564622220b3",
            "isKey": false,
            "numCitedBy": 2816,
            "numCiting": 3,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems assist and augment this natural social process. In a typical recommender system people provide recommendations as inputs, which the system then aggregates and directs to appropriate recipients. In some cases the primary transformation is in the aggregation; in others the system’s value lies in its ability to make good matches between the recommenders and those seeking recommendations. The developers of the first recommender system, Tapestry [1], coined the phrase “collaborative filtering” and several others have adopted it. We prefer the more general term “recommender system” for two reasons. First, recommenders may not explictly collaborate with recipients, who may be unknown to each other. Second, recommendations may suggest particularly interesting items, in addition to indicating those that should be filtered out. This special section includes descriptions of five recommender systems. A sixth article analyzes incentives for provision of recommendations. Figure 1 places the systems in a technical design space defined by five dimensions. First, the contents of an evaluation can be anything from a single bit (recommended or not) to unstructured textual annotations. Second, recommendations may be entered explicitly, but several systems gather implicit evaluations: GroupLens monitors users’ reading times; PHOAKS mines Usenet articles for mentions of URLs; and Siteseer mines personal bookmark lists. Third, recommendations may be anonymous, tagged with the source’s identity, or tagged with a pseudonym. The fourth dimension, and one of the richest areas for exploration, is how to aggregate evaluations. GroupLens, PHOAKS, and Siteseer employ variants on weighted voting. Fab takes that one step further to combine evaluations with content analysis. ReferralWeb combines suggested links between people to form longer referral chains. Finally, the (perhaps aggregated) evaluations may be used in several ways: negative recommendations may be filtered out, the items may be sorted according to numeric evaluations, or evaluations may accompany items in a display. Figures 2 and 3 identify dimensions of the domain space: The kinds of items being recommended and the people among whom evaluations are shared. Consider, first, the domain of items. The sheer volume is an important variable: Detailed textual reviews of restaurants or movies may be practical, but applying the same approach to thousands of daily Netnews messages would not. Ephemeral media such as netnews (most news servers throw away articles after one or two weeks) place a premium on gathering and distributing evaluations quickly, while evaluations for 19th century books can be gathered at a more leisurely pace. The last dimension describes the cost structure of choices people make about the items. Is it very costly to miss IT IS OFTEN NECESSARY TO MAKE CHOICES WITHOUT SUFFICIENT personal experience of the alternatives. In everyday life, we rely on"
            },
            "slug": "Recommender-systems-Resnick-Varian",
            "title": {
                "fragments": [],
                "text": "Recommender systems"
            },
            "tldr": {
                "abstractSimilarityScore": 67,
                "text": "This special section includes descriptions of five recommender systems, which provide recommendations as inputs, which the system then aggregates and directs to appropriate recipients, and which combine evaluations with content analysis."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1778725"
                        ],
                        "name": "J. Breese",
                        "slug": "J.-Breese",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Breese",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Breese"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48099028"
                        ],
                        "name": "D. Heckerman",
                        "slug": "D.-Heckerman",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Heckerman",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Heckerman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1772349"
                        ],
                        "name": "C. Kadie",
                        "slug": "C.-Kadie",
                        "structuredName": {
                            "firstName": "Carl",
                            "lastName": "Kadie",
                            "middleNames": [
                                "Myers"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Kadie"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 107,
                                "start": 104
                            }
                        ],
                        "text": "schemes have been proposed to compute the association between items ranging from probabilistic approach [6] to more traditional item-item correlations [15, 13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 73
                            }
                        ],
                        "text": "Clustering model treats collaborative ltering as a classi cation problem [2, 6, 29] and works by clustering similar users in same class and estimating the probability that a particular user is in a particular class C, and from there computes the conditional probability of ratings."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 105,
                                "start": 102
                            }
                        ],
                        "text": "The resulting model is very small, very fast, and essentially as accurate as nearest neighbor methods [6]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 30,
                                "start": 27
                            }
                        ],
                        "text": "The Bayesian network model [6] formulates a probabilistic model for collaborative ltering problem."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 176,
                                "start": 173
                            }
                        ],
                        "text": "Clustering techniques usually produce less-personal recommendations than other methods, and in some cases, the clusters have worse accuracy than nearest neighbor algorithms [6]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 184,
                                "start": 181
                            }
                        ],
                        "text": "Researchers have devised a number of collaborative ltering algorithms that can be divided into two main categories|Memory-based (user-based) and Model-based (item-based) algorithms [6]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2885948,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "36b4a92c8eca6fd6d1b8588fc1fd0e3f89a16623",
            "isKey": true,
            "numCitedBy": 5689,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Collaborative filtering or recommender systems use a database about user preferences to predict additional topics or products a new user might like. In this paper we describe several algorithms designed for this task, including techniques based on correlation coefficients, vector-based similarity calculations, and statistical Bayesian methods. We compare the predictive accuracy of the various methods in a set of representative problem domains. We use two basic classes of evaluation metrics. The first characterizes accuracy over a set of individual predictions in terms of average absolute deviation. The second estimates the utility of a ranked list of suggested items. This metric uses an estimate of the probability that a user will see a recommendation in an ordered list. \n \nExperiments were run for datasets associated with 3 application areas, 4 experimental protocols, and the 2 evaluation metr rics for the various algorithms. Results indicate that for a wide range of conditions, Bayesian networks with decision trees at each node and correlation methods outperform Bayesian-clustering and vector-similarity methods. Between correlation and Bayesian networks, the preferred method depends on the nature of the dataset, nature of the application (ranked versus one-by-one presentation), and the availability of votes with which to make predictions. Other considerations include the size of database, speed of predictions, and learning time."
            },
            "slug": "Empirical-Analysis-of-Predictive-Algorithms-for-Breese-Heckerman",
            "title": {
                "fragments": [],
                "text": "Empirical Analysis of Predictive Algorithms for Collaborative Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 54,
                "text": "Several algorithms designed for collaborative filtering or recommender systems are described, including techniques based on correlation coefficients, vector-based similarity calculations, and statistical Bayesian methods, to compare the predictive accuracy of the various methods in a set of representative problem domains."
            },
            "venue": {
                "fragments": [],
                "text": "UAI"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8874758"
                        ],
                        "name": "J. Schafer",
                        "slug": "J.-Schafer",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Schafer",
                            "middleNames": [
                                "Ben"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schafer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 6,
                                "start": 2
                            }
                        ],
                        "text": ", [26] present a detailed taxonomy and example s of recommender systems used in E-commerce and how they can provide one-to-one personalization and at the s ame can capture customer loyalty."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 12438860,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "98c524def61762d9c033a64a75562e274b687763",
            "isKey": false,
            "numCitedBy": 967,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "Recommender systems are changing from novelties used by a few E-commerce sites, to serious business tools that are re-shaping the world of E-commerce. Many of the largest commerce Web sites are already using recommender systems to help their customers find products to purchase. A recommender system learns from a customer and recommends products that she will find most valuable from among the available products. In this paper we present an explanation of how recommender systems help E-commerce sites increase sales, and analyze six sites that use recommender systems including several sites that use more than one recommender system. Based on the examples, we create a taxonomy of recommender systems, including the interfaces they present to customers, the technologies used to create the recommendations, and the inputs they need from customers. We conclude with ideas for new applications of recommender systems to E-commerce."
            },
            "slug": "Recommender-systems-in-e-commerce-Schafer-Konstan",
            "title": {
                "fragments": [],
                "text": "Recommender systems in e-commerce"
            },
            "tldr": {
                "abstractSimilarityScore": 49,
                "text": "An explanation of howRecommender systems help E-commerce sites increase sales, and a taxonomy of recommender systems, including the interfaces they present to customers, the technologies used to create the recommendations, and the inputs they need from customers."
            },
            "venue": {
                "fragments": [],
                "text": "EC '99"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1691741"
                        ],
                        "name": "Daniel Billsus",
                        "slug": "Daniel-Billsus",
                        "structuredName": {
                            "firstName": "Daniel",
                            "lastName": "Billsus",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Daniel Billsus"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1694780"
                        ],
                        "name": "M. Pazzani",
                        "slug": "M.-Pazzani",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Pazzani",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Pazzani"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 98,
                                "start": 95
                            }
                        ],
                        "text": "The problems associated with high dimensionality in recommender systems have been discussed in [4], and application of dimensionality reduction techniques to address these issues has been investigated in [24]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 3036907,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "efbeedfbf13db70878618553f0c4a0fec6f493fe",
            "isKey": false,
            "numCitedBy": 1231,
            "numCiting": 13,
            "paperAbstract": {
                "fragments": [],
                "text": "Predicting items a user would like on the basis of other users’ ratings for these items has become a well-established strategy adopted by many recommendation services on the Internet. Although this can be seen as a classification problem, algorithms proposed thus far do not draw on results from the machine learning literature. We propose a representation for collaborative filtering tasks that allows the application of virtually any machine learning algorithm. We identify the shortcomings of current collaborative filtering techniques and propose the use of learning algorithms paired with feature extraction techniques that specifically address the limitations of previous approaches. Our best-performing algorithm is based on the singular value decomposition of an initial matrix of user ratings, exploiting latent structure that essentially eliminates the need for users to rate common items in order to become predictors for one another's preferences. We evaluate the proposed algorithm on a large database of user ratings for motion pictures and find that our approach significantly outperforms current collaborative filtering algorithms."
            },
            "slug": "Learning-Collaborative-Information-Filters-Billsus-Pazzani",
            "title": {
                "fragments": [],
                "text": "Learning Collaborative Information Filters"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This work proposes a representation for collaborative filtering tasks that allows the application of virtually any machine learning algorithm, and identifies the shortcomings of current collaborative filtering techniques and proposes the use of learning algorithms paired with feature extraction techniques that specifically address the limitations of previous approaches."
            },
            "venue": {
                "fragments": [],
                "text": "ICML"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646084"
                        ],
                        "name": "B. Sarwar",
                        "slug": "B.-Sarwar",
                        "structuredName": {
                            "firstName": "Badrul",
                            "lastName": "Sarwar",
                            "middleNames": [
                                "Munir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Sarwar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34093825"
                        ],
                        "name": "Al Borchers",
                        "slug": "Al-Borchers",
                        "structuredName": {
                            "firstName": "Al",
                            "lastName": "Borchers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Al Borchers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2658798"
                        ],
                        "name": "Jonathan L. Herlocker",
                        "slug": "Jonathan-L.-Herlocker",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Herlocker",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jonathan L. Herlocker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2598014"
                        ],
                        "name": "Bradley N. Miller",
                        "slug": "Bradley-N.-Miller",
                        "structuredName": {
                            "firstName": "Bradley",
                            "lastName": "Miller",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bradley N. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 112,
                                "start": 108
                            }
                        ],
                        "text": "most commonly used decision support accuracy metrics are reversal rate, weighted errors and ROC sensitivity [23]."
                    },
                    "intents": []
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 32,
                                "start": 28
                            }
                        ],
                        "text": "In our previous experiments [23] we have seen that MAE and ROC provide the same ordering of di erent experimental schemes in terms of prediction quality."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 61
                            }
                        ],
                        "text": "Sparsity problem in recommender system has been addressed in [23, 11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 115
                            }
                        ],
                        "text": "Our rst approach attempted to bridge the sparsity by incorporating semi-intelligent ltering agents into the system [23, 11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 234659,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "545e6da729bba33021521b620c05a1517201464b",
            "isKey": false,
            "numCitedBy": 495,
            "numCiting": 33,
            "paperAbstract": {
                "fragments": [],
                "text": "Collaborative filtering systems help address information overload by using the opinions of users in a community to make personal recommendations for documents to each user. Many collaborative filtering systems have few user opinions relative to the large number of documents available. This sparsity problem can reduce the utility of the filtering system by reducing the number of documents for which the system can make recommendations and adversely affecting the quality of recommendations. This paper defines and implements a model for integrating content-based ratings into a collaborative filtering system. The filterbot model allows collaborative filtering systems to address sparsity by tapping the strength of content filtering techniques. We identify and evaluate metrics for assessing the effectiveness of filterbots specifically, and filtering system enhancements in general. Finally, we experimentally validate the filterbot approach by showing that even simple filterbots such as spell checking can increase the utility for users of sparsely populated collaborative filtering systems."
            },
            "slug": "Using-filtering-agents-to-improve-prediction-in-the-Sarwar-Konstan",
            "title": {
                "fragments": [],
                "text": "Using filtering agents to improve prediction quality in the GroupLens research collaborative filtering system"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The filterbot model allows collaborative filtering systems to address sparsity by tapping the strength of content filtering techniques and is experimentally validated by showing that even simple filterbots such as spell checking can increase the utility for users of sparsely populated collaborative filtering system."
            },
            "venue": {
                "fragments": [],
                "text": "CSCW '98"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1412391493"
                        ],
                        "name": "L. Ungar",
                        "slug": "L.-Ungar",
                        "structuredName": {
                            "firstName": "Lyle",
                            "lastName": "Ungar",
                            "middleNames": [
                                "H."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Ungar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145346320"
                        ],
                        "name": "Dean P. Foster",
                        "slug": "Dean-P.-Foster",
                        "structuredName": {
                            "firstName": "Dean",
                            "lastName": "Foster",
                            "middleNames": [
                                "P."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Dean P. Foster"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 73
                            }
                        ],
                        "text": "Clustering model treats collaborative ltering as a classi cation problem [2, 6, 29] and works by clustering similar users in same class and estimating the probability that a particular user is in a particular class C, and from there computes the conditional probability of ratings."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 6565845,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "d6b99637332f818dc94c0432db617db28873e035",
            "isKey": false,
            "numCitedBy": 790,
            "numCiting": 17,
            "paperAbstract": {
                "fragments": [],
                "text": "Grouping people into clusters based on the items they have purchased allows accurate recommendations of new items for purchase: if you and I have liked many of the same movies, then I will probably enjoy other movies that you like. Recommending items based on similarity of interest (a.k.a. collaborative filtering) is attractive for many domains: books, CDs, movies, etc., but does not always work well. Because data are always sparse - any given person has seen only a small fraction of all movies - much more accurate predictions can be made by grouping people into clusters with similar movies and grouping movies into clusters which tend to be liked by the same people. Finding optimal clusters is tricky because the movie groups should be used to help determine the people groups and visa versa. We present a formal statistical model of collaborative filtering, and compare different algorithms for estimating the model parameters including variations of K-means clustering and Gibbs Sampling. This formal model is easily extended to handle clustering of objects with multiple attributes."
            },
            "slug": "Clustering-Methods-for-Collaborative-Filtering-Ungar-Foster",
            "title": {
                "fragments": [],
                "text": "Clustering Methods for Collaborative Filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 37,
                "text": "A formal statistical model of collaborative filtering is presented, and different algorithms for estimating the model parameters including variations of K-means clustering and Gibbs Sampling are compared."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI 1998"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2658798"
                        ],
                        "name": "Jonathan L. Herlocker",
                        "slug": "Jonathan-L.-Herlocker",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Herlocker",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jonathan L. Herlocker"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 151
                            }
                        ],
                        "text": "schemes have been proposed to compute the association between items ranging from probabilistic approach [6] to more traditional item-item correlations [15, 13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 109863478,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "289e24b58ce2b3fa683c10fb68c3f4fd20bf2faa",
            "isKey": false,
            "numCitedBy": 158,
            "numCiting": 76,
            "paperAbstract": {
                "fragments": [],
                "text": "Automated collaborative filtering (ACF) is a software technology that provides personalized recommendation and filtering independent of the type of content. In an ACF system, users indicate their preferences by rating their level of interest in items that the system presents. The ACF system uses the ratings information to match together users with similar interests. Finally, the ACF system can predict a user's rating for an unseen item by examining his neighbors' ratings for that item. \nThis dissertation presents a set of results with the goal of improving the effectiveness and understanding of ACF systems. The results cover four challenges: understanding and standardizing evaluation of ACF systems, improving the accuracy of ACF systems, designing and utilizing effective explanations for ACF predictions, and improving ACF to support ephemeral recommendations. To address these challenges, a combination of offline analysis and user testing is used. \nAll of the evaluation metrics that have been proposed for ACF are examined theoretically and compared empirically. The empirical results show that all proposed ACF evaluation metrics perform similarly, which argues for the adoption of a standardized evaluation metric—for which I propose mean absolute error. \nWith respect to improving algorithm accuracy, I present a detailed empirical examination of the neighborhood-based prediction algorithm, which has been the most successful algorithm, both in research and in commercial applications. \nACF systems predict based on data of variable quantity and quality, but current ACF systems are black boxes, so users have no indication of when to trust an ACF prediction. Explanations expose some of the process and data behind the ACF prediction, allowing users to judge if a prediction is appropriate for their current context of risk. I present results showing what forms of explanation users find the most compelling, as well as indications that explanations can increase the acceptance of ACF systems. \nFinally, I present results from tests of a new algorithm for supporting focused ephemeral user information needs. Ephemeral information needs are those needs that are immediate, focused, and often temporary. The proposed algorithm provides support for ephemeral information needs using no additional data beyond the standard ACF ratings."
            },
            "slug": "Understanding-and-improving-automated-collaborative-Konstan-Herlocker",
            "title": {
                "fragments": [],
                "text": "Understanding and improving automated collaborative filtering systems"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "Results are presented showing what forms of explanation users find the most compelling, as well as indications that explanations can increase the acceptance of ACF systems, and results from tests of a new algorithm for supporting focused ephemeral user information needs."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144252282"
                        ],
                        "name": "Nathaniel Good",
                        "slug": "Nathaniel-Good",
                        "structuredName": {
                            "firstName": "Nathaniel",
                            "lastName": "Good",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Nathaniel Good"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "8874758"
                        ],
                        "name": "J. Schafer",
                        "slug": "J.-Schafer",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Schafer",
                            "middleNames": [
                                "Ben"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Schafer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34093825"
                        ],
                        "name": "Al Borchers",
                        "slug": "Al-Borchers",
                        "structuredName": {
                            "firstName": "Al",
                            "lastName": "Borchers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Al Borchers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646084"
                        ],
                        "name": "B. Sarwar",
                        "slug": "B.-Sarwar",
                        "structuredName": {
                            "firstName": "Badrul",
                            "lastName": "Sarwar",
                            "middleNames": [
                                "Munir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Sarwar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2658798"
                        ],
                        "name": "Jonathan L. Herlocker",
                        "slug": "Jonathan-L.-Herlocker",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Herlocker",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jonathan L. Herlocker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 69,
                                "start": 61
                            }
                        ],
                        "text": "Sparsity problem in recommender system has been addressed in [23, 11]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 123,
                                "start": 115
                            }
                        ],
                        "text": "Our rst approach attempted to bridge the sparsity by incorporating semi-intelligent ltering agents into the system [23, 11]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 8255814,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "0000ff68310e8a43c26371b4f0ff05ddaed93577",
            "isKey": false,
            "numCitedBy": 853,
            "numCiting": 21,
            "paperAbstract": {
                "fragments": [],
                "text": "Information filtering agents and collaborative filtering both attempt to alleviate information overload by identifying which items a user will find worthwhile. Information filtering (IF) focuses on the analysis of item content and the development of a personal user interest profile. Collaborative filtering (CF) focuses on identification of other users with similar tastes and the use of their opinions to recommend items. Each technique has advantages and limitations that suggest that the two could be beneficially combined.This paper shows that a CF framework can be used to combine personal IF agents and the opinions of a community of users to produce better recommendations than either agents or users can produce alone. It also shows that using CF to create a personal combination of a set of agents produces better results than either individual agents or other combination mechanisms. One key implication of these results is that users can avoid having to select among agents; they can use them all and let the CF framework select the best ones for them."
            },
            "slug": "Combining-Collaborative-Filtering-with-Personal-for-Good-Schafer",
            "title": {
                "fragments": [],
                "text": "Combining Collaborative Filtering with Personal Agents for Better Recommendations"
            },
            "tldr": {
                "abstractSimilarityScore": 36,
                "text": "This paper shows that a CF framework can be used to combine personal IF agents and the opinions of a community of users to produce better recommendations than either agents or users can produce alone."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI/IAAI"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2735444"
                        ],
                        "name": "Upendra Shardanand",
                        "slug": "Upendra-Shardanand",
                        "structuredName": {
                            "firstName": "Upendra",
                            "lastName": "Shardanand",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Upendra Shardanand"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1701876"
                        ],
                        "name": "P. Maes",
                        "slug": "P.-Maes",
                        "structuredName": {
                            "firstName": "Pattie",
                            "lastName": "Maes",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Maes"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 69
                            }
                        ],
                        "text": "One of the most promising such technologies is collaborative ltering [19, 27, 14, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 29
                            }
                        ],
                        "text": "Collaborative Filtering (CF) [19, 27] is the most successful recommendation technique to date."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 10,
                                "start": 6
                            }
                        ],
                        "text": "Ringo [27] and Video Recommender [14] are email and webbased systems that generate recommendations on music and movies, respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 5546580,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "72e4197cef4c355a1892fa45b0f2f5c69fac75d0",
            "isKey": false,
            "numCitedBy": 3287,
            "numCiting": 18,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper describes a technique for making personalized recommendations from any type of database to a user based on similarities between the interest profile of that user and those of other users. In particular, we discuss the implementation of a networked system called Ringo, which makes personalized recommendations for music albums and artists. Ringo's database of users and artists grows dynamically as more people use the system and enter more information. Four different algorithms for making recommendations by using social information filtering were tested and compared. We present quantitative and qualitative results obtained from the use of Ringo by more than 2000 people."
            },
            "slug": "Social-information-filtering:-algorithms-for-“word-Shardanand-Maes",
            "title": {
                "fragments": [],
                "text": "Social information filtering: algorithms for automating “word of mouth”"
            },
            "tldr": {
                "abstractSimilarityScore": 46,
                "text": "The implementation of a networked system called Ringo, which makes personalized recommendations for music albums and artists, and four different algorithms for making recommendations by using social information filtering were tested and compared."
            },
            "venue": {
                "fragments": [],
                "text": "CHI '95"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1739628"
                        ],
                        "name": "L. Terveen",
                        "slug": "L.-Terveen",
                        "structuredName": {
                            "firstName": "Loren",
                            "lastName": "Terveen",
                            "middleNames": [
                                "G."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "L. Terveen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145602641"
                        ],
                        "name": "W. Hill",
                        "slug": "W.-Hill",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Hill",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1730851"
                        ],
                        "name": "B. Amento",
                        "slug": "B.-Amento",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Amento",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Amento"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2052133890"
                        ],
                        "name": "David W. McDonald",
                        "slug": "David-W.-McDonald",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "McDonald",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David W. McDonald"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680589"
                        ],
                        "name": "Josh Creter",
                        "slug": "Josh-Creter",
                        "structuredName": {
                            "firstName": "Josh",
                            "lastName": "Creter",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Josh Creter"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 229,
                                "start": 221
                            }
                        ],
                        "text": "Opinions can be explicitly given by the user as a rating score, generally within a certain numerical scale, or can be implicitly derived from purchase records, by analyzing timing logs, by mining web hyperlinks and so on [28, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 207201836,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fd7be690ff0616e308b11db03906f2c53b5f2ffd",
            "isKey": false,
            "numCitedBy": 635,
            "numCiting": 10,
            "paperAbstract": {
                "fragments": [],
                "text": "The feasibility of automatic recognition of recommendations is supported by empirical results. First, Usenet messages are a significant source of recommendations of Web resources: 23% of Usenet messages mention Web resources, and ?>0% of these mentions are recommendations. Second, recommendation instances can be machine-recognized with nearly 90% accuracy. Third, some resources are recommended by more than one person. These multiconfirmed recommendations appear to be significant resources for the relevant community. Finally, the number of distinct recommenders of a resource is a tallying, and redistributing recom-"
            },
            "slug": "PHOAKS:-a-system-for-sharing-recommendations-Terveen-Hill",
            "title": {
                "fragments": [],
                "text": "PHOAKS: a system for sharing recommendations"
            },
            "tldr": {
                "abstractSimilarityScore": 68,
                "text": "The feasibility of automatic recognition of recommendations is supported by empirical results and some resources are recommended by more than one person, and these multiconfirmed recommendations appear to be significant resources for the relevant community."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2598014"
                        ],
                        "name": "Bradley N. Miller",
                        "slug": "Bradley-N.-Miller",
                        "structuredName": {
                            "firstName": "Bradley",
                            "lastName": "Miller",
                            "middleNames": [
                                "N."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Bradley N. Miller"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "6103581"
                        ],
                        "name": "D. Maltz",
                        "slug": "D.-Maltz",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Maltz",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Maltz"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2658798"
                        ],
                        "name": "Jonathan L. Herlocker",
                        "slug": "Jonathan-L.-Herlocker",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Herlocker",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jonathan L. Herlocker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32600243"
                        ],
                        "name": "Lee R. Gordon",
                        "slug": "Lee-R.-Gordon",
                        "structuredName": {
                            "firstName": "Lee",
                            "lastName": "Gordon",
                            "middleNames": [
                                "R."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Lee R. Gordon"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 229,
                                "start": 221
                            }
                        ],
                        "text": "Opinions can be explicitly given by the user as a rating score, generally within a certain numerical scale, or can be implicitly derived from purchase records, by analyzing timing logs, by mining web hyperlinks and so on [28, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 69
                            }
                        ],
                        "text": "One of the most promising such technologies is collaborative ltering [19, 27, 14, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 30
                            }
                        ],
                        "text": "The GroupLens research system [19, 16] provides a pseudonymous collaborative ltering solution for Usenet news and movies."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 15008577,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "59e914c920497dd931f1b5fe7151f071d80713de",
            "isKey": false,
            "numCitedBy": 2669,
            "numCiting": 15,
            "paperAbstract": {
                "fragments": [],
                "text": "newsgroups carry a wide enough spread of messages to make most individuals consider Usenet news to be a high noise information resource. Furthermore, each user values a different set of messages. Both taste and prior knowledge are major factors in evaluating news articles. For example, readers of the rec.humor newsgroup, a group designed for jokes and other humorous postings, value articles based on whether they perceive them to be funny. Readers of technical groups, such as comp.lang.c11 value articles based on interest and usefulness to them—introductory questions and answers may be uninteresting to an expert C11 programmer just as debates over subtle and advanced language features may be useless to the novice. The combination of high volume and personal taste made Usenet news a promising candidate for collaborative filtering. More formally, we determined the potential predictive utility for Usenet news was very high. The GroupLens project started in 1992 and completed a pilot study at two sites to establish the feasibility of using collaborative filtering for Usenet news [8]. Several critical design decisions were made as part of that pilot study, including:"
            },
            "slug": "GroupLens:-applying-collaborative-filtering-to-news-Konstan-Miller",
            "title": {
                "fragments": [],
                "text": "GroupLens: applying collaborative filtering to Usenet news"
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "The combination of high volume and personal taste made Usenet news a promising candidate for collaborative filtering and the potential predictive utility for Usenets news was very high."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1997
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32646084"
                        ],
                        "name": "B. Sarwar",
                        "slug": "B.-Sarwar",
                        "structuredName": {
                            "firstName": "Badrul",
                            "lastName": "Sarwar",
                            "middleNames": [
                                "Munir"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Sarwar"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50877490"
                        ],
                        "name": "G. Karypis",
                        "slug": "G.-Karypis",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Karypis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Karypis"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 177,
                                "start": 169
                            }
                        ],
                        "text": "To explore that we took an algorithmic approach and used Latent Semantic Indexing (LSI) to capture the similarity between users and items in a reduced dimensional space [24, 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 213,
                                "start": 209
                            }
                        ],
                        "text": "The rule-based approach applies association rule discovery algorithms to nd association between co-purchased items and then generates item recommendation based on the strength of the association between items [25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 12366165,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "3219f5733e87afbe1481f7f99c0d06c7c9752c31",
            "isKey": false,
            "numCitedBy": 1980,
            "numCiting": 40,
            "paperAbstract": {
                "fragments": [],
                "text": "ABSTRACT Re ommender systems apply statisti al and knowledge disovery te hniques to the problem of making produ t re ommendations during a live ustomer intera tion and they are a hieving widespread su ess in E-Commer e nowadays. In this paper, we investigate several te hniques for analyzing large-s ale pur hase and preferen e data for the purpose of produ ing useful re ommendations to ustomers. In parti ular, we apply a olle tion of algorithms su h as traditional data mining, nearest-neighbor ollaborative ltering, and dimensionality redu tion on two di erent data sets. The rst data set was derived from the web-pur hasing transa tion of a large Eommer e ompany whereas the se ond data set was olle ted from MovieLens movie re ommendation site. For the experimental purpose, we divide the re ommendation generation pro ess into three sub pro esses{ representation of input data, neighborhood formation, and re ommendation generation. We devise di erent te hniques for di erent sub pro esses and apply their ombinations on our data sets to ompare for re ommendation quality and performan e."
            },
            "slug": "Analysis-of-recommendation-algorithms-for-Sarwar-Karypis",
            "title": {
                "fragments": [],
                "text": "Analysis of recommendation algorithms for e-commerce"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "This paper investigates several te hniques for analyzing large-s ale pur hase and preferen e data for the purpose of producing useful re ommendations to ustomers and devise and apply their ombinations on the authors' data sets to ompare for re Ommendation quality and performan e."
            },
            "venue": {
                "fragments": [],
                "text": "EC '00"
            },
            "year": 2000
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144741762"
                        ],
                        "name": "P. Resnick",
                        "slug": "P.-Resnick",
                        "structuredName": {
                            "firstName": "Paul",
                            "lastName": "Resnick",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Resnick"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32895600"
                        ],
                        "name": "N. Iacovou",
                        "slug": "N.-Iacovou",
                        "structuredName": {
                            "firstName": "Neophytos",
                            "lastName": "Iacovou",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "N. Iacovou"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "48185525"
                        ],
                        "name": "M. Suchak",
                        "slug": "M.-Suchak",
                        "structuredName": {
                            "firstName": "Mitesh",
                            "lastName": "Suchak",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Suchak"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2073783270"
                        ],
                        "name": "P. Bergstrom",
                        "slug": "P.-Bergstrom",
                        "structuredName": {
                            "firstName": "Peter",
                            "lastName": "Bergstrom",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "P. Bergstrom"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "UNPAYWALL"
                },
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 69
                            }
                        ],
                        "text": "One of the most promising such technologies is collaborative ltering [19, 27, 14, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 29
                            }
                        ],
                        "text": "Collaborative Filtering (CF) [19, 27] is the most successful recommendation technique to date."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 38,
                                "start": 30
                            }
                        ],
                        "text": "The GroupLens research system [19, 16] provides a pseudonymous collaborative ltering solution for Usenet news and movies."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 2616594,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "64a717dc148b76070bbb6a3190a7e05bb9734400",
            "isKey": false,
            "numCitedBy": 5852,
            "numCiting": 31,
            "paperAbstract": {
                "fragments": [],
                "text": "Collaborative filters help people make choices based on the opinions of other people. GroupLens is a system for collaborative filtering of netnews, to help people find articles they will like in the huge stream of available articles. News reader clients display predicted scores and make it easy for users to rate articles after they read them. Rating servers, called Better Bit Bureaus, gather and disseminate the ratings. The rating servers predict scores based on the heuristic that people who agreed in the past will probably agree again. Users can protect their privacy by entering ratings under pseudonyms, without reducing the effectiveness of the score prediction. The entire architecture is open: alternative software for news clients and Better Bit Bureaus can be developed independently and can interoperate with the components we have developed."
            },
            "slug": "GroupLens:-an-open-architecture-for-collaborative-Resnick-Iacovou",
            "title": {
                "fragments": [],
                "text": "GroupLens: an open architecture for collaborative filtering of netnews"
            },
            "tldr": {
                "abstractSimilarityScore": 63,
                "text": "GroupLens is a system for collaborative filtering of netnews, to help people find articles they will like in the huge stream of available articles, and protect their privacy by entering ratings under pseudonyms, without reducing the effectiveness of the score prediction."
            },
            "venue": {
                "fragments": [],
                "text": "CSCW '94"
            },
            "year": 1994
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2658798"
                        ],
                        "name": "Jonathan L. Herlocker",
                        "slug": "Jonathan-L.-Herlocker",
                        "structuredName": {
                            "firstName": "Jonathan",
                            "lastName": "Herlocker",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Jonathan L. Herlocker"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2478310"
                        ],
                        "name": "J. Konstan",
                        "slug": "J.-Konstan",
                        "structuredName": {
                            "firstName": "Joseph",
                            "lastName": "Konstan",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Konstan"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34093825"
                        ],
                        "name": "Al Borchers",
                        "slug": "Al-Borchers",
                        "structuredName": {
                            "firstName": "Al",
                            "lastName": "Borchers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Al Borchers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2579342"
                        ],
                        "name": "J. Riedl",
                        "slug": "J.-Riedl",
                        "structuredName": {
                            "firstName": "John",
                            "lastName": "Riedl",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Riedl"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 149,
                                "start": 145
                            }
                        ],
                        "text": "The bottleneck in conventional collaborative ltering algorithms is the search for neighbors among a large user population of potential neighbors [12]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 93,
                                "start": 89
                            }
                        ],
                        "text": "We also compared our algorithms against the naive nonpersonalized algorithm described in [12]."
                    },
                    "intents": [
                        {
                            "id": "result"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 81,
                                "start": 77
                            }
                        ],
                        "text": "The size of the neighborhood has signi cant impact on the prediction quality [12]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 3079360,
            "fieldsOfStudy": [
                "Geology"
            ],
            "id": "333b5c0f2b750f737b725496e2b75a6330f5cc54",
            "isKey": false,
            "numCitedBy": 2249,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage and that copies bear this notice and the full citation on the first page. To copy otherwise, to republish, to post on servers or to redistribute to lists, requires prior specific permission and/or a fee."
            },
            "slug": "An-algorithmic-framework-for-performing-filtering-Herlocker-Konstan",
            "title": {
                "fragments": [],
                "text": "An algorithmic framework for performing collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 100,
                "text": "Permission to make digital or hard copies of all or part of this work for personal or classroom use is granted without fee provided that copies are not made or distributed for profit or commercial advantage."
            },
            "venue": {
                "fragments": [],
                "text": "SIGIR '99"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2777533"
                        ],
                        "name": "R. Brachman",
                        "slug": "R.-Brachman",
                        "structuredName": {
                            "firstName": "Ronald",
                            "lastName": "Brachman",
                            "middleNames": [
                                "J."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Brachman"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2671056"
                        ],
                        "name": "T. Khabaza",
                        "slug": "T.-Khabaza",
                        "structuredName": {
                            "firstName": "Tom",
                            "lastName": "Khabaza",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Khabaza"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1745608"
                        ],
                        "name": "W. Klösgen",
                        "slug": "W.-Klösgen",
                        "structuredName": {
                            "firstName": "Willi",
                            "lastName": "Klösgen",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Klösgen"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1398381803"
                        ],
                        "name": "G. Piatetsky-Shapiro",
                        "slug": "G.-Piatetsky-Shapiro",
                        "structuredName": {
                            "firstName": "Gregory",
                            "lastName": "Piatetsky-Shapiro",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Piatetsky-Shapiro"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1777206"
                        ],
                        "name": "Evangelos Simoudis",
                        "slug": "Evangelos-Simoudis",
                        "structuredName": {
                            "firstName": "Evangelos",
                            "lastName": "Simoudis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Evangelos Simoudis"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 10178313,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "60c228f2dbc88307464605df9e820d9e0f36491a",
            "isKey": false,
            "numCitedBy": 236,
            "numCiting": 11,
            "paperAbstract": {
                "fragments": [],
                "text": "a phenomenal rate. From the financial sector to telecommunications operations , companies increasingly rely on analysis of huge amounts of data to compete. Although ad hoc mixtures of statistical techniques and file management tools once sufficed for digging through mounds of corporate data, the size of modern data warehouses, the mission-critical nature of the data, and the speed with which analyses need to be made now call for a new approach. A new generation of techniques and tools is emerging to intelligently assist humans in analyzing mountains of data and finding critical nuggets of useful knowledge, and in some cases to perform analyses automatically. These techniques and tools are the subject of the growing field of knowledge discovery in databases (KDD) [5]. KDD is an umbrella term describing a variety of activities for making sense of data. We use the term to describe the overall process of finding useful patterns in data, including not only the data mining step of running specific discovery algorithms but also pre-and postprocessing and a host of other important activities. Our goal here is to provide a brief overview of the key issues in knowledge discovery in an industrial context and outline representative applications. The different data mining methods at the core of the KDD process can have different goals. In general, we distinguish two types: • Verification, in which the system is limited to verifying a user's hypothesis, and • Discovery, in which the system finds new patterns. Ad hoc techniques—no longer adequate for sifting through vast collections of data—are giving way to data mining and knowledge discovery for turning corporate data into competitive business advantage."
            },
            "slug": "Mining-business-databases-Brachman-Khabaza",
            "title": {
                "fragments": [],
                "text": "Mining business databases"
            },
            "tldr": {
                "abstractSimilarityScore": 40,
                "text": "The goal here is to provide a brief overview of the key issues in knowledge discovery in an industrial context and outline representative applications."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1996
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145602641"
                        ],
                        "name": "W. Hill",
                        "slug": "W.-Hill",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Hill",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Hill"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2948323"
                        ],
                        "name": "Larry Stead",
                        "slug": "Larry-Stead",
                        "structuredName": {
                            "firstName": "Larry",
                            "lastName": "Stead",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Larry Stead"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "32986105"
                        ],
                        "name": "Mark Rosenstein",
                        "slug": "Mark-Rosenstein",
                        "structuredName": {
                            "firstName": "Mark",
                            "lastName": "Rosenstein",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Mark Rosenstein"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2737579"
                        ],
                        "name": "G. Furnas",
                        "slug": "G.-Furnas",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Furnas",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Furnas"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 85,
                                "start": 69
                            }
                        ],
                        "text": "One of the most promising such technologies is collaborative ltering [19, 27, 14, 16]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 37,
                                "start": 33
                            }
                        ],
                        "text": "Ringo [27] and Video Recommender [14] are email and webbased systems that generate recommendations on music and movies, respectively."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 2455777,
            "fieldsOfStudy": [
                "Psychology"
            ],
            "id": "c864175780adde19099108de66b4636f4c87d44c",
            "isKey": false,
            "numCitedBy": 1296,
            "numCiting": 12,
            "paperAbstract": {
                "fragments": [],
                "text": "When making a choice in the absence of decisive first-hand knowledge, choosing as other like-minded, similarly-situated people have successfully chosen in the past is a good strategy — in effect, using other people as filters and guides: filters to strain out potentially bad choices and guides to point out potentially good choices. Current human-computer interfaces largely ignore the power of the social strategy. For most choices within an interface, new users are left to fend for themselves and if necessary, to pursue help outside of the interface. We present a general history-of-use method that automates a social method for informing choice and report on how it fares in the context of a fielded test case: the selection of videos from a large set. The positive results show that communal history-of-use data can serve as a powerful resource for use in interfaces."
            },
            "slug": "Recommending-and-evaluating-choices-in-a-virtual-of-Hill-Stead",
            "title": {
                "fragments": [],
                "text": "Recommending and evaluating choices in a virtual community of use"
            },
            "tldr": {
                "abstractSimilarityScore": 39,
                "text": "A general history-of-use method that automates a social method for informing choice and report on how it fares in the context of a fielded test case: the selection of videos from a large set of videos."
            },
            "venue": {
                "fragments": [],
                "text": "CHI '95"
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1688204"
                        ],
                        "name": "C. Ling",
                        "slug": "C.-Ling",
                        "structuredName": {
                            "firstName": "Charles",
                            "lastName": "Ling",
                            "middleNames": [
                                "X."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Ling"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2128662602"
                        ],
                        "name": "Chenghui Li",
                        "slug": "Chenghui-Li",
                        "structuredName": {
                            "firstName": "Chenghui",
                            "lastName": "Li",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Chenghui Li"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 17199559,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "24c70681e0e1f68810b753f32bcca266f8f47804",
            "isKey": false,
            "numCitedBy": 748,
            "numCiting": 29,
            "paperAbstract": {
                "fragments": [],
                "text": "Direct marketing is a process of identifying likely buyers of certain products and promoting the products accordingly. It is increasingly used by banks, insurance companies, and the retail industry. Data mining can provide an effective tool for direct marketing. During data mining, several specific problems arise. For example, the class distribution is extremely unbalanced (the response rate is about 1%), the predictive accuracy is no longer suitable for evaluating learning methods, and the number of examples can be too large. In this paper, we discuss methods of coping with these problems based on our experience on direct-marketing projects using data mining."
            },
            "slug": "Data-Mining-for-Direct-Marketing:-Problems-and-Ling-Li",
            "title": {
                "fragments": [],
                "text": "Data Mining for Direct Marketing: Problems and Solutions"
            },
            "tldr": {
                "abstractSimilarityScore": 42,
                "text": "This paper discusses methods of coping with problems during data mining based on the experience on direct-marketing projects using data mining, and suggests a simple yet effective way of evaluating learning methods."
            },
            "venue": {
                "fragments": [],
                "text": "KDD"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "38111918"
                        ],
                        "name": "David Goldberg",
                        "slug": "David-Goldberg",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Goldberg",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "David Goldberg"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "152473861"
                        ],
                        "name": "D. Nichols",
                        "slug": "D.-Nichols",
                        "structuredName": {
                            "firstName": "David",
                            "lastName": "Nichols",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Nichols"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1724602"
                        ],
                        "name": "B. Oki",
                        "slug": "B.-Oki",
                        "structuredName": {
                            "firstName": "Brian",
                            "lastName": "Oki",
                            "middleNames": [
                                "M."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "B. Oki"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1680763"
                        ],
                        "name": "D. Terry",
                        "slug": "D.-Terry",
                        "structuredName": {
                            "firstName": "Douglas",
                            "lastName": "Terry",
                            "middleNames": [
                                "B."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "D. Terry"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 13,
                                "start": 9
                            }
                        ],
                        "text": "Tapestry [10] is one of the earliest implementations of collaborative ltering-based recommender systems."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1591394,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "fe9cd9ab8bcc110847a8a4792134e4917fd7e933",
            "isKey": false,
            "numCitedBy": 4098,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The Tapestry experimental mail system developed at the Xerox Palo Alto Research Center is predicated on the belief that information filtering can be more effective when humans are involved in the filtering process. Tapestry was designed to support both content-based filtering and collaborative filtering, which entails people collaborating to help each other perform filtering by recording their reactions to documents they read. The reactions are called annotations; they can be accessed by other people’s filters. Tapestry is intended to handle any incoming stream of electronic documents and serves both as a mail filter and repository; its components are the indexer, document store, annotation store, filterer, little box, remailer, appraiser and reader/browser. Tapestry’s client/server architecture, its various components, and the Tapestry query language are described."
            },
            "slug": "Using-collaborative-filtering-to-weave-an-tapestry-Goldberg-Nichols",
            "title": {
                "fragments": [],
                "text": "Using collaborative filtering to weave an information tapestry"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "Tapestry is intended to handle any incoming stream of electronic documents and serves both as a mail filter and repository; its components are the indexer, document store, annotation store, filterer, little box, remailer, appraiser and reader/browser."
            },
            "venue": {
                "fragments": [],
                "text": "CACM"
            },
            "year": 1992
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2082168647"
                        ],
                        "name": "Don Peppers",
                        "slug": "Don-Peppers",
                        "structuredName": {
                            "firstName": "Don",
                            "lastName": "Peppers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Don Peppers"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2068098474"
                        ],
                        "name": "Martha Rogers",
                        "slug": "Martha-Rogers",
                        "structuredName": {
                            "firstName": "Martha",
                            "lastName": "Rogers",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Martha Rogers"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 108234791,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "bc4135e4d298beb8d78e92cff55188c433dfa670",
            "isKey": false,
            "numCitedBy": 749,
            "numCiting": 1,
            "paperAbstract": {
                "fragments": [],
                "text": "The One to One Future revolutionized marketing when it was first published. Then considered a radical rethinking of marketing basics, this bestselling book has become today's bible for marketers. Now finally available in paperback, this completely revised and updated edition - with an all-new User's Guide - takes readers step-by-step through the latest strategies needed for any business to compete, and succeed, in the Interactive Age. Most businesses follow time-honored mass-marketing rules of pitching their products to the greatest number of people. However, selling more goods to fewer people is not only more efficient but far more profitable. The One to One Future is a radically innovative business paradigm focusing on the share of customer - one customer at a time - rather than just the share of market. Authors Don Peppers and Martha Rogers reveal one to one strategies to: * Find the 20 percent - or 2 percent - of your own customers and prospects who are the most loyal and who offer the biggest opportunities for future profit; * Collaborate with each customer, one at a time, just as you now work with individual suppliers or marketing partners; * Nurture your relationships with each customer by relying on new one to one media vehicles - not just the mail, but the fax machine, the touch-tone phone, voice mail, cell phones, and interactive television. Leading-edge companies such as MCI, Lexus, Levi Strauss, and Nissan Canada, and thousands of smaller enterprises, have already adopted the one-to-one perspective. The strategies outlined in this book work just as well - often even better - for small companies, from two-person accounting firms to flower shops to furniture stores."
            },
            "slug": "The-One-to-One-Future:-Building-Relationships-One-a-Peppers-Rogers",
            "title": {
                "fragments": [],
                "text": "The One to One Future: Building Relationships One Customer at a Time (Будущее персонализации: построение взаимоотношений с одним клиентом)"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1754295"
                        ],
                        "name": "C. Basu",
                        "slug": "C.-Basu",
                        "structuredName": {
                            "firstName": "Chumki",
                            "lastName": "Basu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Basu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3025731"
                        ],
                        "name": "H. Hirsh",
                        "slug": "H.-Hirsh",
                        "structuredName": {
                            "firstName": "Haym",
                            "lastName": "Hirsh",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "H. Hirsh"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50056360"
                        ],
                        "name": "William W. Cohen",
                        "slug": "William-W.-Cohen",
                        "structuredName": {
                            "firstName": "William",
                            "lastName": "Cohen",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "William W. Cohen"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 83,
                                "start": 73
                            }
                        ],
                        "text": "Clustering model treats collaborative ltering as a classi cation problem [2, 6, 29] and works by clustering similar users in same class and estimating the probability that a particular user is in a particular class C, and from there computes the conditional probability of ratings."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 14176567,
            "fieldsOfStudy": [
                "Biology"
            ],
            "id": "ae30f8fc5a969d2d14ae066db4cd07d86fadbf42",
            "isKey": false,
            "numCitedBy": 1161,
            "numCiting": 22,
            "paperAbstract": {
                "fragments": [],
                "text": "Methionine5-enkephalin sulfoxides and sulfones having agonist activity at opiate receptors are disclosed herein. These sulfoxides and sulfones are useful as analgesics, non-addicting narcotic antagonists and anti-diarrheal agents."
            },
            "slug": "Recommendation-as-Classification:-Using-Social-and-Basu-Hirsh",
            "title": {
                "fragments": [],
                "text": "Recommendation as Classification: Using Social and Content-Based Information in Recommendation"
            },
            "tldr": {
                "abstractSimilarityScore": 51,
                "text": "These sulfoxides and sulfones are useful as analgesics, non-addicting narcotic antagonists and anti-diarrheal agents and having agonist activity at opiate receptors are disclosed herein."
            },
            "venue": {
                "fragments": [],
                "text": "AAAI/IAAI"
            },
            "year": 1998
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "14990148"
                        ],
                        "name": "F. Reichheld",
                        "slug": "F.-Reichheld",
                        "structuredName": {
                            "firstName": "Frederick",
                            "lastName": "Reichheld",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. Reichheld"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 23631187,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "8fef7dcaf49b00dd453fd7bef4fc45d1eb03b2b4",
            "isKey": false,
            "numCitedBy": 1444,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Despite a flurry of activities aimed at serving customers better, few companies have systematically revamped their operations with customer loyalty in mind. Instead, most have adopted improvement programs ad hoc, and paybacks haven't materialized. Building a highly loyal customer base must be integral to a company's basic business strategy. Loyalty leaders like MBNA credit cards are successful because they have designed their entire business systems around customer loyalty--a self-reinforcing system in which the company delivers superior value consistently and reinvents cash flows to find and keep high-quality customers and employees. The economic benefits of high customer loyalty are measurable. When a company consistently delivers superior value and wins customer loyalty, market share and revenues go up, and the cost of acquiring new customers goes down. The better economics mean the company can pay workers better, which sets off a whole chain of events. Increased pay boosts employee moral and commitment; as employees stay longer, their productivity goes up and training costs fall; employees' overall job satisfaction, combined with their experience, helps them serve customers better; and customers are then more inclined to stay loyal to the company. Finally, as the best customers and employees become part of the loyalty-based system, competitors are left to survive with less desirable customers and less talented employees. To compete on loyalty, a company must understand the relationships between customer retention and the other parts of the business--and be able to quantify the linkages between loyalty and profits. It involves rethinking and aligning four important aspects of the business: customers, product/service offering, employees, and measurement systems."
            },
            "slug": "Loyalty-based-management.-Reichheld",
            "title": {
                "fragments": [],
                "text": "Loyalty-based management."
            },
            "tldr": {
                "abstractSimilarityScore": 41,
                "text": "To compete on loyalty, a company must understand the relationships between customer retention and the other parts of the business--and be able to quantify the linkages between loyalty and profits."
            },
            "venue": {
                "fragments": [],
                "text": "Harvard business review"
            },
            "year": 1993
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2271549"
                        ],
                        "name": "M. Berry",
                        "slug": "M.-Berry",
                        "structuredName": {
                            "firstName": "Michael",
                            "lastName": "Berry",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "M. Berry"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728602"
                        ],
                        "name": "S. Dumais",
                        "slug": "S.-Dumais",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Dumais",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dumais"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1401512392"
                        ],
                        "name": "G. O'Brien",
                        "slug": "G.-O'Brien",
                        "structuredName": {
                            "firstName": "Gavin",
                            "lastName": "O'Brien",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. O'Brien"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 7580761,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "06871028d4e71ceefe879853e9dc2183ea81bb32",
            "isKey": false,
            "numCitedBy": 1777,
            "numCiting": 35,
            "paperAbstract": {
                "fragments": [],
                "text": "Currently, most approaches to retrieving textual materials from scientific databases depend on a lexical match between words in users’ requests and those in or assigned to documents in a database. ..."
            },
            "slug": "Using-Linear-Algebra-for-Intelligent-Information-Berry-Dumais",
            "title": {
                "fragments": [],
                "text": "Using Linear Algebra for Intelligent Information Retrieval"
            },
            "tldr": {
                "abstractSimilarityScore": 45,
                "text": "A lexical match between words in users’ requests and those in or assigned to documents in a database helps retrieve textual materials from scientific databases."
            },
            "venue": {
                "fragments": [],
                "text": "SIAM Rev."
            },
            "year": 1995
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "133975514"
                        ],
                        "name": "F. F. Reichheld",
                        "slug": "F.-F.-Reichheld",
                        "structuredName": {
                            "firstName": "Fredrick",
                            "lastName": "Reichheld",
                            "middleNames": [
                                "F."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "F. F. Reichheld"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "95838183"
                        ],
                        "name": "W. Sasser",
                        "slug": "W.-Sasser",
                        "structuredName": {
                            "firstName": "W.",
                            "lastName": "Sasser",
                            "middleNames": [
                                "Earl"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "W. Sasser"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 1653534,
            "fieldsOfStudy": [
                "Business"
            ],
            "id": "3cf9e452adceb66ead134d9377ae8155016aa259",
            "isKey": false,
            "numCitedBy": 6062,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Companies that want to improve their service quality should take a cue from manufacturing and focus on their own kind of scrap heap: customers who won't come back. Because that scrap heap can be every bit as costly as broken parts and misfit components, service company managers should strive to reduce it. They should aim for \"zero defections\"--keeping every customer they can profitably serve. As companies reduce customer defection rates, amazing things happen to their financials. Although the magnitude of the change varies by company and industry, the pattern holds: profits rise sharply. Reducing the defection rate just 5% generates 85% more profits in one bank's branch system, 50% more in an insurance brokerage, and 30% more in an auto-service chain. And when MBNA America, a Delaware-based credit card company, cut its 10% defection rate in half, profits rose a whopping 125%. But defection rates are not just a measure of service quality; they are also a guide for achieving it. By listening to the reasons why customers defect, managers learn exactly where the company is falling short and where to direct their resources. Staples, the stationery supplies retailer, uses feedback from customers to pinpoint products that are priced too high. That way, the company avoids expensive broad-brush promotions that pitch everything to everyone. Like any important change, managing for zero defections requires training and reinforcement. Great-West Life Assurance Company pays a 50% premium to group health-insurance brokers that hit customer-retention targets, and MBNA America gives bonuses to departments that hit theirs."
            },
            "slug": "Zero-defections:-quality-comes-to-services.-Reichheld-Sasser",
            "title": {
                "fragments": [],
                "text": "Zero defections: quality comes to services."
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "Defection rates are not just a measure of service quality; they are also a guide for achieving it; by listening to the reasons why customers defect, managers learn exactly where the company is falling short and where to direct their resources."
            },
            "venue": {
                "fragments": [],
                "text": "Harvard business review"
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "73497302"
                        ],
                        "name": "J. E. Jackson",
                        "slug": "J.-E.-Jackson",
                        "structuredName": {
                            "firstName": "J.",
                            "lastName": "Jackson",
                            "middleNames": [
                                "Edward"
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. E. Jackson"
                    }
                ]
            ],
            "badges": [],
            "citationContexts": [],
            "corpusId": 120459689,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "4b8701c0be232496a475974b27bc4c443b75dded",
            "isKey": false,
            "numCitedBy": 374,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": "Contents: Preface. Introduction and Spearman Approach. Centroid Method Rotation in Two Dimensions. Elements of Matrix Algebra. Linear Computations. The Principal-Axes Method. Rotation of Axes. Extended Vectors Varieties of Simple Structure. Orthogonal Transformations. Oblique Transformations. Refinement Transformations. Second-Order and Hierarchical Analysis. Component Analysis. Factor Scores. Cluster Analysis of Variables. Simplex Analysis. Some Special Problems. Appendices: Answers to Problems and Exercises. Computer Programs."
            },
            "slug": "Factor-analysis,-an-applied-approach-Jackson",
            "title": {
                "fragments": [],
                "text": "Factor analysis, an applied approach"
            },
            "tldr": {
                "abstractSimilarityScore": 43,
                "text": "This book discusses Spearman Approach to Matrix Algebra, the Principal-Axes Method, and its applications in Computer Programs and Hierarchical Analysis."
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2365155"
                        ],
                        "name": "S. Deerwester",
                        "slug": "S.-Deerwester",
                        "structuredName": {
                            "firstName": "Scott",
                            "lastName": "Deerwester",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Deerwester"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1728602"
                        ],
                        "name": "S. Dumais",
                        "slug": "S.-Dumais",
                        "structuredName": {
                            "firstName": "Susan",
                            "lastName": "Dumais",
                            "middleNames": [
                                "T."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "S. Dumais"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1836606"
                        ],
                        "name": "T. Landauer",
                        "slug": "T.-Landauer",
                        "structuredName": {
                            "firstName": "Thomas",
                            "lastName": "Landauer",
                            "middleNames": [
                                "K."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "T. Landauer"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "2737579"
                        ],
                        "name": "G. Furnas",
                        "slug": "G.-Furnas",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Furnas",
                            "middleNames": [
                                "W."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Furnas"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "3154682"
                        ],
                        "name": "R. Harshman",
                        "slug": "R.-Harshman",
                        "structuredName": {
                            "firstName": "Richard",
                            "lastName": "Harshman",
                            "middleNames": [
                                "A."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "R. Harshman"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [],
            "corpusId": 3252915,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "20a80a7356859daa4170fb4da6b87b84adbb547f",
            "isKey": false,
            "numCitedBy": 13230,
            "numCiting": 59,
            "paperAbstract": {
                "fragments": [],
                "text": "A new method for automatic indexing and retrieval is described. The approach is to take advantage of implicit higher-order structure in the association of terms with documents (“semantic structure”) in order to improve the detection of relevant documents on the basis of terms found in queries. The particular technique used is singular-value decomposition, in which a large term by document matrix is decomposed into a set of ca. 100 orthogonal factors from which the original matrix can be approximated by linear combination. Documents are represented by ca. 100 item vectors of factor weights. Queries are represented as pseudo-document vectors formed from weighted combinations of terms, and documents with supra-threshold cosine values are returned. initial tests find this completely automatic method for retrieval to be promising."
            },
            "slug": "Indexing-by-Latent-Semantic-Analysis-Deerwester-Dumais",
            "title": {
                "fragments": [],
                "text": "Indexing by Latent Semantic Analysis"
            },
            "tldr": {
                "abstractSimilarityScore": 89,
                "text": "A new method for automatic indexing and retrieval to take advantage of implicit higher-order structure in the association of terms with documents (“semantic structure”) in order to improve the detection of relevant documents on the basis of terms found in queries."
            },
            "venue": {
                "fragments": [],
                "text": "J. Am. Soc. Inf. Sci."
            },
            "year": 1990
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "1682418"
                        ],
                        "name": "C. Aggarwal",
                        "slug": "C.-Aggarwal",
                        "structuredName": {
                            "firstName": "Charu",
                            "lastName": "Aggarwal",
                            "middleNames": [
                                "C."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "C. Aggarwal"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "34588256"
                        ],
                        "name": "J. Wolf",
                        "slug": "J.-Wolf",
                        "structuredName": {
                            "firstName": "Joel",
                            "lastName": "Wolf",
                            "middleNames": [
                                "L."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "J. Wolf"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "145271132"
                        ],
                        "name": "Kun-Lung Wu",
                        "slug": "Kun-Lung-Wu",
                        "structuredName": {
                            "firstName": "Kun-Lung",
                            "lastName": "Wu",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Kun-Lung Wu"
                    }
                ],
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "144019071"
                        ],
                        "name": "Philip S. Yu",
                        "slug": "Philip-S.-Yu",
                        "structuredName": {
                            "firstName": "Philip",
                            "lastName": "Yu",
                            "middleNames": [
                                "S."
                            ]
                        }
                    },
                    {
                        "fragments": [],
                        "text": "Philip S. Yu"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 108,
                                "start": 105
                            }
                        ],
                        "text": "In one study using synthetic data, Horting produced better predictions than a nearest neighbor algorithm [1]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 82,
                                "start": 79
                            }
                        ],
                        "text": "users, and edges between nodes indicate degree of similarity between two users [1]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "corpusId": 1723821,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "15ded7b78b697b0c83e179d4a2464f3284119b8d",
            "isKey": false,
            "numCitedBy": 478,
            "numCiting": 14,
            "paperAbstract": {
                "fragments": [],
                "text": "This paper introduces a new and novel approach to ratingbased collaborative filtering. The new technique is most appropriate for e-commerce merchants offering one or more groups of relatively homogeneous items such as compact disks, videos, books, software and the like. In contrast with other known collaborative filtering techniques, the new algorithm is graph-theoretic, based on the twin new concepts of ho&rag and predictability. As is demonstrated in this paper, the technique is fast, scalable, accurate, and requires only a modest learning curve. It makes use of a hierarchical classification scheme in order to introduce context into the rating process, and uses so-called creative links in order to find surprising and atypical items to recommend, perhaps even items which cross the group boundaries. The new technique is one of the key engines of the Intelligent Recommendation Algorithm (IRA) project, now being developed at IBM Research. In addition to several other recommendation engines, IRA contains a situation analyzer to determine the most appropriate mix of engines for a particular e-commerce merchant, as well as an engine for optimizing the placement of advertisements."
            },
            "slug": "Horting-hatches-an-egg:-a-new-graph-theoretic-to-Aggarwal-Wolf",
            "title": {
                "fragments": [],
                "text": "Horting hatches an egg: a new graph-theoretic approach to collaborative filtering"
            },
            "tldr": {
                "abstractSimilarityScore": 62,
                "text": "This paper introduces a new and novel approach to ratingbased collaborative filtering, based on the twin new concepts of ho&rag and predictability, which is fast, scalable, accurate, and requires only a modest learning curve."
            },
            "venue": {
                "fragments": [],
                "text": "KDD '99"
            },
            "year": 1999
        },
        {
            "authors": [
                [
                    {
                        "bitmap$0": false,
                        "ids": [
                            "50877490"
                        ],
                        "name": "G. Karypis",
                        "slug": "G.-Karypis",
                        "structuredName": {
                            "firstName": "George",
                            "lastName": "Karypis",
                            "middleNames": []
                        }
                    },
                    {
                        "fragments": [],
                        "text": "G. Karypis"
                    }
                ]
            ],
            "badges": [
                {
                    "id": "OPEN_ACCESS"
                }
            ],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 159,
                                "start": 151
                            }
                        ],
                        "text": "schemes have been proposed to compute the association between items ranging from probabilistic approach [6] to more traditional item-item correlations [15, 13]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "corpusId": 1661995,
            "fieldsOfStudy": [
                "Computer Science"
            ],
            "id": "87036444c5dcbe8b2d0a95140fe8bbcfe22fea42",
            "isKey": false,
            "numCitedBy": 719,
            "numCiting": 23,
            "paperAbstract": {
                "fragments": [],
                "text": "The explosive growth of the world-wide-web and the emergence of e-commerce has led to the development of recommender systems---a personalized information filtering technology used to identify a set of N items that will be of interest to a certain user. User-based Collaborative filtering is the most successful technology for building recommender systems to date, and is extensively used in many commercial recommender systems. Unfortunately, the computational complexity of these methods grows linearly with the number of customers that in typical commercial applications can grow to be several millions. To address these scalability concerns item-based recommendation techniques have been developed that analyze the user-item matrix to identify relations between the different items, and use these relations to compute the list of recommendations.In this paper we present one such class of item-based recommendation algorithms that first determine the similarities between the various items and then used them to identify the set of items to be recommended. The key steps in this class of algorithms are (i) the method used to compute the similarity between the items, and (ii) the method used to combine these similarities in order to compute the similarity between a basket of items and a candidate recommender item. Our experimental evaluation on five different datasets show that the proposed item-based algorithms are up to 28 times faster than the traditional user-neighborhood based recommender systems and provide recommendations whose quality is up to 27% better."
            },
            "slug": "Evaluation-of-Item-Based-Top-N-Recommendation-Karypis",
            "title": {
                "fragments": [],
                "text": "Evaluation of Item-Based Top-N Recommendation Algorithms"
            },
            "tldr": {
                "abstractSimilarityScore": 44,
                "text": "The experimental evaluation on five different datasets show that the proposed item-based algorithms are up to 28 times faster than the traditional user-neighborhood based recommender systems and provide recommendations whose quality is up to 27% better."
            },
            "venue": {
                "fragments": [],
                "text": "CIKM '01"
            },
            "year": 2001
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 99,
                                "start": 96
                            }
                        ],
                        "text": "The problems associat ed with high dimensionality in recommender systems have been discussed in [4], and application of dimensionali ty reduction techniques to address these issues has been investigated in [24]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Learning Collabo  rative Information Filters"
            },
            "venue": {
                "fragments": [],
                "text": "InProceedings of ICML"
            },
            "year": 1998
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Factor Analysis: An Applied Approach. Lawrence Erlbaum associates pubs"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 177,
                                "start": 169
                            }
                        ],
                        "text": "To explore that we took an algorithmic approach and used Latent Semantic Indexing (LSI) to capture the similarity between users and items in a reduced dimensional space [24, 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 213,
                                "start": 209
                            }
                        ],
                        "text": "The rule-based approach applies association rule discovery algorithms to nd association between co-purchased items and then generates item recommendation based on the strength of the association between items [25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Analysis of Recommendation Algo-  rithms for E-Commerce"
            },
            "venue": {
                "fragments": [],
                "text": "In Proceedings of the ACM EC'00 Conference"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 177,
                                "start": 169
                            }
                        ],
                        "text": "To explore that we took an algorithmic approach and used Latent Semantic Indexing (LSI) to capture the similarity between users and items in a reduced dimensional space [24, 25]."
                    },
                    "intents": [
                        {
                            "id": "methodology"
                        }
                    ]
                },
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 208,
                                "start": 204
                            }
                        ],
                        "text": "The problems associated with high dimensionality in recommender systems have been discussed in [4], and application of dimensionality reduction techniques to address these issues has been investigated in [24]."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Application of Dimensionality Reduc-  tion in Recommender System{A Case Study"
            },
            "venue": {
                "fragments": [],
                "text": "WebKDD"
            },
            "year": 2000
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Zero Defect  ions: Quality Comes to Services. Harvard Business School Review"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1990
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Loyalty-Based Management.  Harvard Business School Review"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1993
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Advances in Knowl-  edge Discovery and Data Mining"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1996
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Factor Anal  ysis: An Applied Approach.Lawrence Erlbaum associates pubs"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1983
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Recommender Systems. Special issue of Communications of the ACM"
            },
            "venue": {
                "fragments": [],
                "text": "Recommender Systems. Special issue of Communications of the ACM"
            },
            "year": 1997
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Usi ng Linear Algebra for Intelligent Information Retrieval.SIAM Review"
            },
            "venue": {
                "fragments": [],
                "text": ""
            },
            "year": 1995
        },
        {
            "authors": [],
            "badges": [],
            "citationContexts": [
                {
                    "context": {
                        "fragments": [
                            {
                                "end": 88,
                                "start": 78
                            }
                        ],
                        "text": "C lustering model treats collaborative filtering as a classifi cation problem [2, 6, 29] and works by clustering similar users in sa me class and estimating the probability that a particular user is in a particular class C, and from there computes the conditional probability of rat ings."
                    },
                    "intents": [
                        {
                            "id": "background"
                        }
                    ]
                }
            ],
            "fieldsOfStudy": [],
            "isKey": false,
            "numCitedBy": 0,
            "numCiting": 0,
            "paperAbstract": {
                "fragments": [],
                "text": ""
            },
            "slug": "+",
            "title": {
                "fragments": [],
                "text": "Clustering Method s for Collaborative Filtering"
            },
            "venue": {
                "fragments": [],
                "text": "InWorkshop on Recommender Systems at the 15th National Conference on Artificial Intelligence"
            },
            "year": 1998
        }
    ],
    "meta_info": {
        "citationIntent": "all",
        "citationIntentCount": {
            "background": 19,
            "methodology": 12,
            "result": 1
        },
        "citationType": "citedPapers",
        "pageNumber": 1,
        "requestedPageSize": 10,
        "sort": "relevance",
        "totalCitations": 39,
        "totalPages": 4
    },
    "page_url": "https://www.semanticscholar.org/paper/Item-based-collaborative-filtering-recommendation-Sarwar-Karypis/f82c52452c7de8cd6472202c1be2cce9fbcb8dda?sort=total-citations"
}